{
 "title": "Slapping the Bird",
 "author": "AppK",
 "citation": " AppK. \"Slapping the Bird: experience with DOI, Methoxetamine, Cannabis, Zolpidem & Alcohol (ID 93987)\". Erowid.org. Oct 22, 2012. erowid.org/exp/93987",
 "substance": "DOI, Methoxetamine, Cannabis, Zolpidem & Alcohol",
 "bodyweight": "136 lb",
 "report": "<p>To begin with, I would like to clarify some background information and apologize for lack of punctuation in otherwise unnecessary places. This report is based on my first two experiences of something considered a true psychedelic hallucinogen. Prior experiences: veteran DXM user with trips up to 1600mg [pure only, CCC can kill you], PCP, 4-Meo-PCP, heavy cannabis smoker, hydrocodone [Vicodin], oxycodone [Roxicet], codeine, methoxetamine [dissociative RC] , Benadryl, JWH-018 [cannabinoid], cocaine, d-amphetamine, alprazolam [Xanax], lorazepam [Ativan], zolpidem [Ambien]. Possibly a couple more that have slipped my mind.</p><p>The day started great, I had received 2 days prior my order of 25C-NBOMe, methoxetamine, and DOI. I had tried the 25C for the first time the day of the arrival. Dosage was 1 blotter containing 400 mcg pure lab grade chemical. Effects felt like a dose of any antidepressant, jittery and uncomfortable energy nothing like speed energy or god-like DXM energy, just weird.</p><p>This lack of a trip had me craving a real trip, I looked forward to the day I would dose with DOI. Kindly awaiting my usual 2 accompanying Astronauts, the day came where I could wait no longer!</p><p>T+0:00 It was around 7pm the sky was just turning gray. I had come to terms that I would test this DOI on my own to determine dosage. I took 10 mg semi-carefully weighed out on a 1mg accurate scale. \r[Erowid Note: 10 mg of DOI is considered an extremely high dose, see DOI PIHKAL Dose Range]</p><p>T+0:10 It turns out my girlfriend wants to hangout, I drive to her house still sober.</p><p>T+0:30 I arrive and I am still sober, I had always wanted to watch Fear and Loathing in Las Vegas and figured no time would be better than now, Damn was I right!</p><p>T+0:50 We finally played the movie on Netflix and I still had no feeling of a high. I decided to showcase my supply of a favorite RC methoxetamine self-nicknamed 'Mettix' pronounced medics. I dosed on my house key to where I had previously drawn a line after weighing 50mgs the day it arrived, therefore the dose may have been anywhere from 40-60mgs. Me and my girl both insufflate the Mettix.</p><p>T+0:55 I feel the effects of the Mettix take place, spaciness is setting in. I want more [not recommended to new users of Mettix due to my tolerance from DXM, PCP, 4-Meo-PCP and prior Mettix use]. I dose again with the key.</p><p>T+1:00 The confusion I have fallen in love with from dissociatives sets in, my GF's mom is screaming at my GFs sister who has run off, she calls for help. My GF appears to literally fly down the stairs. I sense the feeling of the front door being open, thinking about it now this is odd...I was on the second floor the door being many feet below me yet I had that feeling of air escaping. I now associate this with the first sensations of DOI.</p><p>T+1:10 Time is now forgotten as with all dissociatives mere minutes have extended to hours. My GF comes bouncing back up the stairs exclaiming jumping feels like flying!!! Fearing getting busted by her mom, I attempt to calm her on her first trip on anything other than cannabis and alcohol.</p><p>The movie is now attempted to be watched. Oddly enough I feel extremely absorbed into the movie. I can feel every single movement Johnny Depp makes. The movie seems like dozens of quick trips pieced together! It consists of mindless jabbering and escalating suspense then followed by a climaxing scene followed by a dull scene then repeated. This merry go round proves to be extremely exhilarating. Though the trip factor is gone when the movie is viewed sober it seems like two sober men talking and walking strange only while inebriated was I able to feel the movie, not simply watch it.</p><p>The movie ended and it was my time to leave. I say my goodbyes and head to my car. Inside my car I now feel the first red flag alert in my mind signaling something strange was definitely going on, with words from Fear and Loathing consuming my mind. I simply kept thinking fucking coppers and looking around, though not feeling paranoid just silly. [Erowid Note: Driving while intoxicated or tripping is dangerous and irresponsible because it endangers other people. Don't do it!] The drive was commenced. I forgot to play music regretfully, music usually calms my mind and allows me to focus while driving. Roads all looked familiar as if leading to my house, I got lost, and quickly noticing I was NOT fit to drive. I stopped I called my friend G who I knew to be nearby. I drove 2 blocks to the McDonalds and parked my car.</p><p>My life is unusually filled with extremely fortunate events, this day was no exception. Fortunately G was in that very same McDonalds with his friend F. G and F were on Xanax bars and cocaine, and bowls and bowls of cannabis. G was obviously out of it from the bars and F was still seemingly in the real world. No importance was payed to the fact I just met F, I felt like I'd known him all my life.</p><p>I tell them I took DOI, F is intrigued and wants to know more. I start to like this guy; he seems very knowledgeable of psychoactive materials as I am; we get along great. He agrees to dose on it. He claims to be extremely heavyweight on visual trips and wants to visualize I eyeball a dose about 3 times higher than what I took of DOI he snorts it. We head to G's house.\r[Erowid Note: A volume amount of one powder doesn't necessarily weigh the same as the same volume of another powder. For substances active at such a small dose, eyeballing is particularly unwise. See related article]</p><p>I attempt to show F Fear and Loathing. F offers me a hit from an overly packed 3 foot bong, I say no knowing cannabis tends to give me great anxiety after once having a panic attack on speed induced by smoking cannabis.</p><p>HERE IS WHERE MY FIRST TRUE PSYCHEDELIC EXPERIENCE BEGINS</p><p>F left the room. G is knocked out on his bed from the bars. I start to realize I have no visuals so I focus on the walls I try to bring forth the visuals.</p><p>There is a feeling of a mental shift, I felt as if I had been viewing the world within me the whole time and not viewing the outside world, I am filled with this vibrating energy. My whole body is now vibrating. I was rewarded by having lines appear on the walls and the xbox I was attempting to play Fear and Loathing on had a bright green screen being displayed. This green seemed to stretch out into the real world - the whole room was now flooded in green light if only for mere seconds.</p><p>F returns he tells me that its not visual like acid but contains heavy tracers. I have no idea as to what tracers are. He explains and I am amazed. I move my hands back and forth and seem to have 1000 manifestations of my hands. F runs out of cocaine so I decide to show him my Mettix knowing it's a NDRI and cocaine being an NDRI I figure it to be a substitute worthy of trying.</p><p>Once agreed and having established him as an experienced dissociative user due to his claims of DXM usage we both dose 2 keys each. He calls the combination amazing and is in awe of the effects he wishes to wake up G and give him some. While he does that I continue to look around. There are hundreds of what I believe were small pin holes in G's walls that began to move around and dance.</p><p>Not being able to wake up G and it getting to be 2 am we decide to leave G's house and head to mine.</p><p>At this time something funny happened that kept us for another hour or so in G's house. F had lost 50$ earlier in G's house and had searched for it to no avail. It now turns out my socks were lost! I could only find one and this proved to give us the giggles we kept laughing about it. I tipped over G's trash can and tobacco came out. The tobacco danced and created patterns all over the floor - it seemed to have become mercury, it even clumped up into a floating mass. Deciding to leave the sock I found and instead take a pair from G we left. I waited till F decided he was more or less fit to drive as he was more experienced on the hallucinogenic side of things. Being 2 am the streets were empty and my house was 5 minutes away we made it.\r[Erowid Note: Driving while intoxicated or tripping is dangerous and irresponsible because it endangers other people. Don't do it!]</p><p>He wants to smoke more weed & I decline but then remember that I have Ambien prescribed. This has proven to eliminate my anxiety while taken prior and allows me to smoke. I finely crush a 10mg pill and insufflate half the powder all at once to avoid a burn.</p><p>We head out back. F packs a bowl in his pipe and he smokes. I take 2 small hits. The Ambien being hallucinogenic on its own creates something beautiful.</p><p>The dark of the night around me begins to swirl. F being a slightly chubby individual transforms into a skinny girl. I am amazed, but once he is done smoking we enter the house the light changes him back to himself. I enter my bathroom. I wet my face and I am pulled into staring at my mirror image.</p><p>Thoughts of the Devil presiding over the water realm flood my mind. The water on my face gives my skin a reptilian like appearance. Where there is water, there is lines of aqua colored reptile skin replacing the water on my face. I cup my hands and submerge them into the now filling sink. I drink, my whole body takes the form of a beautiful humanoid with stripes of reptile like skin. I assume it to be Lucifer. As I finish swallowing the transformation ends. Every time I drink I transform. I have a conversation with Lucifer. Although nothing is said back to me, responses are received. I leave the bathroom and rejoin F. The weed seems negligible and non existent inside me. I take more Ambien regardless, loving the melting and visuals it created. The remaining half is insufflated.</p><p>My room is now 3D. 3D as in a badly done 3D movie where the depth is exaggerated but even more so exaggerated. I can only describe it as moving scenery backdrop in a play where there is a layer of grass then a layer of moving ducks or what not and then a layer of sky.</p><p>Viewing F sitting on my bed he appeared to be a puny midget, floating before my bed rather than on it, and my bed seemed to be before my wall. I was thirsty and decided to get water.</p><p>I served it in a mug. I later attempted to place this mug on my desk but the desk was way too melted. The cup seemed to lean to one side and wobble. F helped me place the cup which remained slanted to me. The desk then began to melt completely and I was absorbed by this visual. F decided he had to leave since he had work the next day. I simply went to sleep. [This was only possible due to the Ambien.]</p><p>The next day I awoke still slapping the bird, self-coined for tripping balls on a DXM trip. I said tripping balls backwards as a codename which was sllab gnippirt, pronounced slab nibbert, which sounded like slapping the bird to me. The visuals were just simple movements and slight tracers which left sometime around midday.</p><p>THE SECOND EXPERIENCE</p><p>4 mg of DOI</p><p>4 beers (bottled)</p><p>Because of the experience with DOI and Ambien I created a hypothesis: GABA had interacted with DOI, taken the the linear visuals and created melting natural-like breathing visuals.</p><p>The Experiment:</p><p>I chose to take DOI with beer on the trip with my usual explorers of the spacial mental realm. They have experienced mushrooms, salvia, and LSD. They said it was like LSD to the T minus the long length and immensely vibrating energy (guess that's the amphetamine side of DOI). Although this was more subtle than Ambien, beer still acted upon the GABA receptors. I was given breathing visuals and had for the first time experienced The Tree is Alive Syndrome in the pouring rain with 4 umbrellas held like spartans in the movie 300 covering one another. I waited as they smoked bud, then they showed me a tree the tree seemed to be speaking to me! The leaves were moving in such a way that insinuated LIFE pure LIFE! It was no longer a simple tree it was now a friend (: !!! I hugged the tree and then we left.</p><p>Inside we listened to psytrance. This intensified the trip 10 fold! (Ananda Shake is a wonderful psytrance group.) The rain seemed to be in the room until I said out loud to myself WHAT THE F! ITS NOT RAINING. I could even feel the drops. I guess it was the wet clothes. This persisted for a while. I watched my friend play YuGiOh with his Cuban friend and the cards being moved around created such amazing tracers worthy of applause throughout the trip. Everything was funny. When we attempted to sleep music had to be played as they cannot sleep without music playing although his GF also needs to watch something. She picked the most annoying show with bimbos that said like in every sentence. I requested a boring show like Discovery Channel's 'Giant Ships' or something like that. This was bad - everything they said was hilarious, every boat shown was hilarious. We had no sleep and just giggled a lot randomly. Till the next day.</p><p>In conclusion, DOI mixed with a GABA activating drug can create a potent LSD like trip.</p><p>I have also found that dosing on DOI does not intensify the trip so much as prolong the trip. The trip was just as strong baseline on only DOI on these 4 mg as it was on 10 but less long. It ended in the early morning and began purposely at 7 as well. As a side note the buzzing energy you can let go of if it truly bothers you though I urge you NOT to do this as it will be gone for the duration of the trip and the lack of it will leave you quite dull and self absorbed.</p>",
 "year": "2011",
 "id": "93987",
 "gender": "Male",
 "age": "18",
 "timestamp": "2012-10-22T07:00:00.000Z",
 "views": "3072",
 "dose": [
  {
   "time": "0",
   "amount": "10 mg",
   "administration": "oral",
   "substance": "DOI",
   "form": "(powder / crystals)"
  },
  {
   "time": " T+ 0:50",
   "amount": "2 bumps",
   "administration": "insufflated",
   "substance": "Methoxetamine ",
   "form": "(powder / crystals)"
  },
  {
   "time": " T+ 0:00",
   "amount": "5 mg",
   "administration": "insufflated",
   "substance": "Pharms - Zolpidem",
   "form": "(ground / crushed)"
  },
  {
   "time": " T+ 0:00",
   "amount": "2 hits",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": ""
  },
  {
   "time": " T+ 0:00",
   "amount": "5 mg",
   "administration": "insufflated",
   "substance": "Pharms - Zolpidem",
   "form": "(ground / crushed)"
  },
  {
   "time": " T+ 0:00",
   "amount": "4 glasses",
   "administration": "oral",
   "substance": "Alcohol - Beer/Wine",
   "form": "(liquid)"
  }
 ]
}
