{
 "id": 9399,
 "title": "Canceled the Intoxication, But Not the Trip",
 "date": {
  "submission": "2009-11-11T08:00:00.000Z",
  "experience": "2006-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Lt spore",
  "gender": "Male",
  "weight": 76
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "number": "6",
    "unit": "caps"
   },
   "administration": "oral",
   "substance": "Mushrooms",
   "form": "fresh",
   "specific": "P. cubensis"
  },
  {
   "time": "3:00",
   "amount": {
    "number": "10",
    "unit": "mg"
   },
   "administration": "oral",
   "substance": "Cyclobenzaprine",
   "form": "pill/tablet"
  }
 ],
 "report": [
  "Let me apoligize ahead of time for not having a exact does of the mushrooms I took. The main objective for this report is to display the interaction of mushrooms and flexaril. The only other report I have seen on the combination says that the two cancel each other out. This is my experience to the contrary.",
  "I have smoked more pot then any human should ever injest. I have taken mushrooms maybe 10 times. I have also taken MDE and dabbled in DXM. I have a very strong tolerence to hallucinating. Not the drugs themselves but the visual effects. I've eaten half eights of dried mushrooms with mild buzz effects and whole eights that just made colors brighter. Until this I hadn't had a full blown mushroom trip despite trying. Enough history.",
  "At 8:30 am after waking up and cleaning the house a little I injested six whole fresh mushrooms boiled then turned into koolaid. The smell of mushrooms makes me sick so I use this method. I use a third cup of water bring it to a light boil, add chopped shrooms. Let it sit off the heat for 10 minutes, add to cup of ice and LOTS of some powder drink mix that doesn't need sugar. The mushrooms were the thickness of a pencil and 6 inches long. When dry they are as thick as a wire hanger and 3 inches long. The mushrooms were grown by me and picked the day before and kept in the fridge. They were from a Mexican mushroom kit purchased at a smart shop.",
  "My last meal was small and around 13 hours prior so a very empty stomach. The effects took about 20 minutes to set in. Reality was starting to get a little more vivid and interesting and I had a little bit of the giggles.",
  "T+00:45- effects started becoming strong and time stopped making sense. Colors are very vivid and for the first time ever I see very distinct patterns in the air and on objects. My wife and I decide to go for a very small walk. The sights on my walk were amazing. I have many amazing gardens in my neibhorhood that make for interesting viewing in the cool crisp air. Unfortentately I almost freak out as I try to keep a straight face and try not to sound to stoned when I talk. So my walk was over very quick before I get in trouble.",
  "About T+1:15- I start sinking faster and faster in to the trip. All very enjoyable. I have an out of body experience of sorts and I see some sort of fantasy world all around me with giant mushrooms and elves and all the cliche fairy tale stuff. It's very much like a lucid dream except more intense because it seems real not like a dream at all. I could control my body and thoughts still but I was no longer inside my house I was somewhere that I was sure didn't really exist.",
  "At this point my memory becomes fuzzy but I do remember that around three hours into the trip I was very mentally tired and just wanted it to all calm down so I could relax and chill out as my trip was very intense and taxing. So I decided to drink some soda and eat some food and just try to dull the effects any way I could. After about an hour of eating as much as my stomach would allow it wasn't working at all and wasn't showing any sign of slowing down.",
  "T+3:00- I have eaten way to many mushrooms around 6 months ago because of a mistake. I had injested to much of two different strains (one strong one weak) and that trip lasted 6 hours and ended in vomiting and a bad place. My trip was going ok so far but I could see it going in a bad direction if it went on hours more. Then I remembered reading a report of someone taking flexaril and it canceling out thier mushroom trip. I had a supply of flexaril I recieved for back problems but rarely use because they put me to sleep. So I took a 10 mg pill and waited and watched some tv.",
  "T+4:00- the pill starts to kick in and only the power of a dozen so mountian dews fends off the sleepies, and still I got caught napping. By this time the mushrooms started to slow and reality was returning. I was happy thinking my pill had worked at it's intended purpose. But instead of the mushroom trip coming down and returning to normal at most 7 hours after injestion like all my other trips, I was stuck. I came down but I hit a block on the way down. I wasn't really tripping like I was but reality still was very much not normal and my perception and mind was still distorted but I was not intoxicated. It was a very clean distorten, oxymoron I know. For example when I take mushrooms my brain is intoxicated and it feel like I'm drunk and tripping. This was just like the tripping part but no intoxication.",
  "Keep in mind I had been tripping since 9am. So I go into town and walk around, go to a few stores and just ride in the car and watch the trees go by as I drive. [Erowid Note: Driving while intoxicated or tripping is dangerous and irresponsible because it endangers other people. Don't do it!] This state persisted the entire day and was very annoying and not fun. I got to sleep around 9 or 10pm making it a 13 hour trip. When I woke up the next morning I felt completely normal and only then did I notice the difference from my post mushroom state to normal baseline.",
  "I am positive it was from the pill and not the mushrooms alone because the amount I took wasn't excessive. The intial trip was so strong because of the empty stomach. I had a friend who claimed to trip off a few pills of flexaril and see zoo animals walking around on the street. How he stayed awake to see them I have no idea. So this extra trip could have been from the pill alone. Either way I'm sure the mushrooms did not help. It was not a good thing."
 ],
 "erowid": {
  "id": "56827",
  "citation": " Lt spore. \"Canceled the Intoxication, But Not the Trip: experience with Mushrooms - P. cubensis & Cyclobenzaprine (Flexeril) (ID 56827)\". Erowid.org. Nov 11, 2009. erowid.org/exp/56827",
  "substance": "Mushrooms - P. cubensis & Cyclobenzaprine (Flexeril)",
  "views": "8983"
 }
}
