{
 "title": "Stuck",
 "author": "Ange",
 "citation": " Ange. \"Stuck: experience with Products - Spice and Synthetic Cannabinoids ('Demon') (ID 94072)\". Erowid.org. Jul 27, 2012. erowid.org/exp/94072",
 "substance": "Products - Spice and Synthetic Cannabinoids ('Demon')",
 "bodyweight": "115 lb",
 "header": [
  "DOSE:",
  "2 hits",
  "smoked",
  "Products - Spice and Synthetic Cannabinoids"
 ],
 "report": "<p>I apologize for the length of this post, but this is a very vivid, disturbing experience for me, and if I can prevent someone else from experiencing anything like it, its worth it to me. I decided to try a (then) legal version of cannabis when I was 21. This herbal smoking blend was called Demon, and was a favorite of my significant other, so I wasn't too worried about any negative experiences. I was wrong.</p><p>I had tried bud quite a few times, and I always had very positive experiences. I was usually very light, positive, hungry and happy, and frequently ended the night with fantastic sexual experiences and a great nights sleep. I believe my first mistake was smoking out of a water pipe. I was used to smoking out of a spoon pipe, and did not realize that I would get a stronger, cleaner hit from a water pipe, but since this was his usual form of smoking Demon, I didnt complain.</p><p>We began smoking while sitting on bar stools in his kitchen. I knew I would be safe in his house, as his roommates were my friends and also smoked, so I had no worries of being caught or getting in any kind of trouble. I also turned off and hid my phone, just in case I decided I needed to call family members. (That had been a common issue with former highs). After feeling I was prepared, I let my boyfriend light the bowl.</p><p>I didnt immediately feel anything, and I noticed that smoking Demon was unlike bud in that it didnt burn at all, had a very sweet scent, and vaguely reminded me of cooking spices. I was able to hold my hit for about ten seconds before exhaling, and decided to take another hit since I didnt feel anything. After about ten minutes I began to feel increasingly heavy and uncomfortable.  The smoke coming from my boyfriends mouth formed faces that scared me. It didnt feel anything like any other time I had smoked, where I gradually felt lighter, happier and warm. It was the exact opposite.</p><p>I realized a few things at the same time. One: I couldnt move my limbs at all. Two: I had no idea what was going on, but I couldnt see anything around me. Three: I knew I needed to lie down, but I couldnt move, and I also couldnt figure out where I was in relation to the bedroom. I began to feel as if my body and then everything around me was being sucked into my head, and I began to think I was going to be forever trapped within my brain. I then convinced myself I was in a coma and my entire life had been a dream, and when I died in this reality, I would wake up from my coma.</p><p>Every five minutes or so, I would snap back to reality, see the water pipe sitting on the counter and realize where I was. Before I could tell my boyfriend that something was horribly wrong, I was back into my head. I felt trapped: like I couldnt escape from my own brain. I was terrified. I felt like I was screaming, but no noise was coming out of my mouth. Apparently, the whole time this was happening, I was sitting on the bar stool perfectly still staring at the wall.</p><p>My boyfriend eventually became afraid and tried to pick me up and move me into the bedroom. It was as if I was seeing what was happening from a third person perspective, and I couldnt speak. I couldnt move. I was completely rigid, and when I finally snapped back to reality I was still in a sitting position, lying on my side in the bed. At a few points I apparently mumbled this is real, the pipe is real, the counter is real, I dont want to go back before slipping back into my mind.</p><p>After I came down, I remember crying. I hated the feeling of being completely helpless, and unable to tell anyone what was happening. It was as if I couldnt even distinguish that I was just having a bad trip: I just thought this was my new permanent reality. I felt like my high lasted for days, but in reality it only lasted a few hours. I felt tired, heavy and sick to my stomach, and my eyes were bloodshot. My mouth was extremely dry, and my boyfriend was terrified. Needless to say, not something I will be doing again.</p>",
 "year": "2010",
 "id": "94072",
 "gender": "Female",
 "age": "21",
 "timestamp": "2012-07-27T07:00:00.000Z",
 "views": "2700",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "2 hits",
   "administration": "smoked",
   "substance": "Products - Spice and Synthetic Cannabinoids"
  }
 }
}
