{
 "id": 941,
 "title": "Pumped Up, Full On Trip",
 "date": {
  "submission": "2002-02-18T08:00:00.000Z",
  "experience": "2001"
 },
 "author": {
  "name": "Senorsalvia",
  "gender": "Male",
  "weight": "140 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "22 mg",
   "administration": "oral",
   "substance": "2C-I",
   "form": "(capsule)"
  }
 ],
 "report": [
  "<p>Having recently acquired a gram of 2C-I, I journey to a town I used to live in, looked up another friend who is interested in psychonautical journeys, and we each ingested 22mg I had previously weighed out into gel caps.",
  "T+40min",
  "Starting to feel a slight alert. (pre trip jitters)   We decide to go for a walk.",
  "T+60min.",
  "The clouds are taking on a delightful rosy glow.  Both trippers can't tell how much is the coming sundown, or how much is the coming 2C-I effects.",
  "T+120 min.",
  "The sidewalk is melting around us; the cars are giving off long trails that smear into the patterns we are seeing everywhere...We both remark that this effect is alot like 'ole time acid', but with no mental affect whatsoever... We love the mental clarity and the removal of all the potential negative vibes that come with LSD... We each buy a bottle of tea with lemon... Taste seems normal.",
  "T+245min.",
  "We are having a hard time walking across the street, as we can't easily judge the distance of oncoming traffic...We decide to go back to the room....  We both are commenting that although the color saturation is somewhat less than mesc or acid, we are really into the way the world is patterning and melting around us....We agree that we love this material, and can't wait to share it with others at a future date.",
  "T+3hrs.",
  "We are peaking!! There is heightened colors, tending to run to bright yellows, golds and greens... Our minds are completely clear... We can't get over the fact that we are having a 'pumped up, full on trip', and yet the mind remains completely clear... Great stuff.",
  "T+4,5,6hrs.",
  "We talk about society, solve most of the world problems, laugh,  just have a great trip...We notice that time dilation has occurred... (we thought maybe 45 min had passed, it had been three hours)",
  "T+7,8,9,hours.",
  "We wind down smoothly, feeling great, no head ache, no bodily concerns... I slept  for 5 hours and awakened feeling great, rejuvinated, blessed by the psychedelic Gods!!",
  "Great material--No need for higher dosage....Thank you Sasha!!!!!!!!!!</p>"
 ],
 "erowid": {
  "id": "12691",
  "citation": " Senorsalvia. \"Pumped Up, Full On Trip: experience with 2C-I (ID 12691)\". Erowid.org. Feb 18, 2002. erowid.org/exp/12691",
  "substance": "2C-I",
  "views": "8723"
 }
}
