{
 "title": "Handfuls of the Universe",
 "author": "Karcinogenious",
 "citation": " Karcinogenious. \"Handfuls of the Universe: experience with DMT Cannabis (ID 94114)\". Erowid.org. Jun 17, 2013. erowid.org/exp/94114",
 "substance": "DMT Cannabis",
 "bodyweight": "240 lb",
 "header": [
  [
   "DOSE:",
   " ",
   "smoked",
   "DMT",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "2009",
   "94114",
   "Male",
   "",
   "23",
   "Jun 17, 2013",
   "1570",
   " "
  ]
 ],
 "report": "<p>'I: Beyond the Clouds'</p><p>The first time I was lucky enough to encounter her, I will never forget where I went, the most lucid and vivid reality I have ever perceived in my whole existence so far. I can't remember what the onset was like, I only remember taking 5 hits and barely being able to move the bowl to my face for the last pull. Once I did though, everything disappeared. I was listening to some music and sitting with my girlfriend and I remember not being able to hear the musicor see my girlfriend sitting right next to me, just a steady hum, like how pure energy might sound. This is when I realized things were about to really become interesting.</p><p>I was moving, flying through a very real sky-like world, pastel clouds of the most peculiar colors dominated 360 degrees of my visual field. I was very familiar with McKenna's writings at the time and knew that number one, I could go much deeper, and number two, if I really tried, I could manipulate this dimension with sounds and actions. I wanted to go deeper and see what was really in there, I felt like I was being observed, and I wanted to see who was doing the observing. I started to blow air through my lips; I still don't know if I actually did this or just did this in the trip. With every spurt of air I let out, the pastel clouds would part a little farther apart. I feared where I might end up but I knew it would be safe once I got there and the fear was just my ego trying to hold on to what little body was still on earth.</p><p>I found myself in a domed structure made of the strangest building materials I have ever seen! Burnt orange diamond-like gems shaped like cones set base to base, shimmering with edges of rainbow hues. The walls from floor to ceiling were made of these, all rotating in synchronism. I could hear words and looked up to see two large entities, approximately 800 or maybe 1000 feet in height; it was impressive to say the least. Their skin and bodies were made of the same gem material of the dome we were in. They had the look of a stereotypical alien: large head, very large eyes, lanky body, etc. I could hear them talking even though their mouths never moved. They said, What are you doing here, he should not be here, he is not supposed to see this yet.  I remember thinking that I was cheating, dying without death, the beauty and total knowing were almost overwhelming. I remember looking out around me and the walls were very far away and very large; they seemed to be thousands and thousands of feet from me. But it was most peculiar because unlike seeing with my eyes, this was clear. I remember trying to describe it later and explaining it like this: if there was 12 point font written on the wall even as far I could see, it would have been no trouble to read it. A godly place, a place that only has two means of entry, DMT or death. Oh I loved it though, I wanted to have my wedding there, I wanted to live there. Coming down was confusing and integration took many days.</p><p>- - - - - - - - - - - - - - - - - - - - - - - - - - - - -</p><p>'II: Village of Light'</p><p>The second time DMT took hold, I was partly expecting to be scolded for disobeying the spirits or whatever they were, and surely thought I would have to deal with them. But that was not the case at all. This time I learned the true nature of DMT. When I first started messing with DMT, I just thought it would be like one of the many other psychedelics I have tried, another dimension being brought to this one. But DMT brings you to the dimension when you do enough. It feels more like I'm picking up on other worlds, like changing the radio stations and tuning in and out of channels. Sometimes it is like being observed, like my first breakthrough, but sometimes it is purely observing strange landscapes and worlds, and this time I got to be the observer.</p><p>I packed a small amount of weed in my small bong, laid 100 or so milligrams on top, another sprinkle of weed and the missile was aimed at my brain and ready to fire. 3 hits later, I was drifting through pure blackness. Off in the distance, a small village was below me maybe a few hundred feet down. I realized that what I was seeing were huts. This was a tribe and these were their living quarters. Walls were made of the void, a pure blackness. The structural supports were hollow clear tubes pumping liquid light through their sheaths.</p><p>As I cleared the village and it slowly disappeared behind me, I noticed very large rubber-band ball-like objects black and grey in color flying right past my face. What would be the rubber-bands on these strange orbs was a tangled mess of tubes. Pumping a bright black shimmering substance through them, I couldn't help but think about arteries pumping blood through the body. I slowly drifted through this arterial asteroid field until coming down and seeing my girlfriend's face, glad to be back from wherever the fuck that was.</p><p>- - - - - - - - - - - - - - - - - - - - - - - - - - - - -</p><p>'III: Psychedelic Tentacles and Alien Languages'</p><p>My third breakthrough, though intense, might have been the most boring, but the comedown was very interesting and thus is worth mentioning. It was as if someone took a very large mop and sopped up an array of neon colors, set the mop on my face and just spun it. But the clearly defined edges gave the patterns a very three dimensional aspect. It seemed like tentacles were wrapping around me on all sides. I was pretty deep in color, indeed a fun place to be. </p><p>After I started coming down, I looked around the empty room and could clearly see large rows of hieroglyphs of a sanskrit-like design. This was clearly information, literally waving back and forth in front of me, going through me. I felt as though I was being uploaded with information, but I didn't know what any of it meant. It was obviously not just patterns or 'visuals;' this was a lot of information, written in a language I have never seen before or after this in my entire life. This really is a good example of the bittersweetness of DMT. After this is over, what am I suppose to make of it? I can theorize all day and night, but nothing will make sense of these worlds, except death itself, and the true reintegration of the soul and this vast network of the nonphysical.</p><p>- - - - - - - - - - - - - - - - - - - - - - - - - - - - -</p><p>'IV: Dog-Bear-God'</p><p>It is hard for me to explain this one. It is by far the most profound breakthrough I ever had and yet it was still grounded, the entities came to us. This was also a shared experience; a friend I had tripped with several times was there and had essentially the exact same experience. Maybe we both tuned into the same channel this time, but honestly, who really knows what the fuck any of this means anyway. By this point, my friend and I had smoked enough DMT to know what to expect and also the best way to maximize the effects. Getting the best out of a DMT trip is not hard: the less stimuli the better. Low or no music, dim or no lights, a comfy couch and a bowl of DMT are all that is required at this point in my life. This the only way I smoke it, by myself and in a quiet place. But these were still my experimental days and I loved having my tripping buddy there just to have one other person to say oh my god to. We had smoked plenty of DMT together and a true shared experience was bound to happen eventually.</p><p>We placed one candle on the far side of the room directly across from us, turned off the lights and the fan, closed the door, took our bowls in hand and plopped down on the couch and lit up that rancid crystal death. I believe we each took roughly three hits before dropping our pipes. The candle was flickering and soon morphed into a large phoenix covering the wall in front of me, flames were curling and snapping off the edges of the beast. I could hear the phoenix scream like a banshee, a very high-pitched and audible shriek. I can never forget the way that sounded. And with that loud scream, the bird flew upwards and disappeared. Everything went silent for what felt like minutes. All of a sudden the candle went out and there was nothing, we were both together in a void, no sound, no light, no color, nothing. </p><p>Then the entity made himself visible, and slowly, he appeared out of the right side of my visual field. He was large, his head and neck were the only visible body parts and they took up roughly two thirds of the room. After the trip, we coined the name Dog-Bear-God for him, but it was a futile attempt to describe what it looked like. Dog-Bear-God had a felt-like texture to his skin and minimal features, very tiny orbs of many colors and a liquid-like texture covered his whole body. His face was inches from mine, and I could see his eyes, very dark and very large, not blinking, just staring. His nose was small and round, and his mouth was very large, half the size of his face, and gaping open, not ever moving or closing. He told us that we had gone very far and that this was too deep, and we would meet again but it was too soon right now. A very similar message to the one I received on my very first breakthrough dose. Also a shared feeling throughout all these experiences was a very strong sense of de-ja-vu. I knew I had been here before and I knew I had met these beings once before. I also was always sure that they wished me no harm as long as I could let go and let them show me what they wanted. </p><p>- - - - - - - - - - - - - - - - - - - - - - - - - - - - -</p><p>'V: Bits and Pieces'</p><p>All of these trips span roughly from 2009 to 2011 and revolve around two batches of DMT. During the times when I had DMT, I had a lot, maybe 3 grams the first time, and at least but maybe more the second time around. I tried to share as much as I could but ended up consuming quite a lot of it on my own. DMT is not addictive by any means, but the actual act of peeling back the layers can be quite refreshing if you are open to it. I will admit when I had it, I had a hard time not using it once a night, but at this point in my life, I now know that DMT deserves much more respect than that and to truly learn from it, it should be a once or twice a month journey at most, but to each his own I guess.</p><p>I thought I should include at least a summary of sorts to explain the 100 or so sessions I had with this great substance, the trips that didnt quite take flight, but were very strong nonetheless. These lower-dose trips tend to be a lot more predictable and a lot more grounded as well. Distortions such as powerful and pronounced trailing, rainbow-edging and seeing layers was a pretty constant feature. Most times I could feel a presence and sometimes suspected that entities were actually hiding behind the furniture and things in the room with me, and these thoughts were always a bit unsettling. But, as I should have always known, the entities' intentions were never to harm; it is more on par with a childlike curiosity on their part.</p><p>Sometimes low-dose trips were very intense and might as well have been breakthroughs as far as intensity goes. I remember once having the apartment to myself and wanting a quick trip, packing up the bowl and taking a rip or two and just watching the door violently swaying around left and right, the top corners of the door almost touching the ground. The door was dancing around off the wall, like a piece of furniture from 'Beauty and the Beast' would. I then shifted my gaze to the large red and orange sun tapestry I have hung up over the wall and could see the many dots surrounding its edge lighting up in sequence. It was like one of those box office billboards at the theatre. The large face in the center of the sun came forward and was rippling several feet in front of the tapestry. The face began to morph into something similar to the Pringles mustachioed face and I just couldn't contain the laughter, it was hilarious. I remember thinking, Is this really all you got, what else is there? </p><p>As soon as I thought this, the rays surrounding the face of the sun morphed into ram-like horns. The face turned into the typical devil face, very animal-like and very evil looking. I knew right away that this was just a projection of my own fear, and I was the only reason that this even existed. I laughed at the notion that there might be some evil guy down below just waiting to torture us for our sins. I knew that yes, there is some sort of connecting force, a creator perhaps, or maybe just the collective consciousness and soul of everyone. But the devil, this is just nonsense and I could see it now, a mere scare tactic to keep the masses from going out and being as crazy as they dreamed of. Right about the time I had this revelation, the sun's face returned to the wall and back to its usual smiley demeanor.</p><p>Out of these many trips I went on, I would say about 10% , or roughly 10 of them, were on the level I would consider breakthrough. And something definitely worth mentioning is that I can only remember half of those breakthroughs. The strong breakthroughs I would always talk about right away as much as possible so I could help myself remember them, and also so other people could help me remember, as it can be very hard to hold onto them. It's fleeting almost like a dream can be after waking. Now I don't mean that over time I forgot these other half of my breakthroughs, I mean I never knew what happened. </p><p>At least a handful of times after taking several hits from my pipe, I would look up and see the clock and 20 minutes had passed by but I couldn't remember anything, but held a feeling like what I imagine happens after a night-terror. I knew something big had happened and it was like my brain deleted it to protect me. I have heard other people describe the same phenomenon and it is amazing to me that our brains, or maybe DMT (who really knows) has a shutoff switch and can just erase it. I have theorized that maybe these experiences were just too immersive and maybe can't be experienced until one is truly separate from his body. DMT is such a bittersweet thing because as amazing and lovely as it is, I feel like it is just a peek into the eventual reintegration into the universe, and is a confusing peek at that. I would never give up these experiences for anything, but I can honestly say I am no better than anyone else because of them, I am just a hell of a lot more confused.</p><p>- - - - - - - - - - - - - - - - - - - - - - - - - - - - -</p><p>'Conclusion'</p><p>It is very easy to read these experiences and feel frightened or nervous about taking the plunge with DMT, but let me assure you the only time that there is fear is before you take that leap. Once you are immersed in it, you will know there is no happier or more wonderful place, at least not on earth anyway. This is beyond a drug, it is beyond psychedelic, like Pink Floyd is beyond music. It is an experience that is so much so fast, it can only really be appreciated by a god. This substance deserves the utmost respect and I would say is a must at least once for any person who really wants to turn his eyes around and see the cogs working inside himself, and the universe for that matter. I wish that everyone interested would research and learn the techniques to extract this readily available molecule and see for themselves what the other side is really like. DMT has been one of the most humbling and wonderful experiences of my life and has hands down had a permanent and positive impact on my life. I would never give those experiences up for anything and hope to have many more in my life and even in death. Take care treading in the DMT-world, and never lose respect for her, or she will really teach you a lesson.</p><p></p>"
}
