{
 "id": 9411,
 "title": "A Deffinate Success",
 "date": {
  "submission": "2009-10-28T07:00:00.000Z",
  "experience": "2006-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "On The Edge",
  "gender": "Male",
  "weight": 77
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "number": "5",
    "unit": "g"
   },
   "administration": "smoked",
   "substance": "Damiana",
   "form": "plant material"
  }
 ],
 "report": [
  "Ok first thing I would like to make clear is I have a passion for drugs. I don't do any of them but I have in the past and I feel like they have made me a better person and expanded my way of thinking a great deal. My most enjoyable past time used to be cannibis, and since I am unable to enjoy it anymore, I have been in search of numerous alternitives. I have tried salvia, and although very powerful and mind bending, I am in no hurry to try it again. So I was looking online one day and came across damiana.",
  "I read just about every report posted on it and decided that I should just go to a local herb supplier and try some for myself. I purchased an ounce of the for only $3.50 so even if it turned out to be nothing it wasn't a big waste of cash. I took it home and loaded a very large bowl into my hooka. It was pretty hard to get it to burn at first but after enough huffing and puffing it sparked up nicely. They first few lung fulls I drew in were harsh and burned slightly but they were definatly not unbarable. The herb itself had a flowery taste and actually tasted pretty good.",
  "After a couple long draws, to my surprise, it almost felt like the come on of some low grade cannibis. My heart beat increased significantly and I did feel a slight head change. My mood improved significantly as well. I proceeded to smoke the rest of the bowl and felt great. I was very relaxed for a couple of hours. Also I want to make note that I got very sexually aroused and I wasn't thinking about sex in any way shape or form. All in all I learned that damiana is a definate success and I will most definatly smoke more. I heard that brewing tea out of it is more effective then smoking it so I think next time I will try that next."
 ],
 "erowid": {
  "id": "56895",
  "citation": " On The Edge. \"A Deffinate Success: experience with Damiana (ID 56895)\". Erowid.org. Oct 28, 2009. erowid.org/exp/56895",
  "substance": "Damiana",
  "views": "20436"
 }
}
