{
 "id": 9413,
 "title": "So Real, It's Unreal",
 "date": {
  "submission": "2001-10-27T07:00:00.000Z",
  "experience": "2001"
 },
 "author": {
  "name": "NinjaFX",
  "gender": "Male",
  "weight": "145 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "37 mg",
   "administration": "oral",
   "substance": "Hydrocodone",
   "form": "(pill / tablet)"
  }
 ],
 "report": [
  "Wanting to try some opium related stuff again, I got some old hydrocodone pills.  I had five and used the Codeine extraction method.  I probably lost some stuff in during the extraction so I probably had around 30 mg.",
  "I drank the concrete tasting hydrocodone water at around 6:30 pm.  At around 7:00 The high all of a sudden hit me.  I had a big goofy smile and I felt like sinking into my couch like jello, not a care in the world.  I had a buzz like that for about an hour.  Then things started happening.",
  "I felt real tired so I started to close my eyes and dift asleep.  I wasn't quite asleep yet but very close to, almost in a trance.  What ever I was thinking about or anything I heard got transformed into a dream.  So I guess I was dreaming while I was awake.  I don't know what happened next was because of the hydrocodone, but it was damn scary, and cool.",
  "I thought that people were coming up the stairs, I swear I heard footsteps, But when I shook my head and opened my eyes to see who was there, nothing.  Fell back and closed my eyes.  Five minutes later I hear my parents having a conversation, I answer them with a big loud, 'whatttt!'  But then I opened my eyes and realized that no one was home.  A couple more things like this kept happening.  I swear that everything I heard was real.  It was so real, that it was unreal.",
  "I guess I finally fell asleep when I was having a dream about drowning or something.  I remember somebody kept saying to get out of the water.  I then suddenly opened my eyes and woke up (this is the real world) and I was trying to mouth out help or something.  I seriously could not move or talk....scariest shit ever.  I tried to move my arms, legs, nothing would move, I tried to shake my head back and forth and talk but all I did was mouth out words.  After the third time trying I shook my head as hard as I could and broke my body from whatever was holding me.  At first I was terrified, but then I caught my breath and looked and thought about it, I thought it was damn cool cause it was so unreal. ",
  "Im just wondering if anyone has had an experience like this opium related or drug related or an experience like this at all."
 ],
 "erowid": {
  "id": "5690",
  "citation": " NinjaFX. \"So Real, It's Unreal: experience with Hydrocodone (ID 5690)\". Erowid.org. Oct 27, 2001. erowid.org/exp/5690",
  "substance": "Hydrocodone",
  "views": "56451"
 }
}
