{
 "title": "At the Table of the Red Tribe",
 "author": "darkgreenthing",
 "citation": " darkgreenthing. \"At the Table of the Red Tribe: experience with DMT (ID 94174)\". Erowid.org. Oct 30, 2012. erowid.org/exp/94174",
 "substance": "DMT",
 "bodyweight": "100 kg",
 "report": "<p>The following was written about six months after the experience from notes written the day after. Previous to this experience I had tried smoking unknown amounts out of various devices and my total experience of it was a hallucination of Escher style lizards: interlocking and marching in a circle on the carpet and a disgusting body high. Since this experience I have been unable to find the courage to try another dose of this size, though a couple of much smaller trips have been relatively pleasant and successful. The day of the experience I had been smoking much good herb at my house with my friend J. I consider myself an experienced psychonaut having tried something from every major group a couple times.</p><p>Loaded approximately 40-50 mg (or so the scale said) of just off-white granular powder into toker style water-pipe.  Began inhalation, immediate intense discomfort, the very basic oily smoke burned my lips and lungs but I began to get off before finishing the first giant hit.  I immediately feel a sense of correctness and an energy began to build in my body until I feel like I would explode.  Simultaneously with the building pressure my visual perception changed; colors grow brighter and each object begins to vibrate independently of all other objects and a tinted film or membrane seemed to be laid over every object so that my field of vision was a patchwork of colors with brightly colored objects vibrating behind them.</p><p>Because of the intensity and abrasiveness of the color and vibration I closed my eyes and was immediately greeted with an object which I believe may be of the standard chrysanthemum pattern.  It looked most like an anemone or a writhing mass of stylized worms or, oddly, pasta (in fact my first thought was something like oooh psychedelic lunch) mostly in neon blue and black but often purple or green interiors. Once my eyes had closed I began to feel a sense of motion pulling me slightly backward, down, and to my left.  This feeling built in intensity for the few seconds that I gazed at the anemone/object until, with very little sense of change the black background of the scene resolved into a totally real and internally consistent scene.  With a visual feel somewhere between a cartoon and a very good animated film.  This was my first experience with what I might describe as a visionary state.</p><p>I was in a round room, the walls were a red and orange pattern that was constantly changing in some subtle hard to pinpoint way but it was not any form of characters or language so often spoken about. I was seated at a square table which was just slightly to my right. In front of me also seated at the table was a being who, as the scene opened was proffering me the anemone/object. He (I mentally referred to the beings as male throughout although they wore no coverings, had no decorations, and all the beings I encountered looked the same to me) was humanoid though bright mahogany colored (the whole scene was in bright warm colors) he had reasonably human hands.  His face however was very strange.  Head roughly the size of and shape of a horses they had one or two roughly human eyes but the bottom of the head was a mass of writhing or melting tentacles. If he had been more human like I would say these tentacles would be his mouth and nose as they began below his eyes and hung to mid chest.</p><p>It was out of this tentacle mouth that the being was...extruding the anemone/object/pasta in a manner that could be described as some combination of  breathing, vomiting, or singing (though there was no sound until the end of the experience) wrapped into one easy action. He was catching this sung/breathed mass in both hands and proffering it to me. Stunned it took me some time to take it into my hands. When I did accept it the being turned away from me without a second thought, I wondered whether this was common for him, strange aliens turning up to receive his blessing, for I had recognized this as some sort of shamanistic/psychedelic ceremony for when I looked around the table there were other beings like the first whom he had now turned his attention to and was repeating the process of blowing/singing objects into existence for each being.</p><p>I was very confused by the fact that none of the beings at any point paid any attention to me.  Imagine sitting down to smoke a bowl with some friends and the being Ive described turns up in line for seconds.  Would you hand it to him and continue your conversation? If so you and the being have more aplomb than me. The more I thought about it though I wondered if I was simply occupying the body of one of the beings, as if our simultaneous psychedelic use had caused us to momentarily trade dimensions and bodies. I was immediately able to recognize the scene as a group of people getting high on psychedelics, and the whole thing had a distinctly tribal flavor.</p><p>As each entity received his object he began to breathe or drink it in in a manner that did not diminish the object but did somehow fill him with its essence. I was too stupefied to do anything with the object but stare at it and the room, the perimeter of which was ringed with more of the beings pressed against the wall clearly waiting their turn at the table. My awed examination of the object continued until I became aware that it was time to come down. This was achieved by means of a vibration I had been unaware of, but which had been present all along, dopplered down into auditory range and in some way I rode this sound back to  my body where I was replaced as gently as a baby inside my body. I opened my eyes to the same intensity of vision I had previously left. I asked my friend J how long it had been and he replied just a few minutes a better time scale than that I cant provide, but subjectively it felt like a few minutes, possibly less time than it has taken to read this piece. As I told J about the experience I had the certain knowledge that if he were to have taken a hit before I spoke about it he would have visited the same scene, but alas he did not and the feeling faded with time.</p>",
 "year": "2010",
 "id": "94174",
 "gender": "Male",
 "age": "23",
 "timestamp": "2012-10-30T07:00:00.000Z",
 "views": "3899",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "45 mg",
   "administration": "smoked",
   "substance": "DMT",
   "form": "(powder / crystals)"
  }
 }
}
