{
 "id": 9419,
 "title": "A Tale Of A Creeping Addiction",
 "date": {
  "submission": "2007-08-05T07:00:00.000Z",
  "experience": "2006-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Cactus",
  "gender": "Male",
  "weight": 75
 },
 "dose": [
  {
   "time": "0",
   "amount": "repeated",
   "substance": "Hydrocodone",
   "form": "pill/tablet"
  },
  {
   "time": "0",
   "amount": "repeated",
   "substance": "Oxycodone",
   "form": "pill/tablet"
  }
 ],
 "report": [
  "I experienced my first opiate high after a serious ATV crash, about 10 years ago. It was no big deal, about 2 weeks worth of 10mg hydrocodone with APAP, then it was gone with no significance. I remember feeling constantly content with my life, and although some areas of my life at work and in relationships could use improvement, I felt as though things could be worked out rather easily.",
  "Flash forward to early 2006. A friend was prescribed a large bottle (60 ct.) of hydrocodone 5/500 with 3 refills. We went on a hydrocodone binge for a week. After that experience, coupled with the fact that my personal life with the recently ex girlfriend was in the shitter, I continued to self medicate since the drug made me feel so much better about myself. How classic.",
  "Several weeks later, I had a bona fide injury to my back after a rather nasty tackle in the back yard, damn football season. Lacking any real medical insurance, I went to the ER and was prescribed some hydrocodone. A prescription for 15 pills lasted about 2 days.",
  "A week later, I hit another ER at a different hospital complaining of back pain, using the same story, although my pain had subsided, I wanted more drugs. This time, I received a prescription for oxycodone.",
  "Oxycodone is, in my opinion, hands down the best painkiller out there. The effects of oxy are sooo much better than hydrocodone, though they are very similar in some ways.",
  "Since then, I've hit 4 different ER hospitals, using a similar story every time. I usually use all the medication in a couple days, then make a plan to get more. Faking pain has become easy for me, I'm very convincing.",
  "Things seem so much better while under the influence of opioids. I wonder if I'll ever stop now."
 ],
 "erowid": {
  "id": "56918",
  "citation": " Cactus. \"A Tale Of A Creeping Addiction: experience with Oxycodone & Hydrocodone (ID 56918)\". Erowid.org. Aug 5, 2007. erowid.org/exp/56918",
  "substance": "Oxycodone & Hydrocodone",
  "views": "45266"
 }
}
