{
 "title": "My perception Started to Chop...",
 "author": "Yellow Crayon",
 "citation": " Yellow Crayon. \"My perception Started to Chop...: experience with Cannabis, Salvia divinorum (10x extract) & Products - Spice and Synthetic Cannabinoids ('Mind Wave') (ID 94356)\". Erowid.org. Feb 10, 2012. erowid.org/exp/94356",
 "substance": "Cannabis, Salvia divinorum (10x extract) & Products - Spice and Synthetic Cannabinoids ('Mind Wave')",
 "bodyweight": "125 lb",
 "header": [
  [
   "DOSE:",
   "3 g",
   "smoked",
   "Cannabis",
   "",
   "",
   " ",
   "smoked",
   "Salvia divinorum",
   "(extract - 10x)",
   "",
   " ",
   "smoked",
   "Products - Spice and Synthetic Cannabinoids",
   ""
  ]
 ],
 "report": "<p>My perception started to chop into my understanding. It was as if little choppy frames of my view were flying in from the corners of my eyes and being placed in the center of my vision.</p><p>I purchased a gram Salvia Dragon 10x off of the internet, and the order came with a free gram of Mind Wave. Mind Wave is what we know as Legal Bud. Basically synthetic marijuana that smells funky. Weve had BAD experiences with legal bud before, and we are very careful what we smoke now. I had a Salvia trip before, and I figured I could handle it again- boy was I wrong.</p><p>After the choppy frames came to my vision I had to stand up. And I felt these enormous waves of knowledge coming over my head. I felt one with the universe. I felt like the Salvia and the Mind</p><p>Wave were like two different activators of each other. And after loading the bong with Salvia and holding my hit in for 12 seconds made me change the way I think. This was after the choppy feeling. And then I was rambling on about being in another dimension.</p><p>All of my friends didn't even seem real, like the story book was playing, but I was still there. It literally felt like my entire existence was pulled out of my pineal gland like a black hole, and packed into a little ball of energy. And I was that existing energy. It was the most divine feeling Ive ever encountered off of any drug.</p><p>The loose clothing I was wearing was acting as a secondary layer of nerve endings. My super loose shirt had to come off because I would look at something and imagine it to be soft. But when I got close to it, my shirt would tell me that it was not soft, that it was uncomfortable.</p><p>The alternate universe was surrounding me, and my friends all seemed like they were just hallucinations. I felt like I was reading a story book about a bunch of kids who took something they shouldnt have fucked with. Their faces, when I looked directly at, seemed like I was looking at a character biography in the story book. And Id be over encumbered by dj-vu when I looked into their eyes.</p><p>This green blanket in the other room seemed like the most majestic thing in the world. I wrapped it around me with half of my clothes off, and it felt like I was being cradled by clouds. Everything felt smooth. All of my skin pores were open and accepting data fed into them by the outside world.</p><p>Salvia does not joke around.</p><p>What you read above was about 1/4th of the things that happened to me tonight.</p><p>Words cannot describe. Its a wild ride.</p><p>[Reported Dose: 'about 3 grams of cannabis and .3 grams of Salvia extract mixed with Mind wave per person.']</p>",
 "year": "2012",
 "id": "94356",
 "gender": "Male",
 "age": "17",
 "timestamp": "2012-02-10T08:00:00.000Z",
 "views": "3112",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "3 g",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": ""
  }
 ]
}
