{
 "title": "2C-I, an Artistic Conquest",
 "author": "Fractal Wizard",
 "citation": " Fractal Wizard. \"2C-I, an Artistic Conquest: experience with 2C-I (ID 94352)\". Erowid.org. Mar 9, 2012. erowid.org/exp/94352",
 "substance": "2C-I",
 "bodyweight": "115 lb",
 "report": "<p>To begin this report, let me say that I did not have very much experience with psychedelic drugs before this experience. I had experimented with salvia a few times, and I had just recently been introduced to 2C-I by a good friend. I had taken 15mg orally the time before, and I really enjoyed the body and head high that exuded as well as the peaceful feeling it gave when doing nearly any activity. I knew that bumping the dosage up by 10mg would be more intense both visually and physically, but I was up for the challenge.</p><p>So my two friends and I took the 2C-I orally at approximately 3:30pm and then watched TV and played videogames until the drug kicked in. 2C-I takes a while to kick in orally, for us it took about 2 hours to really kick in fully. At around 5pm I noticed that the usual 2C-I fractal patterns were starting to kick in when I looked up at my popcorn ceiling. Side note: Popcorn ceilings are amazing while tripping, in my opinion, because the mind has a hard time focusing on all of the textures, so lots of strange patterns can occur. At about 5:30pm I decided to get out my drawing pad and start drawing because the creative feeling of this drug is overwhelming. For the next 7-8 hours I was drawing an incredibly detailed picture in pencil that seemed to be forming out of nowhere. I was literally just watching my pencil move back and forth in amazement as beautiful shapes and patterns were appearing and my hand felt like it was being possessed by some unknown entity. It was as if I was seeing the lines on the page forming before I even made them. My friend Jack experienced the same thing and created a surprisingly impressive piece of art. And this was someone who had no artistic experience whatsoever aside from making doodles on the sides of his paper in class.</p><p>Another side note: Draw a picture while you are tripping!!! The creative potential of some psychedelics is incredible, and if you think you can't create art in this mindset, just try, trust me. To get back to the trip itself, the visuals I experienced were very cool. Objects seemed to have an aura around them, lights would occasionally flicker, and lots of splotches of red and purple hues would often appear in my field of vision. What was quite interesting to me was the fact that visuals would only appear if I focused on something. I would look around and everything would appear normal until I stare at an object and it starts to wave back and forth and morph a little bit. Keep in mind that the body load can be pretty intense at a dose this high; I had a hard time not moving, and there was a bit of teeth grinding. I was also smoking weed throughout the trip to ease some of the tension, but keep in mind that combining drugs will greatly change the experience. There was a constant question popping up in my head asking me, What should I be doing? This same question appeared for both of my friends as well. But I would keep ignoring it, as with many psychedelics, you can get lost in your thoughts and back yourself into a scary mindset.</p><p>My friend Zach went to a very dark place for a couple of hours, and thought that he was, creating his own concept of reality. His concept of social cues was completely gone, and he was taking life lessons from random non-important conversations and things that were being said on TV. Needless to say, he was frying hard there for a little while. My trip lasted for over 10 hours, and I had a hard time trying to get to bed. There was a definite afterglow on this drug, as I woke up the next day at around 7AM feeling completely energized and ready to start the day (I probably only got 4-5 hours of sleep).</p><p>I must  mention once more the incredible artistic potential of this drug. As a Fine Arts major, I have a deep respect for art, and respect for the difficulty of creating an effective composition. This trip single-handedly changed the way that I draw and also made me take my major a lot more seriously from then on. I plan on writing another report soon on 30mg in order to discover the full artistic potential of this chemical.</p>",
 "year": "2011",
 "id": "94352",
 "gender": "Male",
 "age": "20",
 "timestamp": "2012-03-09T08:00:00.000Z",
 "views": "2165",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "25 mg",
   "administration": "oral",
   "substance": "2C-I",
   "form": "(powder / crystals)"
  }
 }
}
