{
 "title": "10 Years After",
 "author": "ifallalot",
 "citation": " ifallalot. \"10 Years After: experience with MDMA (ID 94472)\". Erowid.org. Jan 19, 2012. erowid.org/exp/94472",
 "substance": "MDMA",
 "bodyweight": "190 lb",
 "header": [
  [
   "DOSE:",
   " ",
   "",
   "MDMA"
  ]
 ],
 "report": "<p>I was heavy into the rave scene from 1999 until 2005.  I was a DJ so I still really enjoyed the music sober but of course, MDMA made everything so much better.</p><p>I could go on and on about all of my great times with the drug and scene and I can say I never had a bad trip while on the drug.  A few times I had rough 'days after' but nothing compared to what is happening now.</p><p>All of my favorite music from back then gives me a deep feeling of dread, anxiety and abject sadness.  The songs that were connected to the best times are the worst creators of this, and it doesn't matter whether that musical experience was drug-enhanced or not, it is ANYTHING from that era that does this.</p><p>I'll put on a mix and have fun but by the time I get into that 2nd or 3rd hour of music the depression starts.  This is how the experience usually is but sometimes a single song can create instant depression.  Then I get introspective and stay depressed until I sleep it off.</p><p>My MDMA use was fairly limited compared to what some people have done, I don't think I did over 300 hits in those 6 years and I did use cocaine, marijuana, and alcohol during this time as well.  I haven't done cocaine since 2004, ecstasy since 2005, and I rarely use marijuana anymore, and I will only drink one day a week so these depressive episodes are very curious to me.  I don't know if I am depressed in some other way and the reflection on those wonderful years in the rave scene make me unhappy about today or if it is some long-term effects from MDMA.</p><p>I'm just wondering if someone else has had experiences like this or if me and my wife should get a sitter and roll some night to try and bring happiness back into my life.</p>",
 "year": "2000",
 "id": "94472",
 "gender": "Male",
 "age": "20",
 "timestamp": "2012-01-19T08:00:00.000Z",
 "views": "2672",
 "dose": [
  {
   "time": "DOSE:",
   "amount": " ",
   "administration": "",
   "substance": "MDMA"
  }
 ]
}
