{
 "title": "A Wonderful, Interesting Substance",
 "author": "Schnezz",
 "citation": " Schnezz. \"A Wonderful, Interesting Substance: experience with Metaxalone (Skelaxin) (ID 94533)\". Erowid.org. Jul 10, 2013. erowid.org/exp/94533",
 "substance": "Metaxalone (Skelaxin)",
 "bodyweight": "135 lb",
 "report": "<p>In my early teens I was prescribed a drug commonly known as Skelaxin, or Metaxalone, as a secondary treatment for the chronic anxiety I suffer. It worked fairly well; it did its job to the best of its ability, however due to my tendency to abuse the medications I was prescribed in the absence of marijuana or any of the various other drugs I used, it was only a matter of time before I began to attempt to find a way to abuse it. Over the years I have become experienced in the high caused by this drug, and due to the relative lack of information on the subject, I figured I would share my knowledge. This is purely my own experiences, I am no doctor etc.</p><p>Metaxalone doesn't get me extremely high, the effects are very, very, subtle and I have found that it is most pleasant complementing other recreational drugs, marijuana in particular. When used in isolation, the effects are almost unnoticeable at first, a profound sense of unconscious relaxation, a small discrepancy in motor controls, sleepiness, and a noticing of minute details are all fairly standard, as is a somewhat hazy memory. My preferred method of consuming the drug is to break up a sizable amount of the 800mg pill over a bowl of cannabis sativa and smoking it, but parachuting, insufflation, and popping are all viable options.</p><p>I find that the pill is best used in combination with other depressants, a notable exception being other commonly prescribed muscle relaxants (Carisoprodol, Cyclobenzaprine etc) which has the nasty tendency to produce unpleasant side effects, turning me into a, well, a zombie for an extended period of time. In my experience, combinations of a minor opiate or marijuana produce an ideal experience. I don't drink alcohol while under the influence of this drug.</p><p>I always make sure I have roughly a 12 hour block of time freed up, as I typically  fall asleep after the trip plateaus. I do not advise taking this before you go to work/school as my performance is always drastically reduced. I have never felt anything resembling an overdose, but as with any pharmaceutical, I use caution. A safe dose for me seems to be about 1600mg-2000mg.</p><p>This is a wonderful, interesting substance that opens up a plethora of new experiences for me in standard recreational drugs, or induces a period of euphoric relaxation. It allows me to be sober enough to interact with my peers, while allowing me to enjoy myself on a more personal level.  Be careful, have fun, stay safe.</p>",
 "year": "2010",
 "id": "94533",
 "gender": "Male",
 "age": "16",
 "timestamp": "2013-07-10T07:00:00.000Z",
 "views": "1919",
 "dose": [
  {
   "time": "DOSE:",
   "amount": " ",
   "administration": "",
   "substance": "Pharms - Metaxalone",
   "form": "(pill / tablet)"
  }
 ]
}
