{
 "title": "Pleasant and Relaxing",
 "author": "JadeMonkey",
 "citation": " JadeMonkey. \"Pleasant and Relaxing: experience with Opium (ID 9454)\". Erowid.org. Sep 23, 2001. erowid.org/exp/9454",
 "substance": "Opium",
 "bodyweight": "145 lb",
 "report": "<p>I have had several experiences with opium tea made from dried, ground poppy pods.  One word of caution: the potency of the pods can vary tremendously, so I drink the tea very slowly, and start out with a smaller dose, working my way up as I assess my tolerance. </p><p>The experience is like that of other opiates, although I have only tried synthetics.  Typically I will grind 5-10 dried pods and then steep them in a french press with the juice of one lemon and a tablespoon of fresh, grated ginger (to help kill the appalling taste).  I then let it steep for 15 minutes, during which I stir the tea occasionally.  After straining the tea, I then fill the press again with boiling water, and let it steep a second time.  This I highly recommend as the second batch can be surprisingly potent as well.  As the second batch brews, I slowly sip the tea.  The effects can sometimes be felt within 10 minutes of the first sip.  I first notice the feeling of light-headedness, which begins as a sensation of pleasant tension in my face and thighs.  This then slowly increases as I sip my tea, until most of the muscles in my body are positively singing.  A feeling of mild euphoria and wellbeing also ensues, being most noticeable in the beginning, and slackening off within one to two hours.  I usually feel the effects of the tea for two full days, with the first day being far and away the most intense.  Some side effects include difficulty urinating (which can be very unpleasant), bloodshot eyes, scratchy voice, and difficulty getting to sleep the first night.  The second night's sleep more than makes up for it, however, as by this time you are dead tired and pleasantly relaxed.  Also, I have overdone it a couple of times, which has resulted in nausea and vomiting, which lasted for several hours.  Again, be careful and start out slow!</p>",
 "year": "2001",
 "id": "9454",
 "gender": "Not Specified",
 "timestamp": "2001-09-23T07:00:00.000Z",
 "views": "44247",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": " ",
   "administration": "oral",
   "substance": "Opium",
   "form": "(tea)"
  }
 }
}
