{
 "title": "I Found A New Knowledge",
 "author": "IT",
 "citation": " IT. \"I Found A New Knowledge: experience with 2C-I (ID 94541)\". Erowid.org. Apr 24, 2012. erowid.org/exp/94541",
 "substance": "2C-I",
 "bodyweight": "128 lb",
 "report": "<p>Yesterday was a life changer man. I dropped some 2ci and it was the most amazing expericence I've ever had, hands fucking down. I became completely relaxed and then started to feel EVERYTHING around me. I felt complete at peace with myself and felt that I was one with everything; I WAS everything. Everything was me.</p><p>As the trip progressed, the walls started to breathe, and Jim Morrison turned into a fucking lion and I fell at my knees. Then we sat in a circle during the peak and we created the theory of the universe. The Spiral Theory. Everything is relative to spirals. Spirals are nothing more than an infinite amount of circles stacked on top of each other going on forever and ever with no begining or end. Even galaxys commonly form in spirals, along with other things in nature. The so called 'end' of a spiral in a picture is not the end at all, it is the same as the begining. But then again, since there is no begining there is no body or end. It's all nothing, we are stuck in a moment of time repeating over and over in the same sequence, we are the imagination of ourselves, life is but a dream and death is the rebirth of our own universe.</p><p>Think of the big bang, our universe came from emptiness. Something actually came from nothing. But that's impossible, there has to be a source. But there can't be the simplest form of anything, because matter cannot be destroyed and matter is energy condensed to a slow, subtle vibration. Following this pretense, we must assume that energy cannot be destroyed or broken down into simplest form either. It simply get so small it is incalculable. But in order to be broken down, and object has to be made up of multiple things. So whatever makes up our universe has a source, and that source has a source, and that source of the other source ALSO has a source, and so on ad infinitum ad nauseum. There is no begining, because what makes up our universe has been there forever. The universe has always existed, and without a begining it cannot have an end. We imagine the end through our own perceptions, that would be Death. Everything dies, and then we regress back to that simple form of energy, because chemicals are energy and we are nothing BUT chemicals.</p><p>Even emotions are caused by chemicals in your brain, like a high. Life as we know it is a high, essentially a trip much like the 2ci but manifested in different form. Emotions do not exist, they are nothing but highs , caused by chemical reactions. They are a natural trip. They are delusions. Every human is insane, even me. The textbook definition of insanity is asking the same questions over and over and expecting different results. WE have been asking many questions since time immemorial. Where do we come from? What are we? What is our purpose, if any? Some have said God, or some other Divine being. Then we had science, which somewhat supports the things I am saying along with philosophy, quantum physics, and psychology. We always ask the same questions and we always expect a different answer because we can't prove any of it anyway besides the Laws of Science. We can't even prove the past has happened, though we know it has, because there is really no proof to that at all. Much like we cannot prove Einstein's Theory of Relativity, Hawking's Blackhole Theory, and the Big Bang Theory. That's why they are theories. This is my theory, the Spiral Theory.</p><p>I have gained a knowledge far beyond the understanding of many, I have felt IT. That is the only word I can possibly used to describe IT, IT is everything, we are IT, IT is us, and THAT is THAT. I can't describe it any other way, you'd have to have tripped.</p>",
 "year": "2012",
 "id": "94541",
 "gender": "Female",
 "age": "17",
 "timestamp": "2012-04-24T07:00:00.000Z",
 "views": "1241",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "25 mg",
   "administration": "oral",
   "substance": "2C-I"
  }
 }
}
