{
 "id": 9460,
 "title": "A Great Substitute",
 "date": {
  "submission": "2006-11-30T08:00:00.000Z",
  "experience": "2006-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Minormonger",
  "gender": "Female",
  "weight": 68
 },
 "dose": [
  {
   "time": "DOSE:0:45",
   "amount": {
    "unit": "mg",
    "quantity": "25",
    "grams": 0.025
   },
   "administration": "oral",
   "substance": "Pharmaceuticals"
  },
  {
   "time": "0:45",
   "amount": {
    "unit": "mg",
    "quantity": "500",
    "grams": 0.5
   },
   "administration": "oral",
   "substance": "Propylhexedrine"
  }
 ],
 "report": [
  "Here's my experience, which I liked!",
  "I'm prescribed Adderall immediate release 20 mg twice a day.  Since I can't get a refill until next week, I thought I'd give propylhexedrine a try.  I've heard that it's anywhere from 1/5 to 1/2 the potency of Adderall.  I cut the Benzedrex cotton rod up into tiny bits and swallow with Ginger Ale on an empty stomach.  I'm trying to make sure I take in plenty of fluids during this experience.  I'm also biting small bits off of a 100 mg Atenalol tablet, since propylhexedrine is a vasoconstrictor.  I feel that the atenalol is preventing any of the headaches other have reported.",
  "9:20 am: Took about 20-30 mg of atenalol about 45 minutes prior to ingestion. Swallowing the first Benzedrex cotton.  Stomach burns a little.  I'm thinking this is the menthol.  To avoid the taste I'm not breathing through my nose.  If I were, I'd probably puke. Nose starting to run, probably because the product is a nasal inhaler. ",
  "Later: Guh, thank god I'm done swollowing.  Chewing some gum to hopefully get the taste out of my mouth.  Gum helps.",
  "9:36 am - Starting to feel a small twinge of something perhaps?",
  "10:01 am - Very mild trace/hint of headache, so I bit off about another 10 mg of atenalol to be safe.  Meant to bring a blood pressure monitor to work, but couldn't find it.",
  "10:12 am - Feels a bit like how adderall feels when it starts to take effect",
  "10:48 am - Feel motivated to work, similar to the motivation induced by 40 mg of Adderall but not as intense.",
  "11:37 am - I'm in the mood to get shit done!  I'm a little sweaty and I haven't been moving around alot either.",
  "11:44 am - Feeling those tingly sensations I've read about in other experience reports.",
  "1:20 pm - Ate another Benzedrex cotton and bit off roughly 20 mg of Atenalol. Almost puked this time.  Took with water, drinking slim fast now.",
  "1:58 pm - Just got back from the store for more Ginger Ale.  Gagged in the car, but didn't puke.  Effects of first dose feel like they're gone.  ",
  "2:08 pm - Starting to feel the pick-me-up effects of second cotton.  Feel like typing!",
  "4:30 pm - I've been so engrossed in work that I just realized it 2 1/2 hours passed.  Been chewing my tongue like I do while on Adderall. ",
  "Overall, this is a great substitute for Adderall.  I'd do it again.  I like it much better than any methyphenidate preparation.  I'm always skeptical of claims that something is just like Adderall, but I have to say that propylhexedrine does resemble that feeling.  It doesn't have the jitteriness,  or lightheadedness caused by Ephedrine or StimulantX, and it doesn't have the anxiety caused by methypheniddate (I react to Ritalin with severe anxiety and Adderall with no anxiety)."
 ],
 "erowid": {
  "id": "57124",
  "citation": " Minormonger. \"A Great Substitute: experience with Propylhexedrine & Atenalol (ID 57124)\". Erowid.org. Nov 30, 2006. erowid.org/exp/57124",
  "substance": "Propylhexedrine & Atenalol",
  "views": "26998"
 }
}
