{
 "id": 9470,
 "title": "No Ally of Mine",
 "date": {
  "submission": "2008-11-09T08:00:00.000Z",
  "experience": "2006-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Opiate",
  "gender": "Male",
  "weight": 73
 },
 "dose": [
  {
   "time": "0",
   "amount": "7.0 g",
   "administration": "oral",
   "substance": "Amanitas",
   "form": "dried",
   "specific": "A. muscaria"
  },
  {
   "time": "0",
   "amount": "1 cup",
   "administration": "oral",
   "substance": "Tea",
   "form": "liquid"
  }
 ],
 "report": [
  "I ordered an ounce of dried amanita muscaria caps from an online vendor.  They arrived a few days later with crinkly, red metallic skin and the subtle stink of their origins.  I waited until Friday night to ingest them.  Perhaps 2 hours were spent in preparation of the set and setting.  My girlfriend and I cleaned all of the 'comfortable' rooms, lit many sticks of incense, turned the lights low and set out all the candles we own.  They cast a very pleasant light on our large Tree of Life and Indian Mandala tapestries.  I picked out a set of chill CDs, ranging from Massive attack to Loreena McKennit, to Telefon Tel Aviv.  As a final preparation, I brewed a cup of Ginger Tea to help with the famous 'Amanita nausea.' ",
  "I took one of the larger caps (weighing approximately 7 grams) and cut it into six wedge-shaped pieces to make it easier to eat.  Listening to Loreena McKennit's rendition of Yeats' 'The Stolen Child,' I started at 9:50 pm to consume the amanita pieces one by one.  The texture of the skin was tough and wrinkly, and the taste was rather salty with a slight hint of mushroom funk.  When chewed, the mushroom turns quickly into a paste, and bits of skin-fragment get lodged between the teeth.  Between pieces, hoping to avert the promised nausea, I would drink from the cup of ginger tea and wash it all down with bottled water.  By 10:07 I had eaten the whole cap, minus a small, unchewable bit near the center of the mushroom where the stalk had been severed.",
  "I had not eaten anything since 1:00pm, so I was ravenous when I consumed the amanita.  On top of that, I have a ridiculously fast metabolism, and I usually feel the reactions of chemicals/plants a long time before my friends even when we dose the same quantity at the same time.  By 10:20 I was already feeling some strange effects from the mushrooms.  Subtle waves of nausea began to roll over me, as I listened to the last tracks of the McKennit CD.  I was sitting in half-lotus on the couch in front of some candles, and I found myself following the melody of each song like a yogi following the breath.  I invented a short prayer when the nausea started rolling in:  'God inside the mushroom come, and show me worlds I've only dreamed.'  Apparently the God inside the mushroom did not take kindly to the plan.  At 10:25 I headed for the bathroom and threw up some shiny bits of aminita skin, along with a great deal of worthless ginger tea.",
  "After throwing up, I felt fine for a while.  I talked to my girlfriend and felt a sense of being-at-home in the body.  At 10:33 I felt nauseous again and took refuge near the bathroom sink, waiting for what would come.  By 10:47 it came.  I threw up mushroom shards and ginger tea in an almost projectile heave.  When it had passed, I felt a warmth in my head and hands and a sense of growing weirdness.  I went to the candle-lit bedroom and laid down beside my girlfriend who was worried she was going to have to take me to the hospital.  I told her I felt fine, despite the vomiting.  The nausea subsided, and I began to feel extremely sleepy -- as if I had taken some kind of tranquilizer.  I struggled for over an hour to keep my eyes open, but the mushroom seemed bent on passing me out.  At 11:30 my girlfriend alerted me that more than the standard '90 minutes' had elapsed, and asked if there were any new or interesting effects.  I had nothing to offer, besides the extreme, artificial sleepiness.  At 12:00 I gave in to a heavy sleep.",
  "Between 12:00 and 1:00 am I entered into an obscure and hazy dream state.  I can't recall many particulars, but the dreams did not seem particularly visionary -- mostly just garbled mind-junk.  At 1:00 am, by some sick twist of cosmic circumstance, the police knocked on the door.  My girlfriend answered and the ensuing conversation woke me up for a while.  I thought I was dreaming, but found out in the morning that the police had actually come to our door.  But they were just looking for a suspect they had been chasing through the neighborhood and left when they realized we would be of no use to them.  I heard the conversation between my girlfriend and the cops from a liminal state between waking and sleeping.  I felt like a paralyzed, receptive ear.  Eventually, I drifted back into dream-laden sleep, but -- again -- cannot remember many particulars.  I am certain, however, that the dreams contained nothing particularly mystical or enlightening.",
  "I woke up at 9:30 feeling extremely rested, as if I had slept for a couple days.  There were no lingering symptoms the morning after.  I would not recommend this substance to others unless they are in the market for a vomit-inducing, foul-tasting sleeping pill.  But who knows?  Physiology is a peculiar beast, and others (from the reports I have read) seem to have experienced almost mystical states under the sway of this 'ally.'  But I can testify to nothing but nausea and sleepiness."
 ],
 "erowid": {
  "id": "57157",
  "citation": " Opiate. \"No Ally of Mine: experience with Amanita - A. Muscaria (ID 57157)\". Erowid.org. Nov 9, 2008. erowid.org/exp/57157",
  "substance": "Amanita - A. Muscaria",
  "views": "13481"
 }
}
