{
 "id": 9471,
 "title": "The Unbearable Lightness of Being",
 "date": {
  "submission": "2002-01-21T08:00:00.000Z",
  "experience": "1998-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "sayora",
  "gender": "Female",
  "weight": 68
 },
 "dose": [
  {
   "time": "0",
   "amount": "2.5 caps",
   "administration": "oral",
   "substance": "Mushrooms",
   "form": "(dried)"
  }
 ],
 "report": [
  "My first experience with mushrooms was a very pleasant one and I am blessed to have been able to experience mushrooms with my best friend, Mason. Mason and I met during our freshman year of high school and today, we are 21, we still partake in our summer ritual.",
  "We're from the midwest. While we've taken mushrooms during the cold months, it doesn't compare to the beautiful, warm summer months. Since our first experiences with mushrooms, we usually gather at friends' houses or rent a nice cabin in the woods for the weekend. But our first experience was drastically different.",
  "Mason and I had cut our last class of school on a Friday. We were driving around, trying to find something to do. On a whim, Mason suggested that we stop past the apartment of a friend's. She was older than Mason and I, but she had known him for years and she was the singer in their band.",
  "Luckily, she was there, preparing for her roomates' birthday party. We helped decorate and we stopped past my house to drop of our books and get something to eat. We got back to her apartment around 6 pm. People began to gather in the apartment. When a friend of ours, who I'll call Jim arrived, he immediately asked Mason and I if we wanted to do some shrooms? He recently got back from mushroom hunting with his friend and said that they were extremely good; him and his friend had tried some the day earlier.",
  "Mason and I looked at one another and stalled. Up to then my only experiences with drugs was with alcohol, marijuana and hash. Our parents were really laid back and allowed us to smoke and go to weekend festivals if we'd stayed out of trouble and did well in school; and we were both on the honor roll. But that was the extent of my drug knowledge. To be honest, I was scared, but intrested. And being with Mason put my mind at ease.",
  "We said yes. Jim began talking about how to take them like putting them in tea, or just eating them whole. I like tea, so I decided to do it that way. Mason roughed it and swallowed them whole. I prepared a pot of hot water and put the mushrooms in the tea, but there wasn't any honey or sweetner, so I eventually swallowed them along with Mason. Mason and I hugged one another and went to join the rest of the party.",
  "We sat down on a couch and talked with the guests. I didn't know what to expect. Since I didn't feel anything for the first few minutes I stopped thinking about it. After about 30 minutes though, I began to feel something. I couldn't determine just how I felt, but I didn't feel bad. It was a warm, ticklish feeling that slowly spread throughout my body. Mason and I became more animated, and were laughing about the most obvious of things. Actually, it felt almost similar to being high for the very first time. But, the movement around the apartment got to be too much. People who we didn't know were coming in and out. Loud, aggresive music was playing, and people were laying into a keg. It felt like we were stuck and couldn't breathe. We slowly made our way to the outside balcony, and promptly shut ourselves off from the clamor.",
  "We sat back on the balcony. The sun had set and the beautiful midwest sky began to turn from orange-purple to blue. Blue is my favorite color and the colors of the sky began to change to the different shades of blue. First a light sky blue, then to cerulean, to electric blue...The colors became more and more saturated in tone like I was adjusting the cyan dial on my photo enlarger at home. It felt as if the sky were breathing. I was giddy; that's the only way to describe it. I began fumbling with my plactic bracelet. It was filled with liquid glitter. I must have been ripping at it because all of a sudden the bracelet broke open, and the watery glitter poured onto the balcony deck. The glitter splashed on my hand and felt so cold. Mason was loking at me with amusement. He was like, 'what the fuck did you just do?' I began to run my fingers into the puddle of glitter, which started to look like light reflecting off a pool of water. All of a sudden, Mason bolted, hugged me quickly and told me he'd be right back. He had to leave. He went back into the apartment and walked out the door.",
  "I sat back and continued to enjoy the light show above. By now the stars were out and it was completely cloud-free. AND it was a full moon. I never wear a watch but it must have been sometime around 10 or 11. I don't know how long I was sitting there, but I finally went inside.",
  "I sat on a papasan chair and randomly thought out loud, 'Where's Mason?' Jim said Mason was still outside. Jim and I finally got control of the CD player and popped in some Tranquility Base, Phish, BT, Blind Melon and Grateful Dead (What a combo!)",
  "Somehow, I could feel Mason walking up the stairs back to the apartment. I got up and walked to the door just as he came through and looked directly at me. 'Let's go,' he said. Jim and I made our exit and the three of us got into Jim's car. We began to drive.",
  "Mason and I sat in the back. Mason apologized for leaving, but he said he needed to get up and move. He said he was walking around the field outside of the apartment. He was walking down a path, not quite sure of what he was looking for and he told me, dead serious, that he saw his own reflection looking back at him.",
  "Jim continued driving. We drove out of the city, that I do know. We ended up in some small town I'd never been in. We stopped in a small coffee shop where Jim said he knew the owner. It was halfway crowded. Some crappy music was playing in the background. There was a stage, complete with drums, lights and microphone. Mason asked the owner if he could play up there. She said sure and handed him a guitar. He sat onstage and began to tune the guitar, then he began to play a song he and his band had been practicing for some time. He motioned for me to come on stage. He was like, 'sing, you know the words,' By that time, I was completely oblivious to whatever else was going on. I began to sing, eyes shut. When I opened them and crowd had gathered in front and began to applaud. Jim must have called the people back at the party and told them to come over, because after awhile, half the people from the party were up there, listening. The real singer of their group came up and we sang a song together, then I sat back and played the bongos. We made over $50 in tips that night. The owner wanted me to come back and sing with Mason!",
  "When the crowd from the apartment started to get loud, Mason, Jim and I split yet again. While we were driving back home it felt as if we were in a scene from 'Back to the Future' It was like a complete timewarp. It felt like the car was moving at rapid speed, even though after repeatedly checking the speedometer, we were going the speed limit.",
  "When we got back into town, we were both close to the comedown. But still, the colors to me were ultra vivid. Jim dropped us over at Mason's house. We crawled into his large water bed and floated off to sleep..."
 ],
 "erowid": {
  "id": "5716",
  "citation": " sayora. \"The Unbearable Lightness of Being: experience with Mushrooms (ID 5716)\". Erowid.org. Jan 21, 2002. erowid.org/exp/5716",
  "substance": "Mushrooms",
  "views": "6380"
 }
}
