{
 "title": "Sweet Flag - Wrong Flag",
 "author": "K-nasty",
 "citation": " K-nasty. \"Sweet Flag - Wrong Flag: experience with Calamus (ID 9471)\". Erowid.org. Jul 5, 2005. erowid.org/exp/9471",
 "substance": "Calamus",
 "bodyweight": "215 lb",
 "report": "<p>Well, I do not really like chemicals at all, but I am into natural high, psychotropics. So, I'm a horticulture technician at the zoo I work at, and a buddy of mine, who is a botanist, is into the same shit. He was always telling me about all the plants that grow on the side of the road that could get us high. And I was like well hook it up, so he showed me this plant that grew next to the monkey cage he called sweet flag. I was like, 'Sweet, let's dig it up.' He told me his account of it, how he tripped like he was on P. cubensis, and it was really cool. Well I went home and took about 3-4 large clumps of the root ball. I had no idea what it would do.</p><p>Well for me there were no visuals, only the feeling of being on shrooms, Which was ok. I pulled into an IGA to buy something, but I really don't think I needed to. But while being in the store, I would turn a corner and be startled by a display of cans or something. Obviously, the plant had kicked in. I ended up being to freaked to buy anything or I realized that I was just walking around the IGA like Dr. Thompson being weird, and people were staring at me.</p><p>When I began to drive home, I had trouble operating it. I did make it home, and this is where it gets bad. My girlfriend was there, and supposedly I had invited her earlier. That bothered me that she was just there. I began interrogating her, and sat in the back of the room.  Later when everyone left and it was just her and me, I got paranoid and decided her and her girlfriend were after my stuff. I actually offered to beat her with a golf club if it was ok with her.</p><p>It was a short high and I came down off of it upset. I did not go to work the next day. When I did go back to work, my friend heard about my experience and apologized. Too much of a dose will cause severe paranoia and some sort of slight schizophrenia. For an historical reference, the natives of my state used it for an aphrodisiac, in small doses. Overall I do not recommend this plant. Anyway I'll never do it again. Peace.</p>",
 "year": "2001",
 "id": "9471",
 "gender": "Male",
 "timestamp": "2005-07-05T07:00:00.000Z",
 "views": "15682",
 "dose": [
  {
   "time": "0",
   "amount": "4 ",
   "administration": "oral",
   "substance": "Calamus",
   "form": "(roots)"
  }
 ]
}
