{
 "title": "LSD and DMT and SEX! Oh My...",
 "author": "d. m. thraam",
 "citation": " d. m. thraam. \"LSD and DMT and SEX! Oh My...: experience with LSD & 5-MeO-DMT (ID 9473)\". Erowid.org. Sep 17, 2001. erowid.org/exp/9473",
 "substance": "LSD & 5-MeO-DMT",
 "bodyweight": "125 lb",
 "header": [
  "DOSE: T+ 0:00",
  "3 hits",
  "oral",
  "LSD",
  "(blotter / tab)",
  " T+ 3:00",
  "1 hit",
  "smoked",
  "5-MeO-DMT",
  "(powder / crystals)"
 ],
 "report": "<p>Sex on LSDMT</p><p></p><p>date of occurrence: 31 October 1986</p><p>time of occurrence: approx 11:30 pm pacific standard non-time</p><p>my age at the time was twenty one and a third</p><p></p><p>the momenternity  that  never started &</p><p>never really ended - although my relationship with the partner who granted it to me did.</p><p></p><p>that all does not matter now, the mundanities-inanities-insanities that diverged our two paths.  i found a better path & a better someone to walk it with. and that soul and i are deeply meshed, and we have taken some fine trips.  but i digress...we must speak of a fascinating combination of 3 three letter words...</p><p></p><p>in 1986, acid and psychedelia in general were my life's central joy. it was halloween of 1986, and i was about to do something i had not ever heard about anyone experiencing, and to this day, i have still not ever heard of anyone having done this besides myself.  i was going to engage in an act of sexual intercourse while on acid and at the peak moment i was going to take a very large lungful of DMT. </p><p></p><p>when night fell everything looked to be in order. i was globulating on my usual lysergica for three-or-so hours prior at the house in Oakland belonging to my ex-boyfriend, J. and a close female friend K. who had also been involved in some sex things with me and a few other people for a short while lived there as well.  we all frequently took acid and mushrooms together as we were psychedelically compatible.</p><p></p><p>things were working well...i was sitting with K for about an hour beforehand and mostly what we did was laughing and hallucinating silly pee-wee's playhouse-type things.</p><p></p><p>so it was decided that  the evening would go on as planned.....</p><p></p><p>as the time grew close to visit the nth level...i got so keyed up and excited that i thought the adrenaline was going to cause my innards to be tickled so much i would not be able to ingest the dimethyltryptamine properly.</p><p></p><p>it takes skill to smoke DMT right.  you really have to breathe at just the right rate and hold the stuff in.as long as possible. part of you really instinctively wants to not do this because of the chemical-lab taste of the stuff.  i think part of it is also that it is such an almost-exact analogue of your neurotransmission fluid that your real neurotransmitters get jealous. :-)</p><p></p><p>i remember earlier that day, i had been reading 'the bachman books' by stephen king under a pseudonym he once used...the story called 'the long walk' was in my head...a terribly chilling tale, that...it gave me a tincture of death-fear, but i shrugged this off as being entirely appropriate considering it was the eve of all saint's day...the day of the dead. </p><p></p><p>i had the image in my mind, relating to the story, an image of being the finalist in a great contest after which everyone else had already passed away to their next-worlds...and i was about to pass onto mine.</p><p></p><p>J. and i got into bed & turned all the lights off...except for the blacklite...and a  single black candle. the music we put on the stereo was throbbing gristle, the album called  _third & final report_  i was a dedicated industrial music officionado...a daughter of chaos, a grim little apocalypse/epoch-collapse girl. everything was very solemn, our happiness wore the blackmask of flat affect. some  understand this sort of thing,some don't....i have had people wonder how in hell i could even consider taking acid and tripping to such chaos-inducing harsh noise as throbbing gristle.  i just shrugged at them and smiled.  it was just something i did.  something i would do again...many times.  i still do sometimes even now, though as much as it discomfits me at times to know this, in my old age i have mellowed. (shiver)</p><p></p><p>well, we were peaking on the acid and getting really into it. we started to move our slithery limbs glittery-trailingly over each other's bodies. </p><p></p><p>i was aware of the grid-lines of orgone energy we were emanating...they were deep purple, which was good.  when we are unwell or depressed the purple fades to greyed-outedness...when we are alarmed they flare red with that scary-for-real fight/flight stuff.</p><p></p><p>he entered me and we fucked on acid for a few hundred centuries...which is always extremely good for me, in and of itself.</p><p></p><p>i saw images of great power and control which is a common thing for me, a theme that frequently repeats...as i found these things to be very sexy and arousing...and i was really getting off on my hallucinations of  machines and missiles and phallocentric tools of doom.</p><p></p><p>this probably sounds sick and twisted, but you have to keep in mind that it was the mid-eighties, and we lived in a subculture of this time - and that this kind of thing  was very 'hip' in that particular culture matrix. it symbolized a sort of resignation, an  acceptance of what we'd all once believed was impending near-to-come nuclear war death by merging apocalyptic ambience with orgasmicity. </p><p></p><p>i don't get off on pain or seeing people get hurt, or get into using power for coercion, or anything like that. i always did believe real power was persuasion - that leads to true mind control and it can be used for good or evil or just for it's own sake.  i mostly got off on the latter sort of moral alignment: i was, and am - a chaotic neutral, you might say.</p><p></p><p>on the level i was experiencing all this imagery, it was metaphorical in nature.  essentially i was getting off on the concept of power, control, and how it goes up against chaos, and chaos goes up against control.  i now consider these things to be akin to gods: the highest recognizable forces in the multiverse.</p><p></p><p>as the tape reached side two  it was...time for the experiment.  i felt flushed with anticipation. </p><p></p><p>i had done about 5 DMT trips by this time so i was plenty in the know about how to deal with its intensities. my partner also knew what to expect from me after doing it several times himself. i took the glass blown pipe, fitted with VERY thin screens, which he held, while being inside of me in the missionary position. i have always found most favourable position for sex, with me underneath the male, as in this configuration, gravity is doing the most advantageous things for me. :-)</p><p></p><p>i inhaled deeply. i closed my lips and</p><p></p><p>held my breathhhhhhhhhhhhhhhhhhhhhhhhhhh</p><p></p><p>+(((((!!!paintsmell!!!paintsmell!!!paintsmell!!!)))))+</p><p></p><p></p><p>FFFFFFFFLLLLLLLLUUUUUUUUUUUUUOOOOOOOOOOOOOOOO00000000000000000uuuuuuuuuuuuuuuuuuuummmmmmmmmmm -- -- - -.</p><p></p><p>twistwistwistwistwistwist///twistwistwistwistwistwist</p><p></p><p>insideoutsideinsideoutside///insideoutsideinsideoutsidein</p><p></p><p>CYLINDER!</p><p>MASTER CYLINDER</p><p>THE SIZE OF A SPACECRAFT</p><p>NO...</p><p>SIZE OF A MONOLITH...!</p><p>MASTER CYLINDER</p><p>THE GOD'S CYLINDER...</p><p>BECOMING</p><p></p><p>>==== MILES & MILES IN LENGTH ====></p><p></p><p>i do not FEEL it - i AM it i</p><p>AM the penis that fills me i AM</p><p>the void it is filling i AM the SPACE</p><p>BETWEEN two bodies i AM</p><p>black hole eating white light</p><p></p><p>i AM the destroyer of stars</p><p>and the creator of void</p><p></p><p>i am a pinpoint</p><p>filled by a solid</p><p>LIGHTYEARS IN SIZE</p><p>LENGTH///WIDTH///HEIGHT</p><p>TIME///MOTION///FRICTION</p><p></p><p></p><p></p><p>THHHHHHHHRRRRRRRRRAAAAAAMMMMMMMMMMM</p><p>THHHHHHHHRRRRRRRRRAAAAAAMMMMMMMMMMM</p><p>THHHHHHHHRRRRRRRRRAAAAAAMMMMMMMMMMM</p><p>THHHHHHHHRRRRRRRRRAAAAAAMMMMMMMMMMM</p><p></p><p>that sound! i am not hearing it</p><p>i AM it.</p><p>???sound???</p><p>not EVEN as this is</p><p>'ear-unheard-by-brain-sound'</p><p>heard by pre-nerve connecting to ear,</p><p>that hears by funneling sounds into this nerve</p><p>and from this nerve into BLACK HOLE of the brainpan.</p><p></p><p>i am impossible geometry</p><p>being schlanged</p><p>by impossible geometry.</p><p></p><p>i am the hypercube-4D-tesseract</p><p>being fucked by a klein bottle</p><p>inside of a sideways figure eight</p><p></p><p>i am ZERO divided by infinity</p><p>i am INFINITY multiplied by zero</p><p></p><p>then it ended and i was---</p><p></p><p>- ]]] snapped [[[ -</p><p></p><p>suddenly back into regular acid-space -</p><p>which - though this is something i still find hard to believe -</p><p>felt like mundanity (!!!)</p><p>try to imagine what it would take to cause that!</p><p></p><p>and i could hear (with regular ears, now)</p><p>the last song on the album was playing</p><p>and genesis p. orridge was singing:</p><p></p><p>'is that blood...blood on the floor...?</p><p>is that blood...blood on the floor...?</p><p>is that blood...blood on the floor...?'</p><p></p><p>i lay on the floor</p><p>feeling my body and all its fluids</p><p>returning to me - or me to it</p><p></p><p>J. told me that when it started i had dropped totally out of consciousness and it was like fucking a corpse - of course he knew that wasn't what was going on. but still.  despite it being halloween and despite our proclivities for that 'sicko' noise-music, it sort of didn't seem like he had a very good experience.  this was my experiment though. we thought of trying it with him doing the DMT but it  wouldn't have worked. he'd not be able to sustain an erection.</p><p></p><p>tough luck, boys. this is one for the girls to do.....</p><p>unless you like or don't mind being a backdoor man:</p><p>to put it bluntly, that's the only way it could work. </p><p></p><p>you have to be on the receiving end because you're just not at all inside your body while this is happening. </p><p></p><p>the great experiment of 1986 was a success.</p><p>for years afterward though, i became</p><p>o b s e s s e d    c o m p l e t e l y    </p><p>with this experience.</p><p></p><p>i could write or paint nothing without it as the subject matter.</p><p></p><p>true power is my greatest turn-on -</p><p>there is nothing - NOTHING - more erotic to me</p><p>than the twistyturvy warfucklove between</p><p>CHAOS and CONTROL</p><p></p><p></p><p>i got closer to it than i ever got in my life with the LSD/DMT/SEX thing.  </p><p>like i pointed out, i have never ever heard of anyone else taking this combination and doing this particular thing while doing it.  i  find it strange to be the only one (in my knowledge) who's ever gotten that far, and been that high up/out. </p><p></p><p>some day maybe i would like to do it again, but with my current lover, who i have much better physical and mental rapport with.  that very rapport has caused me to finally let this heavy psychedelic thing become a wonderful memory and not an obsession, though.  i mean, given the chance i would do it again, but he's just so on-turned i don't need the acid to get off with him.  it's like he is a hallucination. </p><p></p><p>five years i have been living and loving with him and sometimes i still wonder how he could be real.  he certainly improved the real world for me.  there's not much in it i find interesting other than him and the internet and digital art.  i never thought that i'd go years without tripping and not care that much and it's all because of him.  maybe the experiment was just an experiment, a story to tell. </p><p></p><p>weird thing, my relationship with j. pretty much began to collapse in 1987.  i don't know if it hasd anything to do with the lsdmt but it put a kind of pall on the memory. maybe i had just gone so far some part of me was under the illusion that there was no where else to go with that individual.  that's a retrospective thought though, i didn't think this at the time. there were other unrelated problems probably more important to the collapse.</p><p></p><p>it was, as i said, all for the better.  J. is still a friend and i will never forget halloween night 1986.</p><p></p><p>-thraam</p>",
 "year": "1986",
 "id": "9473",
 "gender": "Female",
 "age": "Not Given",
 "timestamp": "2001-09-17T07:00:00.000Z",
 "views": "150268",
 "dose": {
  "0": {
   "time": "DOSE: T+ 0:00",
   "amount": "3 hits",
   "administration": "oral",
   "substance": "LSD",
   "form": "(blotter / tab)"
  },
  "1": {
   "time": " T+ 3:00",
   "amount": "1 hit",
   "administration": "smoked",
   "substance": "5-MeO-DMT",
   "form": "(powder / crystals)"
  }
 }
}
