{
 "id": 9474,
 "title": "Surprisingly Close to Perfection",
 "date": {
  "submission": "2006-11-05T08:00:00.000Z",
  "experience": "2006"
 },
 "author": {
  "name": "Indelibleface",
  "gender": "Male",
  "weight": 64
 },
 "dose": [
  {
   "time": "0",
   "amount": "50 mg",
   "administration": "oral",
   "substance": "Piperazines - MeOPP",
   "form": "(capsule)"
  },
  {
   "time": "0:00",
   "amount": "30 mg",
   "administration": "oral",
   "substance": "Piperazines - mCPP",
   "form": "(capsule)"
  },
  {
   "time": "1:00",
   "amount": "30 mg",
   "administration": "oral",
   "substance": "Piperazines - mCPP",
   "form": "(capsule)"
  },
  {
   "time": "1:00",
   "amount": "50 mg",
   "administration": "oral",
   "substance": "Piperazines - MeOPP",
   "form": "(capsule)"
  },
  {
   "time": "5:00",
   "amount": "15 mg",
   "administration": "insufflated",
   "substance": "Piperazines - MeOPP",
   "form": "(powder / crystals)"
  },
  {
   "time": "5:00",
   "amount": "15 mg",
   "administration": "insufflated",
   "substance": "Piperazines - mCPP",
   "form": "(powder / crystals)"
  }
 ],
 "report": [
  "Everyone seems to be polarized at opposite ends of the spectrum on these drugs. Either they love them to the point of sounding like theyre advertising for a legal high online store, or they absolutely loathe them to the point of calling the drugs dirty, poisonous stimulants. I had to try them myself because A.) they're ridiculously cheap compared to MDMA, and B.) I'll try anything once, if there's at least a few documented cases of positive experiences, as long as they're remotely safe and relatively unpoisonous. ,)",
  "I decided to take a capsule of approximately 30mg of mCPP and 50mg of meOPP to start, just to see how my body would react to it. After about an hour I started to feel like I was coming up on a pill of ecstasy. I felt light of foot, and a tad dizzy. After about an hour and a half, I felt a pretty decent euphoria that was not unlike an MDMA high. Not quite there, but if I had taken it blindly in a pill, I might have not known the difference, and have thought it was probably a small amount of MDMA mixed with MDA. I'd even venture to say that mCPP (and meOPP) is actually a better imitation of MDMA than MDA is.",
  "At this point, I was feeling pleasant, but it was in waves, mixed with occasional feelings of lethargy and dysphoria, which I attributed to the smallish dose, so I upped the dose and took another capsule of mCPP/meOPP with the same dosage as before. After an hour, it hit pretty well. It was basically just like MDMA, but no jaw clenching, and my pupils were relatively normal. I didn't even feel nauseous at any point, except mildly during the come-up. I think reports of nausea are a bit overstated.",
  "It's definitely more subtle than MDMA, and like I said before, the euphoria tends to come in waves -- settling down, then building back up again. If a proper dose is reached for me, it will feel surprisingly like MDMA, enhanced tactile sensations and all. I felt very empathetic, but not to the same degree as MDMA. There's even a mild visual component, which basically is a lot like MDA in magnitude (significant tracers and color enhancement). And, the weirdest effect of all -- for me, there was no loss of appetite. I couldn't eat too much, but I did eat.",
  "After about four or five hours, I decided to give insufflation a try. I went ahead and made a small dot of about 20 or 30mgs of mCPP/meOPP, and railed it up. These drugs burn with fire of a thousand fucking suns. After a minute of pain, it actually kicked in pretty fast and increased the effects, mostly the visual component. I had already been coming down, so this didn't do much in the way of euphoria. My body felt pretty good, but my brain was slightly over stimulated, and I couldn't focus on anything. I felt a bit overwhelmed. Even at this point, there was no appreciable effect on blood pressure or body temperature.",
  "I felt weird enough at this point to go and call it a day, and went and laid in bed for a bit. I felt better once I was curled up in the covers. I felt floored at this point, and the blankets (plus the Tempurpedic mattress) felt so good. The comedown from these drugs is relatively painless, and I was able to get to sleep pretty quickly. I don't feel depressed afterwards. I just feel tired and worn out. Even today as I type this, the following evening, I'm experiencing absolutely no depression whatsoever. I have a headache, but I never once felt the 'woe is me!' that everyone gets the day after MDMA.",
  "This stuff is surprisingly good. It's a fantastic alternative, for me, to MDMA that is milder on the body while still retaining a good deal of the 'rolling experience'. It's not a drug where I can keep taking more and more at the end of the trip to feel effects -- like MDMA, I'll just feel more side effects the longer I keep taking the drug in one contiguous session of usage. Furthermore, I think mCPP and meOPP are less friendly for prolonging the experience this way than MDMA is. I end up feeling plain weird if I take too much."
 ],
 "erowid": {
  "id": "57182",
  "citation": " Indelibleface. \"Surprisingly Close to Perfection: experience with Piperazines - mCPP & MeOPP (ID 57182)\". Erowid.org. Nov 5, 2006. erowid.org/exp/57182",
  "substance": "Piperazines - mCPP & MeOPP",
  "views": "21823"
 }
}
