{
 "title": "Artistic but not Introspective",
 "author": "Fractal Wizard",
 "citation": " Fractal Wizard. \"Artistic but not Introspective: experience with 2C-T-2 & Cannabis (ID 94759)\". Erowid.org. Feb 7, 2012. erowid.org/exp/94759",
 "substance": "2C-T-2 & Cannabis",
 "bodyweight": "118 lb",
 "header": [
  [
   "DOSE:",
   "25 mg",
   "oral",
   "2C-T-2",
   "(powder / crystals)",
   "",
   " repeated",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "report": "<p>Having experienced 2C-I and 2C-C, when my friend told me that I could pick up some 2C-T-2 from him, I was pretty excited. I drove over to his place and he weighed me out a 25mg dose of some beautiful white crystals. We hung out for a bit, and I went back to my place and took the pill at around 3:00 PM. I had read online that this compound has a tendency to cause nausea for a lot of people, so I brought a pan up to my room just in case. I normally don't purge on psychedelics, and luckily I didn't feel very nauseous at all, but the come up of any psychedelic is usually a little bit bothersome. At around 4:30 PM I was starting to feel some effects; minor visual distortions, objects looking like they are breathing, etc.</p><p>At around 4:35 I decided to smoke some cannabis just to make sure that I wouldn't get nauseous because I was feeling a weird sensation in my stomach. I was listening to a playlist consisting of Justice, Tool, Porcupine Tree, Led Zeppelin, Nero, and a lot of psychedelic trance. All of which was amazing music to trip to, especially Tool's 10,000 Days. At around the 5:30 mark I was fully peaking; I looked at my carpet and started busting up laughing because of the swimming fractals I was seeing. I also have a popcorn ceiling, which is amazing for psychedelic visuals, which is why my friends and I always choose to trip at my place. Looking up at the ceiling I was seeing amazing, snakelike patterns twisting and turning. The coolest thing was the smoke fractals that were created after exhaling cannabis smoke.</p><p>The smoke seemed to create multiple layers in my vision, all of which looked like two skeleton creatures coming forward to kiss each other. When I started peaking I got out my sketchbook to draw my usual trip picture. I was amazed at the crazy ideas I was coming up with. One interesting thing about this chemical was the feeling of a presence watching me. It was as if there was some sort of entity watching me, and I felt a cold sensation on my skin that continually freaked me out a little bit. Surprisingly though, this chemical was very clear headed.</p><p>I could hold up a conversation with my roommate just fine, even though the experience was going back and forth from a ++ to a +++ on Shulgin's scale. I came down by about 12PM, and had drawn a pretty amazing picture and was working on another one before I got a massive headache. I went to pour myself a cup of tea and pet my cat to try to make my headache go away but it didn't help too much. I had a hard time getting to bed, but when I finally did, I got a good night's sleep. I didn't feel much of an afterglow the next day, but luckily I wasn't too groggy.</p>",
 "year": "2012",
 "id": "94759",
 "gender": "Male",
 "age": "20",
 "timestamp": "2012-02-07T08:00:00.000Z",
 "views": "4365",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "25 mg",
   "administration": "oral",
   "substance": "2C-T-2",
   "form": "(powder / crystals)"
  }
 ]
}
