{
 "id": 9476,
 "title": "Will It Not End?",
 "date": {
  "submission": "2000-09-10T07:00:00.000Z",
  "experience": "2000-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Bob Dole",
  "weight": 57
 },
 "dose": [
  {
   "time": "0",
   "amount": "4 oz",
   "administration": "oral",
   "substance": "DXM",
   "form": "(liquid)"
  }
 ],
 "report": [
  "The past several days(weeks?) I had been bored and just feeling dull. I hadn't used anything else for a week or two, and bought a bottle of Robotussin Maximum Strength Cough and Cold even though I knew it was the wrong kind. The only other ingredient it had in it was guafinesin which makes you want to puke.",
  "I started drinking it at about 5:45 and finished almost close to 6 (get powder or do an extraction if you can). I had used DXM three times before with ok results so I didn't expect much. I started my stopwatch when I finished drinking but forgot about it by the time it hit, maybe 30 minutes later. I got a big rush of a body high at first, followed by noticing how bright all the colors were. I just sat there watching tv for a while, by now time had no meaning, before walking around. It almost felt like I was drunk, but only while moving. Kinda like every movement was magnified ALOT. I felt really detached from my body, kinda like in Being John Malkivich. You can't really describe what I felt like as third person, but my body didn't look like or feel like mine. Maybe a half hour later I closed my eyes and noticed some patterns peeling into others. After that I realized that there was a slight cross hatch pattern over my vision. This went on for the rest of night untill I went to bed.",
  "The next morning I woke up and felt REALLY good, it wasn't untill I was really awake and at school that I was still enough to notice the CEV's. These weren't quite as intense but they got more intense for the first couple of hours and then rapidly dispersed. This was kind of disturbing to me because we were taking some important tests. Strangely though, I answered the questions without having to actively think about it. Wandering thoughts were able to come and go without any disturbance and I still just sat there and toiled away. By night I was VERY tired and went to bed early.",
  "Now three days after doseing, I'm back at baseline, but still in a nice after glow. I don't think I learned anything from this experiance except that this might have been the drug used, or something similar, when the Matrix and Being John Malkavich was made. It made me realize that there is more to life than most of us want to agree. Truely this can provide a good couple of days of fun, but it is extremly strange and variable."
 ],
 "erowid": {
  "id": "572",
  "citation": " Bob Dole. \"Will It Not End?: experience with DXM (ID 572)\". Erowid.org. Sep 10, 2000. erowid.org/exp/572",
  "substance": "DXM",
  "views": "6270"
 }
}
