{
 "id": 9480,
 "title": "More Like Speed Than It Has a Right to Be...",
 "date": {
  "submission": "2006-11-30T08:00:00.000Z",
  "experience": "2006-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Zguy7",
  "gender": "Male",
  "weight": 61
 },
 "dose": [
  {
   "time": "0",
   "amount": "125 mg",
   "administration": "oral",
   "substance": "Pharms - Propylhexedrine"
  },
  {
   "time": "1:30",
   "amount": "1 tablet",
   "administration": "oral",
   "substance": "Pharms - Clonazepam"
  },
  {
   "time": "4:15",
   "amount": "125 mg",
   "administration": "oral",
   "substance": "Pharms - Propylhexedrine"
  }
 ],
 "report": [
  "I discovered propylhexedrine in August of 2006 after becoming fed up with the cocaine scene.  I was looking for a new stimulant, and was initially very skeptical, wouldn't you be?  An over-the-counter nasal decongestant that certain people rave about as being almost as good as amphetamines?  Yeah, right!",
  "It's normal for me to miss out the first time on a lot of what a substance has to offer, and it was no different with propylhexedrine.  Here's my first experience report:",
  "T+00 min -- ingested half the cotton inside a Benzedrex inhaler (125mg propylhexedrine).  I'll put it in capsules from now on, as it's very difficult to swallow and tastes horrible.",
  "T+45 min... I was about to eat something, but it sounded disgusting so I put it away. Didn't click as to why at first, but finally did. Stimulating effects are beginning to be felt... mild sweating and increase of energy.",
  "T+50 min... Increased mental clarity noted.",
  "T+65 min... Euphoria (mild to moderate), in waves rather than steady. I took the rest of the cotton.",
  "T+90 min... A few irregular heartbeats noted, so I took a klonopin. Feels like a full fledged stimulant high. Bowels are unpleasantly stimulated tho.",
  "T+100 min... Took an emergency water enema (don't be shocked, I do this weekly to help keep the pipes clear). Bowels feel much better. Mild cotton mouth noted (pun not intended).",
  "T+130 min... As a former cocaine user, I test for pro-sexual effects. Are they like coke? Answer: Desire IS increased (not as much as coke tho), but if coke diminishes performance by 40%, propylhexedrine diminishes it by 90%. Overcoming flaccidity is nearly impossible, but orgasm can be attained with serious determination (nice full-body tingling effects noted during), and the intense ability to focus created by Propyl does allow for success. Don't take this stuff on a night out with a close female friend tho, it's not worth it. Also, plan to do something else other than look at pr0n... SWIM tells me it's great on coke, not so hot on Propyl.",
  "T+137 min... I'm thinking of hitting the store for another one of these, the effects are really on the milder side in my opinion. Not that another would necessarily boost them that much, but it may be worth the effort anyway. If it takes two for a really decent high, it's getting into the expensive territory but still cheaper than cola unless one is getting a very small amount. No more intense euphoria, but full body tingling that's very pleasant... I love it. But I'm an incorrigible druggie who'll pimp my soul for a decent high.",
  "T+4 hrs 15 min... Boosted with another 1/2 piece of cotton. That's all I plan to do for this particular experience. Still feeling that pleasant tingling, and extra enjoyment of just about everything, but the amount of euphoria overall has been disappointing. Even kratom beats it in that department.",
  "This stuff is like speed lite, in a similar manner to kratom being opiates lite.",
  "T+4 hrs 50 min... Repeated full body tingles. This seems to be one of the primary effects of this drug, otherwise in my opinion it gets clobbered easily by just about ANY street stimulant. I've decided I will not be doing this often, it's just not that good. Would possibly be more fun in combination with something else, alone it has trouble standing on its feet.",
  "T+5 Hours... Appetite seems to be returning, just ate something. Aside from the extra 1/2 for a little added fun, I guess that's it. Overall I'm disappointed, as I was expecting something along the line of an amphetamine and Propylhexedrine never quite delivered. The fact it can be bought OTC at the drugstore does boost its case a bit though."
 ],
 "erowid": {
  "id": "57206",
  "citation": " Zguy7. \"More Like Speed Than It Has a Right to Be...: experience with Propylhexedrine (ID 57206)\". Erowid.org. Nov 30, 2006. erowid.org/exp/57206",
  "substance": "Propylhexedrine",
  "views": "35367"
 }
}
