{
 "title": "Smart Drink",
 "author": "JMT",
 "citation": " JMT. \"Smart Drink: experience with Kava, Vitamin C & 5-HTP (ID 9480)\". Erowid.org. Nov 30, 2004. erowid.org/exp/9480",
 "substance": "Kava, Vitamin C & 5-HTP",
 "bodyweight": "160 lb",
 "header": [
  [
   "DOSE:",
   "1000 mg",
   "oral",
   "Kava",
   "(ground / crushed)",
   "",
   "50 mg",
   "oral",
   "Tryptophan - 5-HTP",
   "(ground / crushed)",
   "",
   " ",
   "oral",
   "Vitamin C",
   "(ground / crushed)"
  ]
 ],
 "footer": [
  [
   "2001",
   "9480",
   "Male",
   "",
   "Not Given",
   "Nov 30, 2004",
   "19332",
   " "
  ]
 ],
 "report": "<p>One day I did some thinking and so tried the following recipe, made from Kava capsules, 5-HTP capsules, and a Vit C, all of which were bought at the local grocery store.</p><p>2, 500mg Kava capsules, and 1, 50mg 5-HTP were emptied into a glass.  Then 500mg Vitamin C was ground into powder and added as well.  Then grape juice and 1 capful apple cider vineger was added and the mixture stirred for a minute or two.</p><p>My reasoning was this (and it proved effective)- the water extracts the kavalactones and 5-HTP from the filler, and allows them to absorb into the body much faster than eating would.  The Vit C assists this process and is good for you :-)  Vineger is good for you as well, and I like the taste...  </p><p>Within 10 minutes I felt mildy relaxed and warm - the 5-HTP in particular works much better this way.  There was also a very very very mild wandering or 'loosening' of the mind and I was cast into a more reflective state.</p><p>Also I have found that 5-HTP is essentially tasteless, which is good :-).  Sadly, Kava is not :-(  I hope this may lead others to avoid wasting money on these fancy new Kava drinks that are outrageously priced when one can just mix up some kava and grapejuice(or whatever). Also, it's worth noting that Kava has a peculiar dose-response curve- a pill or two will do the same as 10 or 15 pills and I must consume A LOT to acheive the 'dopey' or 'intoxicating' effects.  At the 1-2 pill level it functions only as a mild relaxant...</p>"
}
