{
 "title": "Fumbling Around in Slippery Hallucinations",
 "author": "Akhenaten",
 "citation": " Akhenaten. \"Fumbling Around in Slippery Hallucinations: experience with Gabapentin & Zolpidem (ID 94837)\". Erowid.org. Oct 2, 2012. erowid.org/exp/94837",
 "substance": "Gabapentin & Zolpidem",
 "bodyweight": "320 lb",
 "report": "<p>I noticed there were no experiences about Gabapentin combined with Zolpidem, so, here goes.</p><p>I've got a ton of Gabapentin and one 10mg ambien. I took the Gabapentin at about 8:50 pm.</p><p>T-10 mins. I looked up Gabapentin experiences online, figured I'd take three 300mg capsules. I think I'll take the Zolpidem at my peak.</p><p>T+0:20 Nothing from the pills. I'm feeling very sore from my workout today, and a bit cranky and irritable from the comedown of the 45mg of dexedrine I took early this morning. I have a lingering body high from it (the dexedrine.)</p><p>T+0:40. Felling a little...weird. Maybe it's starting to kick in, not sure yet. It feels like my mind's eye has ascended to somewhere above my head, an experience I ususally associate with vicodin or oxycontin. I think I'll take another.</p><p>T+0:45 I'm taking another 300mg gabapentin and I'm preparing my ambien for insufflation. I crushed the pill on a plate and scrape it together with a credit card.</p><p>T+0:50 Crushed the zolpidem into a fine powder, divided it into two equal(ish) lines. It's flaky and white, with a little bit of yellow. I'm feeling more of the Gabapentin, my muscles don't ache nearly as bad, and my stress has reduced substantially. But nothing you'd call a high yet. I'm going out for a cigarette.</p><p>T+1:05 I'm still outside, looking at the stars, they're so beautiful... I put on the soundtrack from Les Miserables (still outside, typing this on my kindle.) The atmosphere is fantastic. I feel so relaxed in this ethereal night air. I love stargazing, but I've never captured their beauty as well as I am now. I'm feeling no pain in my sore muscles, and I'm warm. Not only temperature wise, but the warmth you get when surrounded by close friends, it feels like the singers are singing to me specifically. I might take another.</p><p>T+1:15 I take another, I'm a big guy (6'3, 320lbs), so I think I'll be alright. Damn I'm in a good mood. I'm going back outside. I've got a minor headache, probably from sinuses though.</p><p>T+2:10 I feel like I've reached my plateau, I'm feeling great; disconnected with everything (but in a good way.) Feeling no pain, average everyday objects look beautiful, I've got a nice, relaxing body high. My balance is off, and it's getting difficult to type. I think I'm ready for the ambien.</p><p>T+2:15 Ambien was successfully insufflated. HOLY FUCK SHIT OWWWW. Shit burns, really bad at first. It's getting better. This drip leaves almost an oily or plastic taste. Like I drank heavy whipping cream and my mouth is just coated.</p><p>T+2:17 Typing is harder, at this point, I'm glad they put spellcheck on this thing. The shadows on my walls are moving around rhythmically. They seem to like Royksopp.</p><p>I've got a gargoyle on my wall (Christmas present from gf) and he keeps moving, his lamp swings in my peripheral, but when I look at him it stops.</p><p>My door is breathing to the beat of the music, my typing is perfectly synchronizing with the beat. Just remembered to suck really hard through my nose to clear the drip, holy fuck it's nasty.</p><p>Really hard to focus my eyes, and my gargoyle is moving his head, looking around the room. He's a chill guy. My end table is spinning ever slowly, my left thumb is shining.</p><p>There's a darkish fog in my room, its just going over everything. It takes shapes too, I saw a snake in the fog, it morphed into an antelope. Holy shit my gargoyle is floating towards me! I'm not scared of him though. He's trying to talk to me, his mouth is moving and I heard a faint whisper.</p><p>T+2:27ish This feels amazing, everything is responding to the music, I'm playing with the fog, My walls are moving and my windows are bending. But I feel like I'm coming down, or at least plateau.</p><p>Too gone to remember when the last Timeline started, so I'll just use regular time.</p><p>11:30 (T+2:40) I feel fantastic, I'm getting to know my gargoyle very well, and all the pictures in my room told a story, but it's tone was decided by the music. For example:</p><p>I have a coloring book page on my wall that my sister did. It's a sperm whale eating a giant squid. Up tempo makes the whale the hero. If you play melancholy or down tempo, the squid is a victim, and I wanted nothing more than for him to escape. I think a cigarette and the ethereal, arcane atmosphere out under the stars would make this awesome.</p><p>11:36 (T+2:46) I underestimated just how tucked up I am. I got a reality check when I stood up. Holy crap! Can't balance to save my life, bumping into walls and crap. So I'm outside smoking, feels great. The shadow on the wall, caused by smoke. It's beautiful, it's 3d, even though its on a flat surface. Clouds have rolled in, on the especially dark parts, they look like they're looming just over my head.</p><p>Still smoking, ten mins later. I'm still seeing visuals here and there, usually everything is just sliding around. I'm sooooo tired. I want to sleep, but I've always been terrified to go to sleep after I take depressants. I'm afraid I wont wake up, even though I always do, I'm still scared. I'll wait out the high then sleep.</p><p>My neighbor's house keeps growing taller. I'm going inside now.</p><p>12:12 (T+3:22) So most of the body effects of the ambien are gone, but I'm still having minor hallucinations,  Red lines on my computer screen, shadows dancing. I'm so so so so SOOOOOO tired... Must stay up!</p><p>1:10 (T+4:20).   The tiredness isn't so bad anymore, I barely feel any of the ambien, the gabapentin is still going strong, it's wearing off a little bit, my muscles are a little achey, but other than that, the high is still pretty much the same. I spent most of the time between 1:10 and 12:12 pleasantly bumbling about my house; talking to my mom, running into walls, losing my balance randomly. But it was all fun.</p><p>So, gabapentin and ambien seem to work wonderfully with each other. I'm sorry if it's a bit boring or hard to follow, I wrote all of this under the influence.</p><p>Thanks for reading!</p>",
 "year": "2012",
 "id": "94837",
 "gender": "Male",
 "age": "18",
 "timestamp": "2012-10-02T07:00:00.000Z",
 "views": "4741",
 "dose": [
  {
   "time": "0",
   "amount": "900 mg",
   "administration": "oral",
   "substance": "Pharms - Gabapentin",
   "form": "(capsule)"
  },
  {
   "time": " T+ 0:45",
   "amount": "300 mg",
   "administration": "oral",
   "substance": "Pharms - Gabapentin",
   "form": "(capsule)"
  },
  {
   "time": " T+ 1:15",
   "amount": "300 mg",
   "administration": "oral",
   "substance": "Pharms - Gabapentin",
   "form": "(capsule)"
  },
  {
   "time": " T+ 2:15",
   "amount": "10 mg",
   "administration": "insufflated",
   "substance": "Pharms - Zolpidem",
   "form": "(pill / tablet)"
  }
 ]
}
