{
 "title": "Far Exceeded my Expectations",
 "author": "FormerlyNormally",
 "citation": " FormerlyNormally. \"Far Exceeded my Expectations: experience with Kava & Kratom (ID 94846)\". Erowid.org. Mar 10, 2012. erowid.org/exp/94846",
 "substance": "Kava & Kratom",
 "bodyweight": "220 lb",
 "report": "<p>I had been drinking Kava tea for a long time as a mild relaxant to help me get to sleep. When I finally got my hands on some powdered Kava root, however, I didn't realize that a teaspoon of the stuff was about 10x more effective than the tea blend I had been drinking previously. I put the aftforementioned powder into a mesh tea diffuser and let it steep for 15 minutes.</p><p>One note: don't put Kava in water over 140 degrees, as it renders the Kavalactones useless. But back to what I was saying...</p><p>Kava tastes bad. Not the worst thing I've ever tasted, but still not pleasant. It's very bitter and earthy. I've found that sugar and vanilla soy milk work well for covering up the taste. After I finished the lukewarm liquid, I laid down and listened to some music. About ten minutes after I finished the glass, I began to feel very relaxed, with a tinge of euphoria. Music sounded a bit nicer, but no huge differences like what can be noticed with shrooms or cannabis. The overall effects lasted about two hours, with the relaxation peaking into a very mild body load about a half an hour in. All in all, a very nice experience.</p><p>About a week after trying the Kava, I got an ounce of Bali Premium Kratom. I decided to take the tea route. I put a heaping teaspoon of powdered leaf into the diffuser. Much like Kava, it won't be made into a marketable beverage any time soon, but milk and sugar make it bearable.</p><p>When I finished the Kratom tea, I noticed a strong relaxation. Not as euphoric as the Kava, but the overall body effects were stronger. It felt like I had just taken a small dose of Vicodin. I decided to make a cup of Kava tea and see how they mixed.</p><p>Wow. That's about all I can say about it. Once I finished the Kava, I felt like my head weighed about fifty pounds. My thoughts were labored and spacey, almost like a medium dosage of cannabis. I laid on the couch and watched TV for a few hours. I'm not really sure what was on, I was watching more for the noise than anything. I had a perfect feeling of contentment that in my opinion can only be surpassed by mushrooms. But this stuff is legal, so I can compromise.</p><p>All in all, it lasted about three hours. One of the most pleasant drug experiences of my life (marijuana makes me too paranoid, so I'm not a huge fan). I highly recommend it to anyone looking for some cheap, effective herbal relaxation.</p>",
 "year": "2012",
 "id": "94846",
 "age": "18",
 "timestamp": "2012-03-10T08:00:00.000Z",
 "views": "17627",
 "dose": [
  {
   "time": "DOSE:",
   "amount": " ",
   "administration": "oral",
   "substance": "Kava",
   "form": "(tea)"
  },
  {
   "time": "",
   "amount": " ",
   "administration": "oral",
   "substance": "Kratom",
   "form": "(tea)"
  }
 ]
}
