{
 "id": 949,
 "title": "Out of Body Hallucination of Death",
 "date": {
  "submission": "2004-12-31T08:00:00.000Z",
  "experience": "1995-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "scott024",
  "gender": "Male",
  "weight": 61
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "number": "30",
    "unit": "hits"
   },
   "administration": "inhaled",
   "substance": "Inhalants",
   "form": "gas"
  }
 ],
 "report": [
  "[Erowid Warning: Our understanding of the literature is that there is no such thing as safe use of volatile solvents, aerosols and other street inhalants : their psychoactive effects are inseparable from nerve and organ damage.  We have chosen to include these reports to help document the real world use of inhalants, but their inclusion is not intended to imply that they are anything but dangerous.]",
  "Inhalents will kill pretty easily, here's my story, listen up. About six years back me and a friend of mine were hanging around, bored, and we'd heard about huffing freon from a friend. I decided to try it.  This stuff is incredibly addictive. I did it for about three days, about 30-40 times a day. The last time I huffed I nearly died.",
  "I was sitting there huffing, I'd get high, loose comprehension, wake up, and do it again, and so on. Well about 10 minutes into this I passed out but I was still conscious it was weird, I had suddenly was completely sober, and felt none of the effects of the freon. I wasn't in my body or anything, instead I was in this black void, it felt real far away. I dont know if it was an out of body experience or whatever but its nothing I'd ever been through or have since.",
  "Well anyway I'm in this place, feels lightyears away and stuff. I'm looking at these two massive chrome spheres and there passing this signal between each other. I could see the signal it was this type of thing",
  "0  ))))  0 ",
  "The signal would travel to the opposite sphere then it would go back",
  "0   (((( 0",
  "I watched these things do this about three times, then something happened. The signal was interupted by something, it stopped, the spheres lost communication and glazed over with a grayish dead looking mist, they weren't shiny anymore. And I had this overwhelming conviction that somehow I had just really royally messed up on a universally massive scale, I knew I had just watched myself die. I dont know how I knew but it was the most powerful feeling of 'ohhhh god no!' I've ever felt. I was dead.",
  "The very instant this realization hit me, I mean 1 millisecond after I felt all of this, I was rushed back to my body and woke up to just another summer day in texas. Blue sky and everything.  Talk about a second chance on life. So anyway I guess that is what almost dying looks like, and to anyone looking to get a cool high by huffing anything, take it from me, it is not worth it. Its not worth it on a scale that is beyond comprehension. You cant even believe the unworthyness of it. I barely even can.  Hopefully some idiot teenager, like I was, will read this and think twice about huffing stuff."
 ],
 "erowid": {
  "id": "12731",
  "citation": " scott024. \"Out of Body Hallucination of Death: experience with Inhalants (Freon) (ID 12731)\". Erowid.org. Dec 31, 2004. erowid.org/exp/12731",
  "substance": "Inhalants (Freon)",
  "views": "17907"
 }
}
