{
 "title": "Triptronics",
 "author": "Celly Cel",
 "citation": " Celly Cel. \"Triptronics: experience with LSD (ID 949)\". Erowid.org. Nov 14, 2000. erowid.org/exp/949",
 "substance": "LSD",
 "bodyweight": "",
 "report": [
  "<p>It's about time I wrote about acid. For the past two years for me, its been shrooms and MDMA, nothing else. But before that, for four years, I consumed about three to four hundred individual doses of LSD. The funny thing was I didn't do it every day, only on a Friday or a Saturday night. It had to be one of these nights so I could disappear all the next day without missing out on any responsibilities. The first time I dosed I was twelve years old. A little young, but I didn't really understand it anyways, and didn't do it again until freshman year of high school.",
  "Every weekend me and a lot of my friends would take very high doses and do things that took balls. It was like a rite of passage for the mind. We would all sit in a circle and talk about the nastiest, most horrible things that went on inside our heads, and it was a release. Every weekend helped us to deal with the things we had to do each week. After four years of being in that circle of friends, I found that acid had lost its effect on me. I was becoming immune. I relaxed and just smoked good pot for a year, and decided to start again with a very high dose. Me and one friend took about seventeen large blotter hits each and sat in his house for a day and night. This was a tremendous experience, seeing as how I hadn't even really thought about LSD for an entire year, and suddenly here I was, floating in the mental spectrum of reality, trodding along with my pal, saving him from the demons that ran his head, and showing him the way of the dragon.",
  "Most everyone's consciousness resides in the third dimension, some even in the second. Well, this night I pulled my stubborn manic-depressive friend up to the fourth. He was amazed. I told him to imagine what it was like on the fifth, and that would mean you're on your way to the mastery of the soul. I grinned at him and right there he knew that our entire trip was a lesson for him, coming from my more advanced true self. I continued to take LSD for another year, sparsely and only when it served a spiritual purpose. I now regularly see my guardian angels, or simpler guardian spirits, even when I'm completely sober and focused. But all the LSD I've done and all the expansive spiritual voyages within have heightened my already half-open third eye (I am one of the very first indigo children). I hope my personal history with LSD will help others of similar spiritual mind.</p>"
 ],
 "year": "2000",
 "id": "949",
 "views": "9400",
 "dose": [],
 "submissionDate": "2000-11-14T08:00:00.000Z"
}
