{
 "title": "The Incident",
 "author": "PewterG",
 "citation": " PewterG. \"The Incident: experience with Methoxetamine (ID 94971)\". Erowid.org. Mar 1, 2012. erowid.org/exp/94971",
 "substance": "Methoxetamine",
 "bodyweight": "150 lb",
 "report": "<p>So Ill put this in context by saying that I had used ketamine, both snorting and shooting in the muscle, for four years before starting to use methoxetamine (MXE). It had a place in my monthly routine, where I would usually use it at least twice a month and would spend the next week satiated and the week after that, the cravings would start coming back.  This would fluctuate depending on the availability, price, convenience, and purity of the K going around. </p><p>I had a very complicated relationship with ketamine, and when MXE started being available at the street level, I became intrigued by its similarities and differences to ketamine, and started using it more regularly than ketamine exclusively in the muscle.  This was because it was cheaper, more available, and less nauseating.  I also found it easier to use regularly in the beginning of my use.  Although it produced similar body and visual sensations to that of ketamine (difficulty distinguishing minds eye from environment, flowing scenery, feelings of floating/gently falling/surfaces moving under limbs), MXE had more physicality to it.  I was still connected to my body and (somewhat) able to interact with people and my environment efficiently. Despite its downsides (veeeeery longlasting, stimulation caused difficulty sleeping, mild depression, very fast regret to relapse, noticeable paranoia), I found myself using it weekly, and even daily at times.</p><p>A couple days before the incident I had picked up enough of it to keep me satisfied for a couple weeks, and started using it regularly.  It should be said that it hadnt been around for about a month before the incident, so when I started using it I had forgotten what it had felt like.  I had remembered all the negatives, but continued to use it.  I had recently been growing a little impatient of my inner druggy and wanted to escape the cycle, so I had been using less and less as the days went by, and my plan was to faze it out of my day-to-day completely.  I had also been dog sitting for my friend during those days, making using much more difficult because I was seldom at home during the day.</p><p>The morning of the incident, I had used a little before going to school (better than coffee at waking me up) and had to do some volunteer work directly after school.  When I got home it was around 6.  I planned on doing some MXE before going to feed the dog and give it its pill at my friends place, and then going to work starting at midnight and ending at 5 AM (fast food place, dont get me started).  What fell into the cooker was a bit more than 100 mgs eyed out and, instead of putting some back, I snorted about half out of the cooker and proceeded to fix myself the shot.  I took it and left before it hit me. [Erowid Note: Two equal volumes of the same powder do not necessarily weigh the same. For substances active at such a small dose, eyeballing is particularly unwise. See related article]</p><p>The next thing I remember is being put into the back of a cop car, with my hands cuffed behind my back.  I was feeling loopy and disoriented and asked the officer driving where we were going. He told me we were going to the hospital.  I asked him what happened, and he said that I had fallen into a snow bank and bruised up my head and face.  He asked me what I had taken. I said methoxetamine.  He said Meth? I told him no, but I could barely talk because my mouth was so dry and my brain was going so slowly.  I asked him for his badge number and he laughed.  He said I didnt need it.  We pulled in to the closest hospital, which actually wasnt that far from my place, and I black out again after being walked in.</p><p>It should be said that I have a past of dissociating and doing some reaaaaaaaally weird stuff, but to this day I have no idea what happened directly after I left the apartment.  What I recalled directly afterwards got better and better informed when I talked to different nurses about the marks I had gotten out of it over the next couple days, but Ill outline what I felt like during the incident:</p><p>I felt like I was being tortured.  I felt like they had set this up to capture me and neither the nurses nor the police wanted to let me out.  I was being held as a political prisoner and they had no intention to let me out.  Im screaming at the top of my lungs and no one cares.  Theyre choking me.  My cell phone is going off in the corner.  I ask the one nurse who is sitting in the chair next to my bed if I can answer it.  She looks up and says no, but it all started making more sense as of here. </p><p>I was strapped shirt-and pantless to the bed under a blanket and being monitored.  Soon after I came to, they put an IV in my arm and something really tight on my finger which they asked me to keep up.  They let me out soon afterwards, but I have no idea what time it was.  I was in a complete daze, feeling like I had been tortured and unsure of how I felt about the whole situation.  Was it my fault?  I had no idea.  I felt battered, bruised, sore and slow.  My joints hurt and I was not very flexible or fast.  My wrists were cut up and swollen past my thumbs, and parts of my hand were numb. There was a scrape on my forehead, and I had a big ruptured blood vessel in my eye with a matching small black bruise on my temple.  My neck was swollen and it was difficult to swallow or turn.</p><p>It is so difficult for me to remember the rest of that night clearly because my brain tries to blank it out.  I remember crying at home and smoking weed.  I remember finally to go feed and drug the dog.  I get to work half an hour late, and after three hours of painfully trying to work and crying from the emotional trauma, I get my shift covered and go home to sleep.  That night, my back and neck were so rigid that I literally had to roll out of bed.  I couldnt pull myself up or do a sit up because my back and neck wouldnt let me.</p><p>The next day I got my wrists and body checked by the local needle service workers.  They said that from the way my hands look, I was probably cuffed to something and pulling on it.  Immediately when they said that, I got a flash of being handcuffed to the top of the bed and held down, pulling at the handcuffs with all my strength and letting out a primal shriek.  Up until that conversation I had assumed that all the marks I had gotten were done with malice by the police officers.</p><p>I would say that I was feeling out of it, paranoid, depressed, and mentally slow for about 2 days after the incident, but I was physically impaired for at least a week and a half after that experience.  I have not used MXE since the incident, however it is important to note that since I still have a lot of it, Im not under any stress to look for it.  Once I accidentally got some in my mouth when weighing it for someone, but the feelings of paranoia were the only noticeable effect. </p><p>My main advice for anyone who is using MXE regularly is this; try to watch the doses and use with others.  If I had been using with a friend, they might have stopped me from hurting and embarrassing myself.</p>",
 "year": "2012",
 "id": "94971",
 "gender": "Male",
 "age": "21",
 "timestamp": "2012-03-01T08:00:00.000Z",
 "views": "10698",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "50 mg",
   "administration": "oral",
   "substance": "Methoxetamine ",
   "form": "(powder / crystals)"
  },
  {
   "time": "",
   "amount": "50 mg",
   "administration": "IM",
   "substance": "Methoxetamine ",
   "form": "(powder / crystals)"
  }
 ]
}
