{
 "id": 9497,
 "title": "The Music Ran My Pulse",
 "date": {
  "submission": "2010-01-08T08:00:00.000Z",
  "experience": "2006-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Doug649",
  "gender": "Male",
  "weight": 77
 },
 "dose": [
  {
   "time": "0",
   "amount": "15 flowers",
   "administration": "smoked",
   "substance": "Leonotis leonurus",
   "form": "(dried)"
  },
  {
   "time": "0",
   "amount": "3 flowers",
   "administration": "smoked",
   "substance": "Passion Flower",
   "form": "(dried)"
  }
 ],
 "report": [
  "I have read numerous reports about the effects of Wild Dagga (Leonotis leonurus) and its Similarity to Marijuana. I live in Los Angeles, and this Plant grows in Abundance, we even have a white variety that can be seen. Also, I should mention that I work at a large nursery, so this allows me access to plant materials usually not as accessible to most.",
  "I collected the Orange flowers off the Wild Dagga, as well as some available passion fruit flowers from a passion fruit vine (Passiflora edulis) and dried them at 200 degrees Fahrenheit. The Dagga flowers dry very soft, but the passionflowers stiffen up when dried, which makes it difficult to harvest smoke able parts from the flower. This day I had eaten a large meal, and had consumed a small amount of caffeine. The pipe I used may have contained some residual salvia residue, so this may have affected my experience.",
  "My setting was comfortable, in a friendly rocking chair on my back porch, looking at some of my plants and the sky. I packed the bowl tight on the first round, mixing 50/50 passionflower/dagga. It smoked slow but not too hot, allowing me to take long drawn out hits, instead of quick deep ones. The taste is not as friendly as weed or tobacco, but not necessarily bad either. After finishing the bowl, I started to feel as if I had a mild weed high, but different, I couldnt feel the rest of my body unless I really tried too. More over, being outside felt AMAZING. Colors were more pronounced and sounds became more vivid. I could tell this was different than a placebo because it was uncontrollable.",
  "I packed another bowl really dense, and finished it off slowly. After finishing, a feeling ran up my legs throughout my body and I started to feel very inebriated, I was almost unable to walk without stumbling or tripping. The feeling of colors and sound became more pronounced, and a warm feeling covered my body. I moved to my room, which I dont recommend because the smoke can stink up a room, and laid down. I smoked the final bowl but didnt pack it as tight, this was a mistake because the smoke gets very hot and can burned my throat. I wasted a lot of the plant material because it burns quickly, and is impossible to inhale completely. This third hit took me the furthest, as I was in bed I was watching How Its Made, and I could hear its theme music as if I was involved in making it. I felt like every beat of the song, was in coordination with the pulse in my veins. I also noticed that I felt like I was unable to move from the bed, even if I wanted, sort of like strong weed.",
  "These effects lasted for about 20 minutes and residual drunk feeling lasted for about an hour. Later that night, around 7 p.m., I felt EXTREMELY tired even after drinking a large monster energy drink. That may have been the only negative side effect, as well as the after taste of the smoke.",
  "All in All in think it was well worth it. Its not as strong as Marijuana or Salvia or LSD or anything like that but it definitely affects me. I wouldnt do this at a party, or with others, because it felt like it was better being alone than with others. I bet this mixed with salvia, or weed would be nice. I am also going to try smoking this with mugwort before I fall asleep to see if it produces some trippy dreams."
 ],
 "erowid": {
  "id": "57281",
  "citation": " Doug649. \"The Music Ran My Pulse: experience with Leonotis leonurus (Wild Dagga) & Passion Flower (ID 57281)\". Erowid.org. Jan 8, 2010. erowid.org/exp/57281",
  "substance": "Leonotis leonurus (Wild Dagga) & Passion Flower",
  "views": "16802"
 }
}
