{
 "id": 9499,
 "title": "I Met My Aborted Son",
 "date": {
  "submission": "2011-06-16T07:00:00.000Z",
  "experience": "2006"
 },
 "author": {
  "name": "Special K",
  "gender": "Female",
  "weight": 118
 },
 "dose": [
  {
   "time": "0",
   "amount": "1 g",
   "administration": "oral",
   "substance": "Ketamine"
  }
 ],
 "report": [
  "I slipped into the K-hole..",
  "I saw myself as a child playing on the playground of my elementary school, I saw my days of gymnastics class, tap, ballet jazz, and toe.. I watched myself as I started running toward the vault.. I told my teacher it was too high.. that was the day I smashed my face into it, broke my nose and quit gymnastics.. Too bad I was pretty good at it.. I remembered the awesome feelings of flying through the air on uneven bars, the nervousness of trying to stay on a 4' beam in times of pressure.. and the rush from each tumbling pass on the floor..",
  "I saw myself as a pre-teen playing basketball, volleyball, tennis, softball, soccer, and bowling.. I saw my old teammates, I talked to them.. I caught up with them.. I saw myself on the stage during academic track performing an interpretive reading. I saw my old friends, we all looked so young.. I saw band class where I learned to play the clarinet.. I watched myself smoke my first cigarette with the neighbor kids in the woods, the first time we got our hands on some wine coolers in 7th grade..",
  "I saw myself as a teenager just trying to get through the day.. The feeling of being outcasted came back as if I was still there. I saw myself in classes, my old teachers, and peers. I watched as I went to my first party and smoke weed for the first time.. I watched as I lost my virginity at the age of 14.. I saw myself with ex boyfriends, relived the pain of breaking up.. I relived my parents divorce, my mom screaming that my dad had done something terrible.. how I locked myself in the bathroom for hours, half in shock.",
  "And then the worst of it.. I met my son.. the son I aborted at the age of 18.. He said he understood, and that he forgives me.. he was beautiful.. The perfect child.. and at that moment I just began to cry.. how could I do such a horrible and selfish thing.. I saw myself laying on that table, I screamed and tried to stop myself.. not go through with it.. I wanted my baby.. But I watched as that doctor ripped my son from my womb, I saw myself scream in pain, it was the worst moment of my life and I was being forced to relive it.. I turned back to the beautiful child standing next to me, and he started bleeding everywhere.. his arms were ripped off, his legs.. it was the most gory thing I have ever witnessed.. he looked at me and said 'goodbye mommy' and then the doctor grabbed him by the head, and twisted until it popped off..",
  "This was definately an eye-opening experience.. It was scary and extremely depressing.. but I do not regret it.. I have been locking away grief and it found a way out.. It may be some time before I do this drug again.. but I will.. I am glad it happened.. it gave me a reason to look at it, and now I can start to deal with it.. and hopefully finally heal.."
 ],
 "erowid": {
  "id": "57287",
  "citation": " Special K. \"I Met My Aborted Son: experience with Ketamine (ID 57287)\". Erowid.org. Jun 16, 2011. erowid.org/exp/57287",
  "substance": "Ketamine",
  "views": "3488"
 }
}
