{
 "title": "Amazing Substance",
 "author": "ResearchingChemicals",
 "citation": " ResearchingChemicals. \"Amazing Substance: experience with 25I-NBOMe (ID 95008)\". Erowid.org. Mar 1, 2012. erowid.org/exp/95008",
 "substance": "25I-NBOMe",
 "bodyweight": "70 kg",
 "report": "<p>First I decided to take to blotters to test it out and I had read earlier that 2-3mg is a really strong dose.</p><p>T+00.00 I took the 2 blotter and put them between my gums.</p><p>T+00.15 Now some effects are taking place and I feel relaxed and everything looks a bit sharper yet soft in a way, a few visuals but not much at all.</p><p>T+01.00 Now its starting to take effect but still not as strong as I would hope, thinking about re-dosing but then I decide to wait.</p><p>T+06.00 I skip to 6 hours after I take them because there was not much to say about those 2 mg, maybe I have some kind of natural tolerance or it could be the result of cross tolerance with something else I have been taking. I decide to redose, I tip then of the bag of powder (25i-nbome hcl) to the glass table. I make 2 lines (no scale). I read also that it works allot better through the nose. I stick a note in my nose and niff the line, and of course the lines were a bit too close to each other or then I'm just sniffing like Henry the hoover, both lines go up my nose. No pain though, unlike 2C-I and all the other 2Cs.</p><p>A bit of panic as I don't know if I just took way too much or not but I calm my self down and listen to music, which sounds so fucking nice on this drug.</p><p>+01.00 From re-dose</p><p>Wow! visuals are crazy and the music is intense, waves of 3D objects have taken over my living room and everything looks beautiful! This is amazing, on a whole other level than any 2C, bromo, doc, mushrooms, I feel great and no worries in the world!</p><p>If any one is planning on taking this then sniff it, its meant to sniff!</p><p>+2.00 These are really the most amazing visuals I have ever gotten from  psychedelic (DMT not included and I haven't ever tried ayahuasca) even 'cooler' than on high doses of LSD. Music sounds better than on 1200g of LSD!</p><p>Amazing party drug! I don't feel very stimulated even though this is a psychedelic stimulant? But euphoria I feel quite allot and this is a really social drug although on high doses its a bit hard to have a real conversation :D If you know what I mean (and I don't mean I was mumbling and couldn't get my words out)</p><p>Not one bad thing to say about this drug at all!</p><p>Its a real improvement to any 2C because on this I feel so good coming up instead of feeling sick and uncomfortable, and the good feeling stays with me throughout the trip, perfection!</p>",
 "year": "2012",
 "id": "95008",
 "gender": "Male",
 "age": "19",
 "timestamp": "2012-03-01T08:00:00.000Z",
 "views": "7377",
 "dose": [
  {
   "time": "0",
   "amount": "2 hits",
   "administration": "oral",
   "substance": "2C-I-NBOMe",
   "form": "(blotter / tab)"
  },
  {
   "time": " T+ 6:00",
   "amount": "2 lines",
   "administration": "insufflated",
   "substance": "2C-I-NBOMe",
   "form": "(powder / crystals)"
  }
 ]
}
