{
 "title": "Freebased Heaven",
 "author": "25i-freak",
 "citation": " 25i-freak. \"Freebased Heaven: experience with 25I-NBOMe (ID 95033)\". Erowid.org. Mar 7, 2012. erowid.org/exp/95033",
 "substance": "25I-NBOMe",
 "bodyweight": "205 lb",
 "report": "<p>Let me tell you about the two experiences Ive had with this amazing chemical.  First off, I have a dropper bottle that I prepared that has approximately 250mcg 25i-NBOMe per drop of liquid (Everclear).  I know that a drop isn't an exact measurement, but I think it's fairly consistant.  I added food coloring to the everclear before I mixed in the powder (and yes, I took into account the volume of the powder when figuring out how much everclear was needed for the solution) so that I could see where it was when I let it dry out since my plan was to freebase it. </p><p>00:00 My first experience with it I dripped one drop on foil, let the alcohol evaporate, and applied heat.  The tiniest amount of smoke came up with a very faint taste, not at all unpleasant.  Almost immediately I experience tingles going down my spine.  Im a very experienced tripper, including 3 different summers eating 2C-E everyday for months (I never noticed a tolerance build up with that chem, I could eat the same amount everyday and get just as high).  I'd rolled a joint of spice earlier, so I go out on the porch to smoke it along with my buddy B, who was letting me be the lab rat on this chem.  I started getting a very clean, smooth body high but not much visually yet, so I decide to go smoke another hit.</p><p>00:05 I vape up another 250mcg and am instantly seeing fractals over everything, very strong body high, but still absolutely clear headed.  B decides to go strait for 500mcg and smokes his.  We go back out for another joint and a cigarette. </p><p>00:10 by the time we're done smoking, Im completely losing the ability to tell the visuals apart from the real world.  But if I can ignore the unparalleled visuals and that super clean body high, I could forget I was tripping balls, it was that clear headed.  I absolutely love this chem.</p><p>00:15 - 04:00 The visuals stay very strong, very intricate fractaling, the best closed eyed visuals Ive seen (and Ive done some very large doses of LSD, DMT, and 2C-E), it is all extremely colorful.  The body high feels great, still very strong with no notice of the jitters that can be present on other chems like 2C-E.  </p><p>05:00 The visuals have died down quite a bit, but there is still definately a colorful overlaying of things, and a faint moving of surfaces.  Still a very pleasant body high. </p><p>+10:00 B and I started our trip at 11:30pm and Im still up, but I feel so refreshed.  B went to sleep with no problems, and I could've easily if I wanted but I had no desire to.  I have a nice after glow, although the effects have for the most part worn off.  B reported sex with his girl was excellent.  Sex on 2C-E was to me like most people say it is on Ecstasy, so I was bummed that my girl wasn't able to join us on our initial test run of this simular chem. </p><p>2nd experience</p><p>00:00 I smoke 500mcg off foil all at once this time, and my girlfriend C smokes 250mcg.  Almost instantly very strong fractals and coloring is noticed.  Im suprised by how quickly it hit this time.  This is 4 days after my last trip on this chem, so i'd expected it to be weaker.  B tried it only 2 days later and said it was still very strong. </p><p>00:05 C and myself go outside, I smoke a cigarette while she's grinning like the cheshire cat on alice in wonderland.  She's also a very experienced tripper, but is blown away by the quality of the visuals and body high, also loving the lack of mind trip.  Im ok admitting that I just really enjoy tripping balls for the sake of tripping balls.  I don't meditate on it or do vision quests, I just like to see how far I can get into my imagination and enjoy the visuals with a great body high and a hightening appreciation of music. </p><p>00:10 we go back inside, and decide to watch Alice in Wonderland, the new one with Johny Depp.  It's a great choice and we both really enjoy it. </p><p>02:00 - 06:00 I freebase anouther 250mcg 2 more times with about 2 hours between each redose, and each time hits me very strongly.  C can't spend the night, so she doesn't redose, but still has a very pleasant time.  Sex was fantastic on this chem, although C wasn't interested until the visuals had worn off which is usual for her.  I love to have sex while they're still in full force since the exertion makes them stronger.  She freebased alpha-PVP off and on for the hour we had sex, enjoying the mix of the two differant highs.  I didn't want any as I'd been doing a lot of it and hadn't gotten much sleep the last couple nights. </p><p>08:00 - 10:00 the visuals slowly wear off, and I drive C home, then I go back to the friend's house we'd been chilling at.  I really enjoy this chem, and freebasing is definately the route to go.  the duration is still plenty long and you instantly know how high your going to get, so you can add more if your bold enough, instead of having to wait until its too late to add more without wasting alot of it do to tolerance build up. </p><p>In summery:</p><p>The lack of mind-fuck makes it easier to deal with how incredibly high I  instantly get when I freebase it.  The visuals are amazing and Ive only just scratched the surface.  My next plan is to try 1mg all at once.  The body high is excellent and very smooth, no jitters that Ive notice or anyone Ive shared this with.  It may not give me any insights or spiritual awakenings, but if I we're really being honest, most of us I think are really after exactly what this chem offers.  It seems like it would make a good combo drug, like with acid or something like that, to boost the visuals & body high of that drugs' trip.  Ive combo'd it with 5-meo-mipt (6mg oral, and 4mg freebased with 500mcg 25i-NBOMe) which was very pleasant, although I didn't really notice much that the 5-meo-mipt added to the already fantastic experience of the 25i-nbome.</p>",
 "year": "2012",
 "id": "95033",
 "gender": "Male",
 "age": "27",
 "timestamp": "2012-03-07T08:00:00.000Z",
 "views": "17432",
 "dose": [
  {
   "time": "DOSE:",
   "amount": " repeated",
   "administration": "smoked",
   "substance": "2C-I-NBOMe"
  }
 ]
}
