{
 "id": 9511,
 "title": "Wonderfully Tired",
 "date": {
  "submission": "2010-07-21T07:00:00.000Z",
  "experience": "2006-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Mirtazabbys",
  "gender": "Male",
  "weight": 74
 },
 "dose": [
  {
   "time": "0",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(daily)"
  },
  {
   "time": "0",
   "amount": "30 mg",
   "administration": "oral",
   "substance": "Pharms - Mirtazapine",
   "form": "(daily)"
  }
 ],
 "report": [
  "Seeing as there were no documented reports about these two I thought I would add mine.",
  "Currently being treated for Dysthymia with mirtazapine, and as it is tradition to take it at night to help me off to sleep, I've mixed it with varying amounts of alcohol and cannabis. Alcohol wise I find it fine, but I've taken risks before with other classes of antidepressants and had no worry. On to the cannabis.",
  "All in all it was an experience the same yet different. For someone who struggles to get a good night sleep it was almost incredible. I usually do the following: Get INCREDIBLY stoned, take my medication, within half an hour or more perhaps, I'm so tired that sleep is effortless and wonderful. I find I have the most lucid or vivid dreams following cannabis use. It has been so delayed in fact, that some days after cannabis use I will find dreams are incredibly realistic, at times being unable to tell the difference between the pillow in my mind and the pillow I see when I open my eyes. I do not know if it is, but I would say that this was caused by cannabis use in combination with mirtazapine. This may even happen if I were to take my supplemental sleeping medication zopiclone.",
  "The experience itself was nothing out of the ordinary to me though, it was just getting stoned with a resulting 'comatose' state following nightly medication. it just really does help me sleep."
 ],
 "erowid": {
  "id": "57348",
  "citation": " Mirtazabbys. \"Wonderfully Tired: experience with Cannabis & Mirtazapine (Remeron) (ID 57348)\". Erowid.org. Jul 21, 2010. erowid.org/exp/57348",
  "substance": "Cannabis & Mirtazapine (Remeron)",
  "views": "6939"
 }
}
