{
 "title": "Om Vision Synergy",
 "author": "Mr. Sunday",
 "citation": " Mr. Sunday. \"Om Vision Synergy: experience with Nutmeg & Myrrh (ID 95112)\". Erowid.org. Jan 3, 2013. erowid.org/exp/95112",
 "substance": "Nutmeg & Myrrh",
 "bodyweight": "160 lb",
 "report": [
  "<p>On the night of February 3, I had a wild urge to try something I remembered from the tantras I'd read for an on-line course.",
  "In the Mahanirvana Tantra, Lord Shiva says that when the male and female 'essences' combine, 'their mixture is like the Elixir arising from the combination of nutmeg and myrrh.' To put this in historical context, when a man and a woman have good sex, you get alot of slipping and sliding both emotionally and in terms of body fluids. In traditional arranged marriages, evidently you have to expect a certain amount of dry penetration and cursory boffing.",
  "Well, what does that quote mean, exactly? What effect does nutmeg have with myrrh, and does one enjoy it or not? I thought it must wreak some kind of astonishing havoc to make it into religious writ.",
  "I had purchased a few whole nutmegs in order to find out and I usually have sifted myrrh resin around the house anyway so I didn't need anything else.",
  "On the night of my experiment I'd had probably two beers and two shots of whiskey. It seemed like a good idea at the time: a hasty decision. The result completely blindsided me, exceeding all expectations.",
  "Using Malcolm X's recipe of 'a penny matchbox full of nutmeg stirred into a glass of cold water' I grated mine fresh (having read that the volatile constituents evaporate quickly) and consumed it around midnight.",
  "Thinking back now, it seems to me that I used about a tablespoon and a half of nutmeg. I also fumed about 1/2 teaspoon of myrrh. Having waited two hours without effect, I decided to go to bed and sleep.",
  "At about nine o'clock the following morning, I awoke into a +++ experience which rapidly progressed into a ++++ experience. Peak at about the four hour mark, with a lengthy and lingering comedown hovering around ++ into late evening.",
  "Certain key points from the journey:",
  "Initial impression after awakening as-if possessed by a fierce and aggressive deity: deep, monstrous voice boiling out of me unbidden etc.OEVs and CEVs of a bulging-eyed, white-skinned man in ceremonial armor (Chintamani); also the three-eyed face of Mahakala zooming in and outSeparation from 'the real world' by turning back into the mind; 'the real world' perceived as a far-away and distorted window. I could see it, but not reach it to affect it.This window also emanated and originated a mental fireball or supernovaThis fireball had as its identity the fierce deity mentioned above.Reciting mantra at top volume, with tremendous power and reverberation in the voice. My voice seemed to penetrate the walls and echo off of the skyNew doors/avenues opened up inside familiar mantra, new knowledge disclosed, new perspectives on hidden meaningsSimultaneously with the remove from everyday reality, a contradictory sense of absolute presence in the here-and-nowBecoming the cause of noumena (mental events) instead of merely reacting to themDominion in the shared un/subconscious achieved by participating in the parts of  everyday life I usually can't tolerate acknowledging (Re-reading this now, I don't seem to remember what it means. I think that at the time I had an all-absorbing mental process that kind of mapped out tying up loose ends conceptually)</p>The trip rendered me useless except for introspection and vocal work for nearly ten hours. I did all the tantric/sanskrit mantra I know, repeatedly.",
  "Just after waking up and realizing, you know, 'Oh no no no, I'm tripping tripping tripping' I immediately went and did some prayer work and sang mantra which I'd written myself.",
  "Since I have done this almost daily for years, it grounded me and gave me maneuverability within the experience.",
  "At a certain point I also listened to the Mahakala and Sangwa Dupa Tantras sung by the Gyume Tantric Choir. When I felt too sedentary to sing any more, I sat and watched Larry Carlson clips on-line.",
  "I now have tremendous respect for the myrrh/nutmeg preparation. It displayed much more force and activity than I had expected.",
  "The comedown exceeded my expectations for duration and severity. Think of the mother of all hangovers, lasting for two days, combined with lingering blur, slur and impaired judgment.",
  "The nutmeg experiment also disrupted my daily routines for weeks afterward, which in turn threw off my actions and reactions in public.",
  "Now the line from the Mahanirvana Tantra makes sense: I have a certain value with which to compare it.",
  "I wonder if any sect or cult ever performs rites where they use nutmeg and myrrh as the ceremonial drink and incense.</p>"
 ],
 "year": "2012",
 "id": "95112",
 "gender": "Male",
 "age": "35",
 "views": "2261",
 "dose": [
  {
   "time": "0",
   "amount": "2 shots",
   "administration": "oral",
   "substance": "Alcohol - Hard",
   "form": "(liquid)"
  },
  {
   "time": "0",
   "amount": "2 glasses",
   "administration": "oral",
   "substance": "Alcohol - Beer/Wine",
   "form": "(liquid)"
  },
  {
   "time": "0",
   "amount": "1.5 Tbsp",
   "administration": "oral",
   "substance": "Nutmeg",
   "form": "(fresh)"
  },
  {
   "time": "0",
   "amount": "0.5 Tbsp",
   "administration": "oral",
   "substance": "Myrrh",
   "form": "(tar / resin)"
  }
 ],
 "submissionDate": "2013-01-03T08:00:00.000Z"
}
