{
 "id": 9515,
 "title": "Minorty Report",
 "date": {
  "submission": "2007-01-23T08:00:00.000Z",
  "experience": "2006"
 },
 "author": {
  "name": "Times",
  "gender": "Male",
  "weight": "150 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "2.0 g",
   "administration": "oral",
   "substance": "Syrian Rue",
   "form": "(capsule)"
  },
  {
   "time": " T+ 1:00",
   "amount": "1.0 g",
   "administration": "oral",
   "substance": "Syrian Rue",
   "form": "(capsule)"
  },
  {
   "time": " T+ 2:55",
   "amount": "16 g",
   "administration": "oral",
   "substance": "Ayahuasca",
   "form": "(tea)"
  }
 ],
 "report": [
  "<p>First on a personal note, I have always had difficult time taking myself and for that matter anyone serious, I guess due to low self esteem. Its been hard for me to truly be intimate with others. I have lived most of my life in an analytic mindset. So for this reason I decided to let the brew help me.",
  "I took 3 Grams of Syrian Rue in capsule form that was very finely crushed into a powder. I popped two pills in the first hour and decided to take the last pill an hour later. I thought that would balance the rue evenly. I then consumed 16 grams of M. hostilis boiled in about 6 ounces of water. 5 grams of gelatin was used to nicely clean the brew of all its astringents",
  "T- 8:05pm  - 2 pills Rue.  Feeling Good.",
  "T- 9:05pm  - 1 pill Rue.  Still feeling good, no nausea.",
  "T- 10:00pm - Took 16 grams Mimosa in about 6 ounces of water. Spilled a lil by accident and left about a ounce behind got scared.",
  "T- 10:10pm - Feeling ok, no real effects yet.",
  "T- 10:20pm - Feeling better.",
  "T- 10:30pm - Stomach aching a lil feeling weakly trippy.",
  "T- 10:40pm - I'm tripping senses are off! Audio muffled, slight visual trails in corner of eyes, hands feel cold. I regain my conscious thoughts for brief moments then slip back into the trip. Thoughts are no longer consistent/normal. Feels more like a drug than a spiritual plant.  Kinda pissed at this point I took a drug looking for a deeper meaning to life. Time is moving slowly.",
  "T- 10:52pm - I'm feeling better. I think that its over. I begin to believe I'm coming down from the trip. I lay in my bed I focus on tv for 15-20 min.",
  "Suddenly a wave of vibration hits me I am submerged in this unison inside my body. There was a warmth around my hands. I close my eyes deciding if I should focus on this trip or not, then I realize I have no choice because I'm peaking. I cant do anything else! If I move to disrupt the process I'll just aggravate my body and probably hurt myself trying to walk around. I see tiny geometric cross like patterns joined together in neon floating across my eyes. I also hear birds chirping and other noises.",
  "In the midst of my peak I believe this to be perfectly normal. Again at times I regain conscious thoughts and realize chirps are not real. My brain feels captured and frozen in all this activity esp behind the head.  I was not in another dimension or floating in some cyberspace or outside my body. I knew all along I was lying on my bed in my room.  The only thing that I felt was a Vibration that would funnel this feeling of unison. ",
  "Suddenly the tempo switches and I remember saying in my head hey what going on? Noooo! My heart begins to accelerate at a fast rate. My eyes dilate and I feel my body rumbling slightly. I regain conscious thought and go 'Ooh  s**t.' This drug is going to kill me. What did I do? Whats going on with my heart? Then at that point the same intensity as before was now focused on me!",
  "I felt horrible, the spot light was now on me. This deep resonating vibration exposed and combined every negative aspect of my being. Or it acting as a medium, enabling me to examine myself without my ego or logical mind to interfere. There was an intelligence about this vibration. I know I couldnt have created such geometric shapes out of my own creativity! If so how could I bewilder my own self with an array of energy and vibration? This vibration also created a barrier between me and every thought, word or action I could use to try to rationalize what was happening. It just let me stay suspended in this misery for what seems like forever! In reality it was only minutes.",
  "Even my own thoughts where say Look at all the lies u have told Look at your life. At this point waves of vibration mixed with mental schemas of specific points in my life repeating over and over in my head making a clear and undeniable point that I was a un-evolved person. I remember looking in awe at the intelligence of human beings while staring at the TV when I regained conscious thought clear enough to interpret what I was looking at, watching the will and desires of love the people displayed on the show. At this time it came to me that life was all sequential and the events you choose are based on your own resonance. Simply put, what you see and experience is what you expect to see and experience, based on your own mentality. I was shown how my low evolution shaped all the decisions I made in my life. It was as if this vibration was trying to convince me of how un-evolved I was.",
  "I began to ask why I was created in this non-loving un-evolved state? What was my purpose? I then was given the feeling that I was a program sent to give highly evolved people on this planet the experience of things like compassion, patience, introspection, and sympathy. Things they would naturally feel for me in their interactions with me. Which is exactly what I have been, seeing as most of my life even when I wanted to be respected or seen as somone important I never been able to be seen that way unless someone tried there best to pretend. :",
  "I am relieved to know some of the questions I had. It can be hard to deal with. Yet thinking about how my life has gone so far it makes sense. What is this Higher Vibrating Resonance?  My opinion is that this vibration is of a higher source living in a different frequency than us. I'm almost positive the word program was translated by my own mind. It means Im a reactor to the situations I encounter because of my low state of evolution. For example, think of how lower evolved animals react to the smell of blood. It is like they are programed. Its the same concept. I will try this again in a few months after I make major changes in my life hopefully I'll get a better appraisal. This plant is real so be mindful of why your using it.</p>"
 ],
 "erowid": {
  "id": "57361",
  "citation": " Times. \"Minorty Report: experience with Ayahuasca (M. hostilis & Syrian Rue) (ID 57361)\". Erowid.org. Jan 23, 2007. erowid.org/exp/57361",
  "substance": "Ayahuasca (M. hostilis & Syrian Rue)",
  "views": "9128"
 }
}
