{
 "id": 9526,
 "title": "Religious Experience for an Atheist",
 "date": {
  "submission": "2002-01-22T08:00:00.000Z",
  "experience": "1994-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Aazathoth"
 },
 "dose": [],
 "report": [
  "I injected 14 oz of Psilocybe mushrooms mixed with Ketamine, RQQ,   4-9-N-AA, raw weevil larva and newt kidneys.  I swear I saw the bloody ghost of Jerry Garcia frolicking obscenely with a swarm of dryads in the woods. ",
  "This is the real trip (it's not quite as exciting):",
  "This was my second time tripping on mushrooms, but my first time doing it alone.  I was listening to Paul Simon's 'The Boy in the Bubble' from Graceland.  I heard the line 'Every generation sends a hero up the pop charts' and it seeded the entire trip.  I took my dog to a field near my house and kept thinking about the line.  It occurred to me that it didn't refer to twentieth century popular music, but to the Heroic Tribal Chants that exist in most cultures (Gilgamesh, Odyssey, etc.)  Somehow this led backwards to include dominant forms of life at various times in natural history.  I thought about the DNA-RNA chain which had acted as architect for all forms of life from the dominant simple bacteria to the less-dominant but more complex vertebrates and flowering plants.  We are all a part of one chain - I thought as I viewed hundreds of species of plants, animals and fungi and considered the unseen millions of invisible organisms all around and in me. For the first time in my life I perceived an intelligence inherent in nature.  Not a sentient, egotistical god like in the monotheist religions, but nevertheless an intelligence, which is the closest I ever hope to come to a religious experience.",
  "We now return you to the imaginary but more interesting trip in progress:",
  "I was chased my Nazi Leper Cops until I fell into the River Styx, blissfully forgetting everything. I ended up in a psychiatric ward for 7 months after having my stomach pumped by a satanic Vulcan nurse."
 ],
 "erowid": {
  "id": "5741",
  "citation": " Aazathoth. \"Religious Experience for an Atheist: experience with Mushrooms (ID 5741)\". Erowid.org. Jan 22, 2002. erowid.org/exp/5741",
  "substance": "Mushrooms",
  "views": "13438"
 }
}
