{
 "id": 9529,
 "title": "Wonderfully High",
 "date": {
  "submission": "2002-01-22T08:00:00.000Z",
  "experience": "2001"
 },
 "author": {
  "name": "HazyDaze",
  "gender": "Male",
  "weight": "155 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "5.0 mg",
   "administration": "oral",
   "substance": "Hydrocodone",
   "form": "(pill / tablet)"
  },
  {
   "time": "0",
   "amount": "-1.0 g",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(leaves)"
  }
 ],
 "report": [
  "<p>Recently, I was at my friends appartment with a few other people, one of which deals in pharmeceuticals.  I went there this day with the full expectation of being in a alterred state of consciousness because I have come to associate this place with a plethora of different substances, none of which I have ever experienced without first conducting thorough research.  She had Hydromorphone, Hydrocodone, Diazepam, Adderall, and a few others.  She offered me a 5mg tablet of the Hydrocodone which I readily accepted.  I popped the pill and then sat back and relaxed for a while, waiting for it to take effect.",
  " It was at some point during this that I remembered what my last experience was like with Hydrocodone.  It involved very unpleasant nausea and cramps which I did not care to repeat, even though my dose was smaller this time.  In an attempt ot try and prevent this situation, I began to smoke some high quality Cannabis out of my glass pipe because I read that it is an excellent anti-nauseant.  We smoked many pipes in succession until I was quite stoned, as were a few others in the room.",
  "Not only did I not have any nausea whatsoever, but the two substances had actually complemented each other very nicely.  I had completely forgotten about the hydrocodone I had taken, but now I realized that the wonderful, floaty feeling of the hydrocodone had taken the sometimes annoying body load away from the stoned feeling.  I felt wonderfully high for quite a while, seeming as light as a feather.  As far as the physical sensation, the closest feeliing I can compare it to is a mild Salvia experience without the visual side. ",
  "I am very experienced with cannabis, and I am no beginner with pharmeceuticals, but together, these substances are definitely very enjoyable.  I would be very interested in (cautiously) experimenting further.</p>"
 ],
 "erowid": {
  "id": "5742",
  "citation": " HazyDaze. \"Wonderfully High: experience with Hydrocodone & Cannabis (ID 5742)\". Erowid.org. Jan 22, 2002. erowid.org/exp/5742",
  "substance": "Hydrocodone & Cannabis",
  "views": "44106"
 }
}
