{
 "id": 9530,
 "title": "One Crazy Weed-Trip",
 "date": {
  "submission": "2009-09-06T07:00:00.000Z",
  "experience": "2006-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Sunshine",
  "gender": "Male",
  "weight": 73
 },
 "dose": [
  {
   "time": "0",
   "amount": "1 cig.",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "plant material"
  },
  {
   "time": "0",
   "amount": "1 hit",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "plant material"
  }
 ],
 "report": [
  "This is a recollection of one of my earlier experiences with marijuana. It took place the second semester of my freshman year in college, Im now a sophomore, so I guess it wasnt too long ago. I certainly cant claim to have been smoking for very long yet, but I have certainly become much more experienced. I cant remember with any certainty how many times Id smoked prior to this, it wasnt very many, if I had to guess maybe something like 10 occasions, that being in the high range.",
  "Anyways, I had tripped once before on weed, or at least thats what my journal entry says, but for the life of me I just cant remember it. The point is, I was still a noob, and despite having tripped once before I was still entirely inexperienced with regards to tripping or even the fact that marijuana could make me trip (I suspected that perhaps it was laced, though I now doubt this). Despite my doubts as to the exact details of my life leading up to this experience, I did happen to take down a detailed account of the event itself, written only a day or so after it happened, so thats what Ill share:",
  "It was in my new dorm room, probably about 7:30 pm, and I had just returned from a trip to the botanical gardens behind our gym where I had smoked a nice, fat jay. It was some quality weed, and I got nice and high. Shortly after having returned to my room, my roommates friend, who Ill call C, came into our room and offered to make us a Sobe bong. My roommate was all for it, so I watched as C skillfully turned an empty Sobe bottle into a fully-functional gravity bong (or waterfall bong, whatever).",
  "Me being the noob, my C suggested half-jokingly that I should take the first hit. I agreed, wanting to be higher than I was, and also very curious. My mindset as I agreed to take this hit was a little dubious, since I had tripped before, and was just an unsuspecting noob, and hadnt liked it one bit. But I just told myself to buck-up, mind-over-matter, Im as sober as I think I am, I then took one long exhale, and sucked up all the smoke. I had only just learned this technique, and also to hold it in as long as possible, which I found surprisingly easy as this smoke was incredibly smooth and cool. I exhaled out the window, very pleased.",
  "I sat back down in my chair and watched as the other two took their hits. I dont remember a whole lot, except that I was pretty happy just sitting there, doing nothing. But I didnt get long to enjoy this, as my two companions decided to head down to the convenience store and buy some snacks (of course). So my roomie ran off to use the restroom, and I stood up to get ready to follow them once he got back. It was then that I noticed the first unusual effects. One thing I noticed, everything in the room was flashing. The closest thing I can come up with is like our light was strobing extremely rapidly. The very next thing I noticed, as I stood up out of my chair, I moved my hand past the armrest, and I thought I saw my hand pass straight through the solid wooden armrest! I couldnt believe my eyes! I found that if I passed my hand back and forth next to the armrest, it looked like I was passing my hand through it, and I amused myself in this fashion for a moment until C asked what I was doing. I explained the situation to him, and he seemed mildly amused.",
  "But now my roomie was back, and so we all headed off to the store, about a minute or so journey down the stairs and into an adjacent building. This is when things became more difficult. At this point, the flashing effect I had been feeling had steadily worsened until now it felt like I also had the spins, and I was also seeing double. Basically, I was getting the flanging effect I get from DXM, except that rather than reality just appearing to be coming in frames, each frame was also rotating slightly, so that it seemed like what would happen if I were both very drunk and also on a low-level robo-trip. As we stepped outside of the dorm building, C looked at me and said, See how your arms are all tense? Its cuz youre cold! Despite his observation, I didnt feel cold at all, which I was pretty proud of.",
  "We entered the store, where I saw many of my hallmates and also some other people I recognized but didnt really know. I was surprised that there were so many people still there this late at night, but then I realized that it still wasnt much later than 8pm. My companions went into the store and got some snacks, and I decided I should sit down on one of the couches outside, since by now I was getting an absolutely spectacular body high.",
  "I dont have a very clear memory of anything that happened after this, but I will do my best with what little I remember, and what I had written and also what others later said theyd seen. I apparently had drawn some attention, because a few people there claimed they noticed that I looked a pale green color. One of them mentioned this to my companions, who were chatting with people outside the store. So they came over to ask me if I was ok, and said I was trippin. C reassured me I wasnt and not to freak, and to get up and take a drink from the water-fountain a few feet away. So I very slowly got to my feet, and found that everything below my waist felt like it was submerged in wet cement, making it very difficult to move, almost like wading upstream in a river. With some more encouragement I eventually made it to the water-fountain, and stopped. I looked at the fountain, and the nozzle from which the water would squirt from, and realized there was absolutely no way I was going to be able to intercept air-borne water with mouth, and then swallow it! I had to think with all my might just top even imagine the process, and I certainly couldnt imagine actually successfully accomplishing such a complex task. So they led me back to couches and brought me some water in a cup, which I drank with much difficulty.",
  "At this point they decided it was time to head back to the dorms, so I once again stood up and got ready to go. By now, the visuals had gotten nearly out of hand, as each frame of reality was nearly spiraling through me, such that my peripheral vision was completely whited out. As I stood there waiting to follow my companions back, this effect increased dramatically, until nearly everything was fading to white! Finally, the only remaining vision I had was of my roommate standing right in front of me, everything else was white. Doubts and fear flew through my mind, but I tried not to make a scene.",
  "Suddenly, a terrible thought occurred to me: If everything from my peripherals in had whited out, why could I still see my roomie? Wouldnt it make more sense that he would have been whited out just as well as everything else had? Or if I could still see my roomie right in front of me, why couldnt I see anything else that was right in front of me? The conclusion I came to was that I wasnt actually seeing my roomie, but just imagining him, and that I was really passed out on the floor of the lounge, completely tripping! This theory appeared even more likely as suddenly everything became very quiet. The lounge is a very noisy place, but at that moment all background noise suddenly receded. I could still hear everything, but it was like someone had just stuck ear-plugs in me. This was now the most terrifying experienced Id ever had, and wondered if I was going to die. I still tried to remain calm, but I wondered if people could tell I was this fucked-up, or if they cared.",
  "The rest of my experience I didnt record in my journal, but I do remember being set back on the couch, and brought a garbage can to puke in, which did for quite a while. Eventually I was well enough to make it back to room, where I managed to fall asleep, but reality was still slightly flashing when I awoke the next morning. This was the most extreme reaction Ive even heard of someone ever having to weed alone, although I do know of others who have puked from smoking large amounts. I have since become much more experienced with psychedelics in general, and have tripped on at least two more occasions after smoking weed, although these experiences were infinitely more enjoyable, since I was able to recognize them and appreciate them.",
  "This certainly scared the fuck out of me, and it was made all the more harder when my own friends later insisted there was no way anyone could possibly trip from weed alone."
 ],
 "erowid": {
  "id": "57427",
  "citation": " Sunshine. \"One Crazy Weed-Trip: experience with Cannabis (ID 57427)\". Erowid.org. Sep 6, 2009. erowid.org/exp/57427",
  "substance": "Cannabis",
  "views": "5483"
 }
}
