{
 "title": "Technology and Salvia Go Hand in Hand",
 "author": "TechnoShaman 2024",
 "citation": " TechnoShaman 2024. \"Technology and Salvia Go Hand in Hand: experience with Salvia Divinorum & Light/Sound Machine (ID 9533)\". Erowid.org. Nov 14, 2001. erowid.org/exp/9533",
 "substance": "Salvia Divinorum & Light/Sound Machine",
 "bodyweight": "153 lb",
 "report": "<p>I used a light and sound machine (galaxy Pro model) with Salvia divinorum.  I use the light and sound machine alone anyhow and have great experiences (especially after being on it for 25 minutes or longer set on a visual program around 4-7 hertz frequency) with it.  I decided to play my own Techno CD (I write and perform Trance techno music myself using computer software) in combination with the light and sound machine (I also design my own light and sound machine program session designed specifically for tripping) and loved it.  I wondered how Salvia, Techno, and light and sound technology would go hand in hand.  I loaded a Large packed bowl of Salvia divinorum (Oaxacan type) and turned on my light and sound machine (situated around 4-7 hertz binaural beats) and started playing my own music (using headphones of course) and smoked the bowl with the LED glasses off.  Once I finished the bowl (One lungful held in for 25 second according to my stop watch) I felt the effects coming on rapidly.  I then put on my LED glasses and the Light and sound session started in 10 seconds.  Next thing I know WHAM!  Wow this combination was GREAT!</p><p>I could never describe the visuals or the experience associated with this combination but all I can say is that it was definitely PsychoTronic (instead of Psychedelic I would call it Electdelic or just plain PsychoTronic).  I entered some sort of Electronic Hyperspace loaded with fractals and materializing nanorobotic worlds.  If one thing has helped me understand nanotechnology and genesis of atomic particles it is definitely this combination.  The 'trip' was so realistic and colorful that it blew my mind.  The music was the carrier wave forming particles auditorily while the frequency beeping was the actual particles formed, and the visuals were the particles displayed to the retina as a visual display and the salvia made it look all SO REAL.  My consciousness was consumed by this display.  I became the formations.  Once the Salvia begin to wear off (3-5 minutes) I slowly materialized (mentally that is) back to my 'body of particles' (I think particles are illusions anyway in that it's sensory.  What would they look like if I had no Senses? Hmmmm) that I normally 'am' and realized that this 'world' that we live in appears to be made of Light and Sound (sensory-wise that is) or should we say Light~Sound. </p><p>This experience was great! A great Set and Setting, Trance Techno, Light and sound machines, and Salvia Divinorum are a Great combination.  I'm sure this will be valuable for research in the coming future, believe me.</p>",
 "year": "2001",
 "id": "9533",
 "gender": "Male",
 "timestamp": "2001-11-14T08:00:00.000Z",
 "views": "8915",
 "dose": [
  {
   "time": "0",
   "amount": "1 bowl",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "(dried)"
  }
 ]
}
