{
 "title": "Prolonged Absinthe Use",
 "author": "0nelove",
 "citation": " 0nelove. \"Prolonged Absinthe Use: experience with Absinthe (ID 95361)\". Erowid.org. Mar 22, 2012. erowid.org/exp/95361",
 "substance": "Absinthe",
 "bodyweight": "180 lb",
 "report": "<p>Previous experience of writer for reference: Roughly 150 'trips,' with phenethylamines, tryptamines, many experiences with stimulants, opiates, etc. in the name of self-exploration.</p><p>I was living in Ibiza at the time. I happened into a liquor store and noticed several bottles of absinthe. I had tried absinthe in New Orleans several years earlier (two drinks), and found the experience to be quite nice. Thus, I proceeded to buy a bottle of locally produced absinthe (70% alcohol) for something like 10.</p><p>Generally, I drank it in combination with other alcohols (beer, wine, etc.) as sort of a supplementary 'boost.' During this time period (roughly three weeks) we (my wife and I) would begin smoking (hashish or marijuana) and drinking everyday at around 12pm and go to sleep at around 3am.</p><p>At first (the first few days) the effects were stupendous: These include an extremely lucid drunkness, enhanced visual clarity/intensity, and most of all, a strong rise in energy and mood as well as the at least perception of enhanced creativity. It had an almost mescaline-esque lightness and lucidity, but while drunk. The rise in energy felt quite natural and not jittery or tense. Wifey also noted the same effects.</p><p>After roughly two weeks of drinking absinthe everyday (aprx. 200-300ml a day), I began to notice that my sleep was more and more disturbed. I would enter a sort of half sleep/lucid dream state that was neither good sleep nor waking.  Next I began to experience slight paranoia. This manifested in the feeling of some dark energy continually stalking me. My dreams began to become more and more disturbing until the point where I would continually wake and have no recollection of where I was. I would wake and everything would look surprisingly 'gothic' for lack of a better description. Visual disturbances also began to surface along with the other effects. I would see dark shadows in the corner of my eye, insect like impressions that vanished on second glance, etc. All of these effects continued until at week three I decided I had had enough and poured whatever remained down the drain.</p><p>The effects at first seemed to be so subtle that it was hard to know if it was the absinthe or not. Coupled with the pleasant surge in energy and lucidity, it proved to be something that was continually 'egging you on,' to try it one more time as *perhaps* it was not the absinthe but something else.  It was the absinthe.</p><p>I still think it is great for one or two shots one night, but only one night, then lots of rest before the next use.</p>",
 "year": "2011",
 "id": "95361",
 "gender": "Male",
 "age": "28",
 "timestamp": "2012-03-22T07:00:00.000Z",
 "views": "4361",
 "dose": [
  {
   "time": "DOSE:",
   "amount": " ",
   "administration": "oral",
   "substance": "Absinthe",
   "form": "(liquid)"
  }
 ]
}
