{
 "id": 9540,
 "title": "First Encounters",
 "date": {
  "submission": "2009-08-26T07:00:00.000Z",
  "experience": "2006-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Piffdos",
  "gender": "Male",
  "weight": 68
 },
 "dose": [
  {
   "time": "0",
   "amount": "600 mg",
   "administration": "oral",
   "substance": "Pharms - Gabapentin",
   "form": "(pill / tablet)"
  },
  {
   "time": "2:30",
   "amount": "1200 mg",
   "administration": "oral",
   "substance": "Pharms - Gabapentin",
   "form": "(pill / tablet)"
  }
 ],
 "report": [
  "Initial mindset: I was interested in trying neurontin due to the few side affects I had read about and its availiability to me. I had done some minor research on neurontin and found it to be an excellent candidate for my selection as I find myself being quite scared when it comes to taking any drug whatsoever, after having taken a biopsych class I started developing an interest in personally experiencing a few drugs. I wasn't quite sure what dosage to take and read about some people taking high doses and getting quite sick, so I felt it best to start out small and judge my experience from there. The day I chose to take the drug was a normal day in which I did not have that much planned. I wouldn't say that I was in an altered or depressed state.",
  "Initial setting: The study In my house where I usually hang out, watch movies, and listen to music. Then the local shopping center, then a friends house.",
  "5:00pm I ingested 2 300mg tablets of neurontin with 2 beef burritos and orange juice.. I had read online that when taken with food absorbtion was increased.",
  "6:00 pm I started to feel much better, and I had a strong desire to listen to some good music, I chose Mars Volta for its more psychedelic feel.",
  "6:08pm my mother arrived home and her usually grating conversation with me was not so difficult to bear. It wasn't so much that I didn't find it to be annoying, but I knew it was annoying and didn't care. Soon after she arrived she asked me to go take the garbage in. On my trip back out and in the concreet driveway seemed slightly warped... especially when I was taking the garbage cans back in. I felt my extremeties feel slightly lazy and heavy and the process of taking the garbage back in seemed to take much longer than usual. I certainly enjoyed it more however.",
  "7:30pm Enjoyment seemed to have dropped off significantly and I wasn't experiencing anything really. I decided to take 4 more 300mg pills with a bottle of soda. I finished watching a movie then went to my local shopping center to see if I could find some friendly faces.",
  "8:00pm I arrived at the local starbucks to find a few friends, by this time I was feeling quite friendly, I ran into a few people and I felt quite talkative, I usually am however, I felt slightly more talkative and less worried about the usual social constraints I worry about. Other than my mood the other thing I noticed most of all was my awareness of the change in the brightness of the lights. There was a flickering lightbulb in starbucks and its reflection off of the floor was extremely noticeable to me and fascinating as well.",
  "9:00pm I have started to notice myself being very thirsty. I've already had 3 bottles of water, 2 after the orange juice and one after the soda. I took with the other 4 neurontins. I asked for a cup of water from starbucks and continued to talk to some people who I hardly knew. I felt less worried about what other people would think at this point.",
  "9:45pm I skipped to longs (not sure why) and talked to my friend I had a strong desire to continue to be social.",
  "10:00pm My friend and I went to a friends house and hung out. My extremeties still felt very odd, and I continued to be in an extremely positive mental state.",
  "10:45pm my friends and I went to the shopping center to get some food, I ended up spending time outside while it was very cold I found myself to be shivering only very slightly. Ususally I shake uncontrollably when I am cold. I'm pretty thin @ over 6ft tall and whenever I'm cold I shiver violently. It could be because Neurontin is an anti convulsant that I wasn't experiencing this as severely as usual or perhaps It was because I felt relaxed. perhaps it was a combination of both.",
  "Later on my mom called wanting to know where I was, rather than just letter her know and going on with my usual night and not worrying about what she though I cared more and brought myself home at around midnight. I seemed to care more about how people felt that evening.",
  "Overall I had no problems or complications with the drug and have no qualms with taking it again in the future, It was a very positive experience"
 ],
 "erowid": {
  "id": "57467",
  "citation": " Piffdos. \"First Encounters: experience with Gabapentin (Neurontin) (ID 57467)\". Erowid.org. Aug 26, 2009. erowid.org/exp/57467",
  "substance": "Gabapentin (Neurontin)",
  "views": "17584"
 }
}
