{
 "id": 9543,
 "title": "Freebase Research",
 "date": {
  "submission": "2009-06-12T07:00:00.000Z",
  "experience": "2006"
 },
 "author": {
  "name": "Flippincandy",
  "gender": "Male",
  "weight": "170 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": " repeated",
   "administration": "smoked",
   "substance": "MDMA",
   "form": "(freebase)"
  }
 ],
 "report": [
  "For my introduction I am going to say that these experiences were conducted under someone's supervision and that you must know your own body and your tolerance before trying these experiments.",
  "MDMA, being one of my addiction, led me to try and use it in different ways asides from orally taking it. Snorting I have done and realized that its pointless and gives me only the speedier edge of the roll. So my experiences with freebase MDMA.",
  "First account: I was already rolling on 2 good pills. Blue airplanes. Which contained MDMA, MDA, and Ketamine.[Erowid Note: While it may be that the substances described below are MDMA, MDA, and Ketamine, Ecstasy tablets are notoriously impure or misrepresented, often containing chemicals other than those they are presumed to contain.]   I decided to maybe try and cook the powder of one of my extra pills into a freebase form. I used the method of which cooking cocaine, baking soda, water, and the substance, in this case being MDMA. The result was a off blueish-whiteish rock like crystal which looked like a cooky form of crack.",
  "So I figured I would load a bowl up with some cigarette ash, and drop a piece of the rock on top (my conventional way of smoking freebase). I sparked the lighter and drew the smoke into my lungs. Tasted quite bad, like meth. All of sudden a rush came over me. Eye wiggles super intense. Couldn't really move. The ketamine in the pill accually took over the MDMA 15 seconds into the rush and basically just left me with a ketamine body stone. Then it wore off in a few minutes and my previous roll came back. 'This is nothing' I thought to myself. But I wasn't finished yet.",
  "Later on I aqquired some pure MDMA from a friend who brought it back from a music festival. I had bought 5 hits, one of which I was going to use for my experiment. I figured I would attempt this one sober, so I could actually feel the effects of the freebase all together. Same procedure of cooking used. Same procedure of smoking. The effects this time threw me out. I was rolling hard for which seemed like an hour. But when I looked at my clock as I came down only 15 minutes have gone by. 'Damn', I thought. How could something that intense only last that long. Crack version of MDMA I thought? I figured I would sacrifice one more hit using a different cooking procedure. Instead of baking soda I used ammonia in this occasion.",
  "0:00 Smoked freebase",
  "Woaw. Way better than the last one. I think the ammonia cooking procedure worked alot better. I was rollin hard as hell. Really this just gave me the body feeling, no trails, but I couldnt complain I felt great. All and all the experience only lasted maybe 20 min. It tore me up worse than a 7 hour roll. So in my opinion freebase MDMA is good for a little rush if I'm buy myself, but if I'm going out to a party, eating the hit is my best bet for the long lasting roll."
 ],
 "erowid": {
  "id": "57471",
  "citation": " Flippincandy. \"Freebase Research: experience with MDMA (Ecstasy) (ID 57471)\". Erowid.org. Jun 12, 2009. erowid.org/exp/57471",
  "substance": "MDMA (Ecstasy)",
  "views": "15709"
 }
}
