{
 "title": "We Were Free",
 "author": "Xplicit",
 "citation": " Xplicit. \"We Were Free: experience with Methoxetamine (ID 95441)\". Erowid.org. Apr 25, 2012. erowid.org/exp/95441",
 "substance": "Methoxetamine",
 "bodyweight": "200 lb",
 "report": "<p>So me and a friend, J, decided we wanted to go camping in the woods in the northern part of town (living in Mississippi, we were very isolated.) After reaching our destination (a abandoned 6 acre plain near a trail) we decided to set up tent and chill out because of the bugs.</p><p>We both were going to do 200mg, a total of 400mg separated into four 100mg capsules.</p><p>We sat down and both snorted 50mg each, saving the rest for later and to see how it would effect us.</p><p>This was about 11pm, and from here until 3am, we did not track time.</p><p>I came into this journey with an analytical mind trying to figure out my relationship with myself, and my addiction to nicotine. This drug, being a chemical, wouldn't have led me to guess the spiritual effect it would have on me.</p><p>After snorting our 50mg doses (didn't sting virtually at all,) we decided to talk about our lives and our past job we had just ridden ourselves of. This is one of our normal conversations we would have even without taking substances. About 10 minutes in, we both could feel the 'twinkle' most psychedelics give you on the onset. After a while of waiting for the drug to kick in, we decided to lie down and stare through the screen roof of the tent and look at the stars.</p><p>J: 'Ahhh.. LIFE.'</p><p>It hit us.</p><p>The tent disappeared. All that was, was the sky and our beings. We could feel the love our 'God' had for us and gift that is life. Our conversation only intensified this, for were actually talking to each other, and God.</p><p>My insides were on fire, but a fire that was my essence. Me, J, God, and even you who is reading this are connected. We were one. I told J the quote I heard from a philosopher: 'Life is the conscious viewing itself subjectively; there is no death.' We could feel that we were the same entity. We both were experiencing the same. exact. thing.</p><p>We sat up from that experience, only to find we weren't tripping like we thought we were. This was only about 40 minutes after laying there, but by then we should have been feeling it a lot harder than this. So we decided to split the rest, right then and there.</p><p>We decided to go for a walk through the field until we felt the drug take hold of us again. We walked in a line, talking, for about a minute til I realized: The bugs weren't biting us. We could see the bugs on us, but we did not feel them. I pinched J. At first he was confused as to why, but then he realized exactly what I did without me telling him. We felt no pain. We not only couldn't feel pain, but we forgot about the struggle we were going through with our daily lives also.</p><p>The analytical side of me figured it was how similar the drug was to PCP and the 'invincible' property it has. We then started to trade licks, and this ended up into us wrestling. We seriously could not harm each other.</p><p>This primal act of us playfully conflicting made me realize another thing.</p><p>We are FREE.</p><p>This is when I felt the drug. I felt encouraged by our God to yell and scream and be myself, for I was out in the middle of nowhere, and nothing could stop me. I was running around like a monkey. No. Really. All fours, yelling gibberish, rolling around and having fun.</p><p>J was confused and astonished at what I was doing. I got up and, all of a sudden, stopped tripping (I'll get more into this a little later.)</p><p>I said: 'Dude. We are out in the middle of Vancleave. There is almost no one around for 5 miles. We are FREE, DUDE!'</p><p>We both went into a rage of random gibberish and primal dancing. It was beautiful. Two souls and God having fun just being alive. The dew on the grass was making sensations on our skin that could only be described as 'fractals on our skin.' The mud our paws were in was alive. We felt everything.</p><p>We went on to do this for hours (it seemed like.)</p><p>After we had calmed down, we began to analyze the new freedom we were feeling in ourselves. We began to discuss our attachment to nicotine. We decided not to bring any cigarettes or snuff (cause we believed we wouldn't want to drive to get any after we started tripping.)  We both felt as if we never would need this drug again. Tobacco was a joke. A little velcro snippet that was keeping us brainwashed. Nicotine disgusted us. Methoxetamine showed us there is a lot behind this time we were sharing and what was keeping us in this world.</p><p>Beginning to go deeper into the conversation with J, I attempted something in my head. We both were in our own little worlds, but I wanted to see if I could snap out of it. And I did. I asked J to do the same; to see if he could, all of a sudden, grasp 'reality' again.</p><p>We sat there completely sober.</p><p>It was astonishing. One moment we were totally connected to each others souls, feeling each others pain and struggle (but rejoicing our vacation,) and the next moment feeling as if we hadn't touched the powder whatsoever.  I had realized it was in our mind. We were in control of our trip, and it was all in our head to be in depth with our spiritual self. We laughed at that fact, checked the time (3am,) and let the drug consume us until the sun came up and we decided to go home.</p><p>I took home a new perspective of myself, and my relationship with this world that morning, and will never look back. I realized every moment in this world, you have to remember you are FREE. You can do whatever you want.</p><p>I was blind, but now I see.</p>",
 "year": "2010",
 "id": "95441",
 "gender": "Male",
 "age": "20",
 "timestamp": "2012-04-25T07:00:00.000Z",
 "views": "5704",
 "dose": [
  {
   "time": "0",
   "amount": "50 mg",
   "administration": "insufflated",
   "substance": "Methoxetamine ",
   "form": "(powder / crystals)"
  },
  {
   "time": " T+ 1:00",
   "amount": "150 mg",
   "administration": "",
   "substance": "Methoxetamine ",
   "form": "(powder / crystals)"
  }
 ]
}
