{
 "title": "Notes on IV and Rectal Use",
 "author": "FireDragon803",
 "citation": " FireDragon803. \"Notes on IV and Rectal Use: experience with bk-MBDB (ID 95483)\". Erowid.org. May 14, 2012. erowid.org/exp/95483",
 "substance": "bk-MBDB",
 "bodyweight": "130 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "75 mg",
   "IV",
   "bk-MBDB",
   " T+ 0:02",
   "75 mg",
   "rectal",
   "bk-MBDB",
   " T+ 1:00",
   "50 mg",
   "IV",
   "bk-MBDB",
   " T+ 1:03",
   "50 mg",
   "rectal",
   "bk-MBDB"
  ]
 ],
 "footer": [
  [
   "2010",
   "95483",
   "Male",
   "",
   "35",
   "May 14, 2012",
   "3037",
   " "
  ]
 ],
 "report": "<p>After a long well loved history of experiemce with Meow, Meow (Mephedrone,4MMC) I found myself saddened by it becoming illegal and impossible to get anymore so i started to search for something interesting and new. I found it -- MDBD, Butylone.</p><p>I was a chemistry major in college so i could rough;ly predict how it might feel and had 20 years of experience with dozens of substances. So I was clearly an experienced psychonaut and prepared.</p><p>I prepared 75mg for IV usage. And administered. There's no room for error with this substance just as with meow, because if I miss even slightly the burn is furious!</p><p>T 30sec Warm invigorating rush like meow or meth in that there's an immediate adrenalyn release as well as a quickened heart rate like jumping out of a plane.</p><p>T 1min  Feeling of euphoria combined with sharper feelings of kindness and connection to others. Then a sudden urge to watch internet porn or make love.</p><p>T 2min  Decided to try to administer a rectal booster dose. Administered 75mg in 3 CC of water. Made my male part tingle immensely.</p><p>T 3min  Begining to sweat profusely. Clearly my temperature has climbed. Music is significantly enhanced. Labido is through the roof.</p><p>T 1hr  Re apply IV dosage of 50mg. Incredible rush again. repeat of previous experience.</p><p>T 1hr 3min Re apply rectal dosage of 50mg.</p><p>T 1hr 5min Very alert, accelerated. ADD with the desire to juggle porn, conversations, music and computer maintenance at same time.</p><p>All in all, I liked it alot. I liked the way my thoughts connected, and I *really* enjoyed conversations. A very social drug.</p><p>T 4hrs Feel like I'm coming down but clearly it's so gradual and slow. This stuff last forever it seems.</p><p>T 6hrs begining to calm but clearly still wound up, controllable though now.</p><p>All in all this was an amazing experience with a quality somewhere in between Meow and speed. Deffinite hint of MDMA like feelings, but clearly much more speedy =) Will try again soon =)</p>"
}
