{
 "title": "Experiments",
 "author": "GW",
 "citation": " GW. \"Experiments: experience with Amanita muscaria & Cannabis (ID 9552)\". Erowid.org. Oct 3, 2001. erowid.org/exp/9552",
 "substance": "Amanita muscaria & Cannabis",
 "bodyweight": "150 lb",
 "header": [
  [
   "DOSE:",
   " ",
   "oral",
   "Amanitas - A. muscaria",
   "",
   "",
   " ",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "report": "<p>After having read much of Amanita Muscaria, in late summer 2001 I finally tried to collect some Amanita muscaria from near my home in the Southern Colorado Rocky Mountains.</p><p>My first experiment was sauteeing 2.5 mushrooms fresh.  This didn't work out well as 6 hours of nausea, delirium, profuse sweating and salivation ensued.  Clearly the decarboxylation process enacted through drying was necessary.</p><p>I dried the mushrooms in the sun for two days, then in the oven at 175F for two hours.  Crushed to small pieces and then made into powder using coffee grinder.</p><p>Standard dosage preparation is to add 30g of powder to 6 cups of water and steep over lowest heat setting on oven for 1 hour to create a tea.  Drink 2 cups and then proceed to consume urine...even though it sounds nasty, it isn't.  Just cut it with some Gatorade or other flavoring.  Once processed by the body, you can recycle the good stuff this way and avoid more toxin consumption.  See http://www.jamesarthur.net for best recipe.  This is essentially what I followed.</p><p>First I tried 15g dried Amanita muscaria and little side effects occurred, but also little good stuff.  Needed more.</p><p>Next, tried 35g of dried Amanita muscaria with 2 hits of cannabis.  No bad side effects AT ALL!  Great religious experience.  Massive time compression, infusion of 'The Great Mind' of common consciousness we all share.  Wonderful control over hallucinations.  More of a 'perceiving' experience than a visual one.  Truly mind blowing!</p><p>Next, tried 45g of dried Amanita muscaria with 2 hits of cannabis.  Quicker to that 'sacred ground' of God than the first time.  Purged some long standing 'mental baggage' in the process.  The insights and time compression were beyond description.  Finally got to experience the total peace of being with God!</p><p>Finally, tried 30g of dried Amanita muscaria with no cannabis.  Side effects minimal (slight nausea), however, really didn't turn the corner enough to reach the 'sacred ground'.</p><p>For the best experience, it appears that Amanita muscaria must be used dried.  Cannabis seems essential to really set it off and killed ALL bad side effects.  The ancient Soma brew appeared to be Amanita muscaria, Cannabis and a couple other plants.  Now I can see why.  Don't be scared of it, just prepare it properly!</p><p>Peace to all!</p><p>GW, Sept. 2001</p>",
 "year": "2001",
 "id": "9552",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2001-10-03T07:00:00.000Z",
 "views": "45244",
 "dose": [
  {
   "time": "DOSE:",
   "amount": " ",
   "administration": "oral",
   "substance": "Amanitas - A. muscaria",
   "form": ""
  }
 ]
}
