{
 "title": "Pulsating Warmth, Making Discoveries",
 "author": "Dizz",
 "citation": " Dizz. \"Pulsating Warmth, Making Discoveries: experience with Cannabis (ID 9557)\". Erowid.org. Aug 16, 2004. erowid.org/exp/9557",
 "substance": "Cannabis",
 "bodyweight": "130 lb",
 "header": [
  [
   "DOSE:",
   "6 hits",
   "smoked",
   "Cannabis"
  ]
 ],
 "report": "<p>July '01</p><p>Long story short, I was camping on an island with my sister and some friends that I only get to see once a year.  There were five of us: me, my sister Mary, my friend Fred, Freds sister Ann, and Anns friend Kate.  (Names have been changed.  Duh.)  Fred smokes, and my sister smokes (I got her started), but Ann and Kate, being a year or two younger than the rest of us, didnt smoke.  I had brought a big fat joint along (a gift from another friend), hoping there would be a chance when Fred and I could sneak off and smoke it, possibly with my sister.  Anyways, the night was rather eventless.  We all sat around the fire and made smores.  Soon, Fred got into a fight with his sister.  They bitched back and forth, and Fred eventually just gave up and announced he was simply going to go to sleep early in his tent (it was about 8:00 pm).  I saw my opportunity.  I followed Fred into his tent, and he mumbled for me to go away.  I whipped out the joint and shined my flashlight on it.  Freds face immidiately lit up.  He simply said Lets go look at the stars!  So off we went, to the opposite end of the island, away from the two non-smokers.  My sis cought on and followed quietly.</p><p>We lit that fatty up, and it burned slow because my friend had packed it so tightly.  We each had four long hits.  We watched the stars as we passed the joint around.  It was so relaxing, the air was cool and the sky was clear since we were so far away from any major ciries.  We could even see a few shooting stars.  Soon, Fred decided to go back to the fire so we wouldnt look too suspicious by staying over there so long.  I took two more hits, but my sister passed.  She was already starting to lose control.  I was feeling it too.  Man, was I feeling it.  I could tell pretty quickly that this weed was as good as my friend said it would be.  I pinched the cherry off to save the rest for later (we only smoked half a joint between the three of us!).  My sister and I began to walk back to the fire, which was probably 30 feet away.  Right about here, I got a strange sensation that I can only describe as tunnel vision.  The fire seemed to be at the end of a tunnel.  I laughed till I nearly fell over, because there was of course no such tunnel.  We stopped to regain control and decided to share a clove cigarette.  It tasted absolutely delicious.  After regaining our composure we continued, and when I was at the end of the tunnel, I started really tripping my balls off</p><p>I sat down by the fire and was immidiately enveloped by it.  It sent the most wonderful warm vibrations through my bodyI felt the warmth like Id felt nothing before.  It was almost like an constant orgasm.  I started talking to Fred, and it was pretty obvious that he was higher than a kite.  After fighting the giggles for a while, I managed to stand up and go get my bag of licorice.  I promptly ate the whole bag.  We talked, we laughed, we even talked about laughing.  Ann and Kate even joined in on our laughing, even though they werent high and didnt know we were high.  We sat around the fire for hours, at least until about 1 or 2 am.  I was reluctant to leave the fire, but eventually did and went to my tent.  After curling up in a sleeping bag, I began to think about all sorts of thingsreally weird things.  I tried to comprehend shit like how big the universe is and how no two people are alike.  It blew my mind.  I was still going really strong, which made it hard to sleep. I actually learned something very important while I was drifting off to sleep: human beings are lonely creatures.  If you think about it, life is nothing more than a continuous series of interactions with other people.  This is all we have in this world, so make sure you make the most out of it.  Be positive towards others, and you can probably find peace with yourself.</p><p>I eventually did go to sleep, and I slept for only six hours.  Even though I had little sleep, I woke up feeling fresh and newin short, I felt like a million bucks.  Well, that was probably the highest Ive ever gotten, especially considering the small amount I had smoked.  If you ever get the opportunity, go do something outdoors with your friends while high, like camping.  Theres nothing like it.  But if you do anything, try to use experiences like these to learn something about yourself.  You might be surprised at what youll find</p>",
 "year": "2001",
 "id": "9557",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2004-08-16T07:00:00.000Z",
 "views": "6959"
}
