{
 "title": "A Day at the Park",
 "author": "solow",
 "citation": " solow. \"A Day at the Park: experience with 25I-NBOMe & Cannabis (ID 95593)\". Erowid.org. Sep 15, 2013. erowid.org/exp/95593",
 "substance": "25I-NBOMe & Cannabis",
 "bodyweight": "125 lb",
 "header": [
  "DOSE:",
  "625 ug",
  "",
  "25I-NBOMe",
  "(blotter / tab)",
  "",
  "2 bowls",
  "smoked",
  "Cannabis",
  ""
 ],
 "report": "<p>Background Information:</p><p>I had recently been getting back into the mindset of psychedelics and tripped twice on LSD the month prior to dosing on the 25i-NBOMe. I had taken LSD twice over half a year before the other trips, so I have taken psychedelics at four different times. 25i-NBOMe was my first non-LSD psychedelic drug.</p><p>Setting:</p><p>I was at a friend's house for a lot of the trip but we ended up walking around a lot. We'll call that friend M. My other friends, we'll call them N and C, were with us as well. Only M, C and myself had a history with taking psychedelics. It was N's first time ever delving into them. M took three 250 g tabs, C and I took 2.5 tabs, and N took 2.</p><p>The Trip:</p><p>We get the tabs. We put them on our tongues at 2:45 PM on a Tuesday. It was absolutely beautiful outside so we were very excited for the trip. We were on M's balcony at his house with the tabs on our tongues. If you have never taken 25i before, you wouldn't know that it has a very bitter taste.</p><p>An hour passed and we have yet to actually see anything crazy. We did, however, begin to feel an intense body-high and were getting smirks on our faces that we could not wipe off. This was sort of expected as I always notice that happening on the come up. We then decide that it was time to leave the house and begin being truly outside. Before we left, we needed to get a drink. As stated before, the tabs were extremely bitter so I had this disgusting aftertaste in my mouth. We got some cups of water and when I sipped the water, it tasted absolutely nothing like water. It just tasted I was sipping on chemicals. This is something I had never experienced with LSD, but it was nothing serious.</p><p>We leave M's house and head out toward a pond area in his neighborhood. We were just relaxing at this area for a short while and while we were there, a duck swam up near us. This is when I realized the drug was taking over. The duck was absolutely crazy. I can't describe how many colors one duck can have. He was glowingly vibrant and his iridescent feathers were quite a sight to see. One angle he would look green and another he changed to purple. This phenomenon of shifting colors on psychedelics is something I absolutely love, so I could not get my eyes off this duck. Not only that, but he had extremely bright orange feet that were jumping off of his body into my sight. All of my friends agreed that this duck was really awesome. There were also gray, black, boring geese that were being mean to the duck and that pissed me off. But otherwise, the duck was very eye-catching. Eventually, we decide it is time to leave.</p><p>We head off toward another pond-ish area in M's neighborhood for more admiration. This is where things began to get very visual. There were a bunch of purple and orange fish everywhere in the pond and they were really wild to look at. When I was looking at these fish, my peripheral vision began pulsing and bouncing around my eyes and going really fast. After that, I noticed the same thing happening to the trees around me. The bark on the tree was flowing and twisting right in front of my eyes. I felt as if I was in complete control of what I was seeing (which I probably was) and that I had the ability to bend reality at my will.</p><p>After about ten minutes at the second pond area, we leave. At this point it's probably been a half hour since we left M's house so we definitely have a lot more of this trip to explore. We start making our way back towards M's house in order to smoke weed. We just thought that the weed would completely elevate what we were feeling. As we were going back, we noticed that all the trees looked like they had eyes staring at us. They were like holes in the tree that eerily looked like they were looking right at us. Another tree even looked like it was an actual totem pole and there was a hawk at the top looking down upon us as well.</p><p>So we eventually got back to the house and we started to pack a bowl. I don't know why, but it seemed like it took an extremely long time to get the bowl packed. We began to smoke it on the balcony, and realized there were a bunch of children and other people right in front of the balcony. We only took two hits each of the bowl and thought it was getting too sketchy so we halted the smoking. As soon as the bowl hit the floor, everyone outside was gone. We had a good laugh at that since we thought that there were millions of people watching us as we smoked, when nobody was there anymore. We picked the bowl back up and people congregated outside the balcony once more, so we decide to give up on the smoking. We had a good amount of hits each so it was still worth it.</p><p>After giving up on smoking, we were looking at a brick wall across from us on the balcony and it was going nuts. The majority of the bricks were a pink color, but there were also some black or dark green bricks. The darker bricks looked like they were swimming around the pink brick area and there was trailing behind them. It looked really amazing.</p><p>We finally decide it is time to leave and go to the place we had in mind the whole trip: the park. We make our way to it by cutting through a golf course and the course looked absolutely huge. It looked like the course never ended. We made it to a fairway and it looked amazing. There were perfectly red and green trees lined up one by one down the fairway and the area at the end of it looked absolutely tranquil. We think it would be a good idea to stray away from the park and head down this direction. Unfortunately, we saw golfers on the course and immediately turned around, which I thought was hilarious. It was like how we witnessed the 'yonder peaks' of the world and it was completely ruined by the golfers! I know that sounds unfortunate, but it was funny.</p><p>We were back on track towards the park and at this point we are almost approaching the peak of the trip. On the sidewalk in the direction of our goal, I could completely see down the street and the park's sign. Mind you, we were a good two miles away from it so I thought it was pretty awesome how I could see the goal from where I was. We surprisingly are not walking for a very long time for us to get there. Before we enter the park, we saw that there were hundreds of kids and parents there. M decides to give us a nice pep talk and how we need to stick together and I swear it sounded like I was walking into a warzone. We gathered up our senses and daringly headed into the park.</p><p>When we were surrounded, it was strangely quiet. Our group split into groups of 2's for a short while, and I was alone with N. It was seriously silent; it was as if N and I were in an isolated bubble and his voice was the only thing I heard. We met back up with M and C and headed into a wooded trail in the park.</p><p>The woods had a completely different atmosphere than the park. The woods were dark, red, raw and earthy while the park was bright, green, blue and open. We were not in the woods for very long, as we were just walking through a trail. The woods, being dark and whatnot, was certainly not a bad thing, I loved both areas equally.</p><p>We left the woods and got on top of the hill in the center of the park. The sun was almost setting and we had a great view of everything. We sat down on a bench and just admired the land. There is also a lake in the park that we were looking over, and the reflections of the trees in the water was bending and twisting when I looked at them. At this point, C is getting antsy. We tell him to calm down as he began looking crazy. He asked if it'd be okay if he were to lie down on the hill, so we agreed that it was fine. He laid down on the hill for a good 10 minutes before getting up and came back to us and described that he was having full blown crazy CEV's on the hill and he happily stated that it was the 'pinnacle of his life.'</p><p>Shortly after that, we go down the hill. The sun was setting so we had to get a good view of it. There was a bench near a funky tree that we sat down on that had a clear shot of the sun and by god, it was incredible. I saw the sun changed from white to a dark purple in a matter of seconds and I could see different layers of color in the sky going from black, to purple, to red, to orange, to yellow, to green and back to blue. I could completely see the curvature of the earth and saw clouds being sucked down into the curve. If I had a pen and paper, I could have drawn what I was seeing perfectly. The sunset was absolutely incredible as I really felt the Earth turning and what exactly I was witnessing. It was as if I was a large being and I was just looking down into the distance and could see further than the human eye should, like I could look down the distance and around the Earth back to where I was sitting on the other side.</p><p>Suddenly, it was nighttime. We decide to leave the park and we feel the drug coming down. On our way back, on the sidewalk, we see more eyes in the trees looking at us. Unlike before, these eyes were not simply holes in the bark but it looked like someone got a knife and individually carved eyeballs into each of the trees. Mind you, these eyes were nothing scary at all; they were welcoming and very interesting. We head back to M's house to have another (successful) smoke session and we felt almost back to baseline. We start playing with a strobe light and the choppiness of movement in it was pretty cool to look at. But shortly after that, we noticed that we were basically sober (apart from being slightly high from the weed). We go to the mall for a bit but that was nothing too exciting and it was pretty much the end of our trip.</p><p>Conclusion:</p><p>The 25i trip was really awesome. It was extremely visual, as the colors were extremely vibrant and there were patterns in some of the trees I saw. The headspace of the drug was extremely clear, I felt as if I was sober but there was a filter over my eyes. It was a great time and I absolutely recommend it, it will certainly do your sight some justice. If you were looking for something more introspective, I'd recommend LSD honestly. If you're all about visuals, then go for it. I thought it was a great time.</p>",
 "year": "2012",
 "id": "95593",
 "gender": "Male",
 "age": "18",
 "timestamp": "2013-09-15T07:00:00.000Z",
 "views": "735",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "625 ug",
   "administration": "",
   "substance": "25I-NBOMe",
   "form": "(blotter / tab)"
  },
  "1": {
   "time": "",
   "amount": "2 bowls",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": ""
  }
 }
}
