{
 "id": 9562,
 "title": "Beyond What I'd Hoped",
 "date": {
  "submission": "2006-11-20T08:00:00.000Z",
  "experience": "2006-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Anonymous",
  "gender": "Male"
 },
 "dose": [
  {
   "time": "0",
   "amount": "8.0 mg",
   "administration": "insufflated",
   "substance": "5-MeO-DMT",
   "form": "powder / crystals"
  }
 ],
 "report": [
  "Friday was awesome beyond what I had hoped for. 8mg 5-MEO insufflated, then same again at the 1 hour mark when the initial dose was really fading. Total time with noticable effects maybe 3-3.5 hours. Very psychedelic, glorious. positive. Did a lot of laughing and lying on the floor. Very difficult to put into words. Few visuals, but that didn't diminish the trrrriiiipppppyyyyyy-ness of the whole thing. Positive physical contact with my 3 covoyagers. Hugs. Comfort. Lying on the floor with my eyes closed, feeling SO much bigger than my actual body with the deep tones of the music swirling deeply within me.",
  "The effects were of high quality, even as they were fading. Got to swing myself upside down on one of those boards you hook your feet into -- good back stretching equipment. Made me laugh, laugh, laugh, to swing myself up and down about 2/3 of they way through the experience. Lots of fun and felt great.",
  "I read a lot of too-intense reports about 5 MEO, but my experience was pure bliss. Had a lot of fear/intimidation going in, which dissipated quickly after the effects kicked in. I'd do it again in a heartbeat, ideally with 10-12mg insufflated. Listened to this echoey, very deep tibetan chanting thing, which was far out, maaaannn. Near the end we put on that Laswell ambient remix of Bob Marley's stuff, which just helped coast through the tail end of the experience in a calm, relaxing, and peaceful way. Food appreciation was highly intensified; I think I ate the best fruit salad of my *entire* life on Friday. Wow.",
  "It really worked, and worked wonderfully. Sacred space, and I'm so grateful that I was given this opportunity. Not sure if this is a scheduled drug or not, it might actually be legal. I totally, completely, enjoyed it. Did I bring anything 'back'? The sense that I don't have to have so much anxiety prior to trying a new altered state. But mostly, I brought back the life-enhancing feeling of having had an experience of Entheogenic Joy (but still no sudden Connection To Everything. Perhaps with higher doses.). Yeah. I'm sure 5-MEO will continue to baffle people and throw the occasional person for a loop. But with proper set and setting, it's a magickally marvelous thing. Highly recommended. Was a little out of it the next day, but not too badly. I'd still like to try smoking it, but would probably insufflate again just because of how awesome this experience was via that route. Also highly interested in virola now!",
  "Deep thanks to those who made this long-wished-for experience manifest."
 ],
 "erowid": {
  "id": "57529",
  "citation": " Anonymous. \"Beyond What I'd Hoped: experience with 5-MeO-DMT (ID 57529)\". Erowid.org. Nov 20, 2006. erowid.org/exp/57529",
  "substance": "5-MeO-DMT",
  "views": "5603"
 }
}
