{
 "id": 9563,
 "title": "Wrathful Goddess",
 "date": {
  "submission": "2006-11-22T08:00:00.000Z",
  "experience": "2006"
 },
 "author": {
  "name": "RRoldanBR",
  "gender": "Male",
  "weight": "58 kg"
 },
 "dose": [
  {
   "time": "0",
   "amount": "300 mg",
   "administration": "oral",
   "substance": "Moclobemide",
   "form": "(pill / tablet)"
  },
  {
   "time": "0",
   "amount": "55 ml",
   "administration": "oral",
   "substance": "Mimosa tenuiflora",
   "form": "(tea)"
  }
 ],
 "report": [
  "DMT source: 500g of Mimosa sp. root bark, 6L of sugar cane distilled brew (about 39 GL), 9L of acidified water (w/ lemon juice)",
  "MAOI source: moclobemide (Aurorix)",
  "After depuration, all the liquid became a strong, dark purple syrup with a brown and purple mud at the bottom (just decanted for an hour or so).",
  "I ate a green apple and took two moclobemide pills (resulting in 300mg). Then, waited for 30 minutes, reading De Philosophiae Consolatio from Boetius. Put some of this syrup along with the mud in a tequila glass (some 55 mL).",
  "I was a little tired (woke up to early) and hungry, but feeling good.",
  "It was very dry and bitter, as if I were licking some wood floor. Some nausea appeared, but I controlled the situation.",
  "After more half an hour, I had to give up reading and went to the sink to vomit. Most of the brew went out, but I was feelling terribly sick... My whole belly was in pain, as well as my balls.",
  "My brain and nerves just seemed to have been transformed into a wood pin cushion. A voice anticipated what was ready to come: Hey, boy, you thought you were a full grown man, but now youll have to take this.",
  "The pleasure I was expecting was far distant from this terror. Im very used to the regular ayahuasca (Psychotria sp.+Banisteriopsis caapi ssp.) and even when threwing up this common ayahuasca I never felt what Mimosa was provoking: a real overwhelming panic.",
  "At that moment, I could discern that the whole event was in my mind, so I could briefly explain to my fiancee how she could help me.",
  "I went to bed, not wanting to hear any of the good music I brought to the experiment. Not even indirect light was bearable. My heart was beating as if it were some dark metal band drum. I couldnt help myself to be quiet, as I trembled all over, but voluntarily did this in order to dissipate some of the bad impressions.",
  "The image of a young friend of mine whos dying from brain cancer was present, as well as the certainty that shell die next year (unfortunately).",
  "This image appeared to be some kind of warning concerning the scratchs I had in my brain, along with some noise itching (which I interpreted as brain or cerebellum disorder).",
  "Endogenous DMT seemed some kind of extraterrestrial device to examine our inner souls. Such an imagery appeared as a computer presentation.",
  "Then this afro woman, much wrathful, showed herself and started to tell me that if I didnt quit such experiences, Id die as my friend.",
  "I was reminded of my beloved ones and all that I did bad to them. I got embarrassed and went on some kind of pardon petition.",
  "Most of the trip was confusing, but ended after 3 hours or so.",
  "I fear if the alluminum on the pans I used was present in the brew, because of the acidified water, thus intoxicating me to a critical point.",
  "Im feeling some hang over even now, two days after my personal doomsday... (ehehehe)",
  "Examining the advices from the shouting black witch, Im intending to follow them, although I feel sad thinking like this. I was in the mood for some rainbow visuals and nice thoughts and got this. Maybe the roots showed me my shadow, my Hades...",
  "Anyway, it was harsh and crude, but very profitable from many points of view... If I decide to repeat it, itll be a very smaller dose, of course!"
 ],
 "erowid": {
  "id": "57531",
  "citation": " RRoldanBR. \"Wrathful Goddess: experience with Mimosa ophthalmocentra & Moclobemide (ID 57531)\". Erowid.org. Nov 22, 2006. erowid.org/exp/57531",
  "substance": "Mimosa ophthalmocentra & Moclobemide",
  "views": "6947"
 }
}
