{
 "title": "Intensity Thy Name Is RC",
 "author": "SpaceOddity",
 "citation": " SpaceOddity. \"Intensity Thy Name Is RC: experience with 25I-NBOMe, Methoxetamine & 4-AcO-DMT (ID 95641)\". Erowid.org. Sep 16, 2013. erowid.org/exp/95641",
 "substance": "25I-NBOMe, Methoxetamine & 4-AcO-DMT",
 "bodyweight": "145 lb",
 "header": [
  "DOSE: T+ 0:00",
  "3 hits",
  "smoked",
  "Cannabis",
  " T+ 0:20",
  "17 mg",
  "insufflated",
  "4-AcO-DMT",
  " T+ 0:30",
  "3 mg",
  "insufflated",
  "4-AcO-DMT",
  " T+ 1:45",
  "3 mg",
  "insufflated",
  "25I-NBOMe",
  " T+ 2:30",
  " repeated",
  "smoked",
  "Products - Spice and Synthetic Cannabinoids",
  " T+ 2:55",
  "50 mg",
  "insufflated",
  "Methoxetamine ",
  " T+ 4:35",
  "50 mg",
  "insufflated",
  "Methoxetamine ",
  " T+ 5:05",
  "7 mg",
  "insufflated",
  "25I-NBOMe",
  " T+ 8:20",
  "50 mg",
  "insufflated",
  "Methoxetamine ",
  " T+ 9:35",
  "50 mg",
  "insufflated",
  "Methoxetamine "
 ],
 "report": "<p>Previous drug history before this experience: cannabis, alcohol, Spice, Salvia, DXM, MXE (Methoxetamine), LSD, Mushrooms, Ketamine, DMT, 2c-I, 2c-E, 2c-P, 25I-NBOMe, 4-Aco-DMT, MDMA, Ecstacy, BK-MDMA, 4-Fa, 4-MEC, Cocaine, & a plethora of pharms.</p><p>This Account was my first well documented trip report. My intentions for this day was to have a simple day-trip celebration for some business success that I had achieved recently. I had a plan initially of snorting 10mg of 4-AcO-DMT, 3mg of 25I-NBOMe, and 50mg of MXE. As you will read it got out of control, resulting in an extremely vivid and intense trip to an overwhelmingly dominating and super surrealistic trip...</p><p>It is also worth mentioning that during this time I was living in Richmond, VA merely days before all the overdoses involving 25-I and mxe and damn media coverage, so all these substances were super abundant and very easy to get. So despite how exaggerated the dosings in this report seem, they were all weighed out in front of me.</p><p>Note: after about 12pm I was smoking spice irregularly yet frequently. This I barely documented.</p><p>[(parenthesis) - are addons to earlier entries in the day. Usually for when I did not have the comprehension or ability to put experience or details into words.]</p><p>9:10am - smoked 3 hits of a one hitter of vaporized cannabis shake [on the way to the park]</p><p>9:30am - insufflated 17mg of 4aco [when I first arrive at the park]</p><p>9:40am - insufflated 3mg of 4aco</p><p>10:04am - definitely noticing some effects. My body feeling like I have a lot of excess energy almost like I am getting warmer. Balance is getting off. J says he is getting nice visuals and is walking funny. (shulgin +)</p><p>10:25am - getting real smooth and nice patterns embedded in the gravel trail of the park. Stomach feels kinda funny. M's face gets red says he's dizzy and takes skullcap off. [Leave the park round this time go chill at friends moms apartment.]</p><p>10:55am - snort 3mg of 25i-NBOMe [Once I arrive at our friend's mom's house]\r[Erowid Note: The doses of 25I-NBOMe described herein are considered extremely high. See 25I-NBOMe Dose Chart.]</p><p>11:40am - smoked a hit or two of some pep spice. Feeling crazy warm and euphoric waves engulfing me. Patterns are really nice and organic looking. (shulgin ++)</p><p>12:05pm - snort 50mg of methoxetamine. Visuals at this point are crazy patterns that variate constantly in intracy yet are just distictly there. The fractals are not dancing around frantically like on high 2C doses, they are just melting and subtly breathing and wafting.</p><p>12:25pm - visuals are crazy as fuck and I'm getting really prominent tracers. My vision keeps shifting perspectives and crawling. My muscles feel like they are tensing up sporadically. (shulgin +++)</p><p>1:15pm - some of the most intense visuals of my life patterns within patterns within patterns are crawling all over the floor and raising up into vertical layers. Colors are very radiant and bright. The 25I and 4aco are melding together wonderfully. Very insane tracers as well; like four solidified colorful after images follow everything that moves. [Leaving apartment.]</p><p>1:45pm - heading to friend Ts place to chill. Getting hard to type because I can not stop shaking in the backseat of my friends car. Clenching my teeth more. The colors of the trip are melting like waves over my lap and phone. The 2c visuals feel as though it's color lens has fused within my vision and everything is distorted sharp and rainbow like. Auditory hallucinations at this point. I might snort another 50mg of mxe soon.</p><p>2:15pm - damn unreluctantly took a line of 7mg of 25i-NBOMe. This is a critical part of the day as I had no desire to do this but M and J were cutting entire 5-10mg lines out of their bags and dosing the entire room. I refused but the two of them both have 40-60 pounds over me and their energy shifted into extreme aggression. Threats start being made and so on and so forth. Another note about this is that they had both eaten snorted 30-40mg of 4-AcO and unknown amounts of 25I and had complained about the trip not being that intense - mainly because they, like everybody else in the room had tolerance way up due to dosing earlier in the week and lack of serotonin. Whereas I had not snorted either substance in a couple weeks and my tolerance was very low.</p><p>2:45pm - intense visuals everything looks like damn colorful cartoons and it's getting hard to breathe. At this point I begin to panic but try keeping it together. An already intense trip, something I would rate about a 9 on intensity, is now accelerating so fast it is stupid.</p><p>3:10pm - crazy intense visuals feel like I'm going to pass out patterns are everywhere and it's getting hard to see. I really don't know if I'm gonna make it. (shulgin...++++) Ok. Straight up something I borderline would call an overdose. Nobody in the room is feeling their line nearly as hard as me. I remember I start losing my vision to straight patterns that are wildly shifting and jumping around hectically, resulting in me losing focus. Start feeling as though I am about to black out. Heart is racing.</p><p>3:30pm - blinding visuals. Fractals are literally engulfing my entire vision and it's snowing outside. So I can't go anywhere. I feel like I am dangerously close to passing out. This is by far the hardest I've ever tripped. Chaotic blindness coupled with hectic complex fractals. The snow falling is literally beams of extremely colourful lights shooting out from the sky. Like if it rained starbursts and skittles set ablaze in neon fire, hitting the ground that is now just a mountain pile of disturbingly grotesque dark muddy white patterns forming 'snow'. At this point I am not seeing objects anymore just surfaces of patterns interconnecting to form objects. Nothing looks even close to normal. Friends faces have a red pools of X and T fractals on their cheeks and around their eyes. I am in a state of delirium struggling to keep some sort of balance. My mind has utterly been blown...terribly.</p><p>4:00pm - so I haven't passed out yet. So I'm probably fine but the intense level of visuals I'm starting to get used. I am in my friends room with hardwood floors and the strips are racing and flying by each other and expanding and shifting at a crazy and constant flow. Everything is moving and warping with patterns at such a exaggerated rate. It can be compared to a 1950's cartoon where all chairs and furniture is dancing around of course only with a shit ton of grainy brightness.</p><p>4:45pm - the initial explosive wave going into the peak of the line has subsided but it is still craziness. I am really restless and am not all that comfortable but it's not bad coming back from all the intensity that surge from the initial dose. (Shulgin +++) Patterns are still a 10/10 compared to any other trip I had had before this. Crazy intense.</p><p>At this point my mind is so shuffled and skewed I cannot type in any detail for a while.</p><p>5:30pm - sniffed 50mg of methoxetamine. I started coming down a little but still delirious as hell and very anxious. [Leave T's house 15 minutes later]</p><p>6:45pm - sniffed 50mg of methoxetamine. [upon arrival at friend C's house; just me and him - he is sober]</p><p>9:45pm - the visuals are still distinct and fluid through out my vision. Color enhancement remains though not even close to prominent as before. I feel a lot of pressure in my skull nice wallop of a headache. But the visual level is still a little bit past like a hit of 2ce and 2 hits of 2ci combined so still real nice. (shulgin ++1/2) [Had left C's house and are now chilling at his Mom's house]</p><p>11:45pm - Really sobered down light patterns still manifest in my jeans and on carpets. Headache has subsided my stomach hurts but my body is straight up exhausted and is reaching it's limit. I am not looking forward to longboarding the 30-45 minutes back to my house at like 4am. (shulgin ++)</p><p>1:20am - really sober and really tired still see patterns but barely honestly. I want sleep but I'm holding out for my own bed. (shulgin +)</p><p>2:50am - I'd call this sober. Still can derive some patterns from carpet but it's a stretch. Just a tiny bit bright vision that's all. Stomach hurts and am very sleepy. Just realized my nose is bleeding, go figure. Headed home in an hour. (Fall asleep shortly after on friend's couch for about 2 hours)</p><p>5:24am - wake up, and begin the ride home. Bone chillingly cold. About 20-25 degrees out and I am dressed in just 2 t-shirts and a semi-thin jacket...cold as fuck.</p><p>6:00am - the only intoxication I am in, is intense fatigue and sleepiness. I finally make it home and fall asleep.</p><p>All in all this day was intense as fuck. Not too many regrets. I did have fun but way too many drugs for one day. Pretty sure I'm going to stay away from hallucinogens for a little bit. Stay safe guys. Don't let people dose you if you don't want to. Remember to stay calm and watch your breathing!!</p>",
 "year": "2010",
 "id": "95641",
 "gender": "Male",
 "age": "17",
 "timestamp": "2013-09-16T07:00:00.000Z",
 "views": "861",
 "dose": {}
}
