{
 "title": "Started Great - Ended Not So Great",
 "author": "IsItMe",
 "citation": " IsItMe. \"Started Great - Ended Not So Great: experience with 25I-NBOMe (ID 95665)\". Erowid.org. Apr 12, 2012. erowid.org/exp/95665",
 "substance": "25I-NBOMe",
 "bodyweight": "65 kg",
 "report": "<p>Yesterday I had my first trip on 25I-NBOMe. I've done mushrooms several times before, so I thought this would be no biggie.</p><p>[0:00] I took the first 550g blotter.</p><p>0:25 After holding the blotter on my upper gum for 25 minutes, I feel nothing coming on,, eventhough the onset was supposed to be around 15-20 minutes.</p><p>[0:30] I take another blotter, fearing I might not trip due to the low dosage.</p><p>[0:55] Still no effects. I take yet another blotter and decide this would be my last one.</p><p>[1:10] I'm sitting at my computer and all of the sudden I realize I'm tripping. Not just tripping, I'm tripping my balls off.</p><p>I feel very uneasy and nausiated. There's patterns all over the floor, similar to patterns you might see when tripping on moderate to high dosages of shrooms.</p><p>[1:30] Still nausiated and uneasy, and some muscle spasms appear. You can compare it to when you're shuddering because you're feeling cold, but only not that strong.</p><p>[1:40] Euphoria sets in, but only mildly. Nausia gets worse.</p><p>[1:40 - 2:00] Time is becoming very distorted. Time is going incredibly slow, and nausia still remains, but weakens. I'm very clearminded. The clearmindedness makes it very difficult for the drugs to have any introspective effect.</p><p>[2:00 - 2:30] I'm feeling very cold, eventhough I'm wearing 2 sweaters. My hands are warm though. There's quite a lot of muscle tensity. I realize I'm jawclenching. I can control it somewhat, but my jaw muscles are very tense. Hallucinations increase a little bit in strength.</p><p>[2:30 - 3:30] I spend pretty much this whole hour staring outside. The colors of the plants and trees are very intense. The longer I'm staring, the weirder the hallucinations get. One moment everything looks like a watercolor painting, the next the sky is turning into 'negative colors'. As a bird flies by I'm noticing some INSANE tracers. I could see 6 birds flying, while there was only one.</p><p>While looking outside I'm beginning to ponder. I feel how everything on this earth is connected, and a harmony is present. I suddenly have a very short feeling of infinity.</p><p>Talking sounds very vague and music sounds very odd. I was listening to songs I've heard many times before, but while tripping my mind always thought the melody was going to sound different. And then when it played like it should play that was a little confusing. Some auditory hallucinations appeared, but they were not very apparent.</p><p>[3:30 - 4:00] I'm starting to play a little with the tracer effect. I would throw a bright blue sponge across my room and see the trail it left behind. Very cool. My mind is becoming less clear: I want to grab something but in the middle of my actions I would forget what I was doing.</p><p>I'm on the computer again. I'm on facebook and the funniest thing happened: I was scrolling through my list of online friends, when I was astounded at the amount of people were online. That never happened before, I thought. A few moments later I realize there are only 25 friends online, but to me it seemed there were about a 100 of them. That's how insane the tracers were.</p><p>Reading text is very difficult. I have the hardest time comprehending what I'm reading.</p><p>Suddenly I'm hearing some kind of technosound, like some sort of machine. Sounded similar to a jet engine. I close my eyes, and see what gives. I see some strange CEV's that are difficult to remember. I'm feeling very active. My body has a green aura, but the notes I'm taking appear to have a red aura.</p><p>[4:00 - 4:30] I decide to lay down on my couch and look at the ceiling. Hallucinations begin to appear after about 1 minute of laying down. I see a conquistador/spanish soldier with the typical helmet from around 1500 A.D.</p><p>I realize that I have no idea were my limbs are. It feels like my legs are twisted around eachother, while they're just next to eachother. Jawclenching still remains (and will remain for the duration of the trip).</p><p>I gain 2 insights while laying on the couch:</p><p>1. When something terrible happens everybody wonders what'll happen to the criminal(s), how they will be punished or apprehended, or how the victims will be rescued or treated. But in fact it's the circle of relations between humans that makes this all possible. Nobody has any power over anybody. I know this doesn't make any sense, but it's incredibly difficult to explain for me.</p><p>2. Psychedelics mainly amplify the subconcious mind. They'll also let you peak into the astral plain, but they will never give you full 'access' to it. The true enlightenment comes from within, and must be done without the help of hallucinogenics.</p><p>[4:30 - 5:00] I'm hungry, and I prepare dinner. I'm very clear-minded now so it's not a problem for me. The hallucinations are starting to decrease.</p><p>[5:00 - 5:30] Dinner is ready and I'm eating it while watching the last bit of the movie 'The Road'. I was less hungry then I thought and only eat about 1/4th of my plate.</p><p>[5:30 - 6:30] I browse the internet again. Enjoying the mild hallucintaions appearing on the screen. I'm now waiting for the trip to be over, as I've had enough, and realized this is not the drug I was looking for. It was fun, but not very introspective.</p><p>[6:30 - 7:00] I take a shower and prepare going to bed. I place my laptop on my bed, and at around T+7:00 I'm in my bed watching The Office UK.</p><p>[7:00 - 8:45] Im still watching The Office and I'm beginning to become aggitated, because the effects of the drug do not appear to be decreasing.</p><p>[8:45] I'm panicking. My god. This isn't good. I keep thinking I've broken my mind, that this trip is never going to end. I'm afraid of the consequences. 'How must my life continue like this?' I kept thinking to myself. 'I've fucked my whole life up in a couple of hours!' I said. And that's when the most terrifying feeling I've ever felt crept upon me. I felt like my mind was going to snap any moment. At a desperate attempt to stop it from getting any worse I jumped out of my bed and immediatly started powerlifting, to keep my mind off of these thoughts. It helped. Then I started shadow-boxing, because the feelings kept returning. I figured I should exhaust myself so the drugs will clear out of my system faster. I also drank a lot of water, to rinse my body.</p><p>Gradually the anxiety weakened, but didn't disappear. I now placed my laptop on my desk in a desperate attempt to resaerch info on how to stop a bad trip like this. I didn't find anything immediatly so I started to panick again. I powerlifted again, to clear my mind. This continued to about T+9:15. Now my body felt exhausted, but my mind was still very active.</p><p>[9:15 - 9:30] I took a shower, repeatedly making my head wet, because that felt very good to me. Anxiety was still present, but was weakened again.</p><p>[9:30 - 10:00] I prepared some tea and started the movie Titanic. I chose this one because it's a long movie. If I could just take my mind off of these bad feelings, I figured, everything would be alright.</p><p>[10:00 -  (+/-) 11:00] I went to bed with my laptop, continuing the movie. The anxiety moderately resurfaced, but I managed to control it somewhat.</p><p>At around T+11:00 (3:00 AM) I fell asleep after putting on some meditation music (Deuter). I woke up several times during the rest of the night, and sleep felt very shallow.</p><p>At 8:45 AM the next morning I woke up, with a slight headache. The anxiety feelings were still very mildly present.</p><p>I continued to watch Titanic and browse the internet until about 11:00 AM.</p><p>At 11:45 AM i went to the store to get food, because I was very hungry. When I returned the anxiety started again. It made me feel like shit all over again.</p><p>at 1:00 PM I decide to put some Deuter on again, and rest on the couch. I fell asleep pretty quickly and slept for about 1 hour before waking up. It felt a lot longer. Then I fell asleep again and, again, 1 hour later I woke up. I got up and I felt a lot better.</p><p>I think it will still take some time for my mind to heal after this terrifying experience. I threw away the remaining 25I I had left. I'm never trying it again. I feel like it might've permanently damaged my mind.</p><p>So to summarize:</p><p>It's a very powerful psychedlic, but it wasn't very effective for a deep introspective trip. Be careful with the dosage. I should have taken about 500g first and just wait 4 hours.</p><p>25C-I-NBOMe is NOT, I repeat, NOT a replacement for shrooms or lsd. This drug is very different and if not taking precautiously, it can and will damage you.</p>",
 "year": "2012",
 "id": "95665",
 "gender": "Male",
 "age": "19",
 "timestamp": "2012-04-12T07:00:00.000Z",
 "views": "9719",
 "dose": [
  {
   "time": "DOSE: T+ 0:00",
   "amount": "1 hit",
   "administration": "buccal",
   "substance": "2C-I-NBOMe",
   "form": "(blotter / tab)"
  },
  {
   "time": " T+ 0:30",
   "amount": "1 hit",
   "administration": "buccal",
   "substance": "2C-I-NBOMe",
   "form": "(blotter / tab)"
  },
  {
   "time": " T+ 0:55",
   "amount": "1 hit",
   "administration": "buccal",
   "substance": "2C-I-NBOMe",
   "form": "(blotter / tab)"
  }
 ]
}
