{
 "title": "The Real Anti-Depressant",
 "author": "Stargazer",
 "citation": " Stargazer. \"The Real Anti-Depressant: experience with Tabernanthe iboga (Iboga)  (ID 95673)\". Erowid.org. Oct 2, 2012. erowid.org/exp/95673",
 "substance": "Tabernanthe iboga (Iboga) ",
 "bodyweight": "165 lb",
 "header": [
  "DOSE: T+ 0:00",
  "1 Tbsp",
  "oral",
  "Tabernanthe iboga",
  "(rootbark)",
  " T+ 0:30",
  "1 g",
  "oral",
  "Ibogaine",
  "(extract)"
 ],
 "report": "<p>Description of mindset & setting:</p><p>I have been clinically diagnosed with severe depression since a young teenager. I have tried everything including every SSRI known to man, as well as natural remedies from 5HTP to acupuncture and energy healing. Some helped 10% or so but most didn't, especially the prescription medications which gave me horrible side effects which the doctors didn't seem to care at all about.</p><p>After exhausting every other option I heard about an Iboga treatment center which has had success letting people go of addiction, and more pertinent to me, PTSD and depression. I decided to try it out. From reading other reports online, I was pretty scared and woke up in the middle of the night a few times before my trip in a sweat but realized I had to surrender to the experience and trust.</p><p>Details of any preparations made for the experience:</p><p>I didn't think there was anything to do to prepare. I was already off all prescription medications and made sure not to do any drugs or even OTC medicine 6 weeks before the journey. I landed there and was given a spiritual Bwiti Shower which in itself put me into so much ease. I was now ready to surrender and suprisingly 100% of the fear I had left. I felt a complete calm which I haven't felt in ages. This was what really prepared me.</p><p>Dosage & timing information:</p><p>The shaman gave me a spoon of Iboga while chanting a prayer and half an hour later gave me one pill of TA he extracted himself which still had full alkaloids in it. I started feeling a buzz minutes after.</p><p>The Experience:</p><p>I soon saw an elephant spirit on the ceiling and was told to close my eyes. The shaman put a blind on my eyes and tapped my forehead (around my pineal gland). 'Tell me when you can see my finger' for a second I was confused but soon enough I could see his finger lowering and tapping my third eye over and over again and when I said yes I saw his finger pierce through my forehead and then I could see most of the room around me in energetic particles.</p><p>I had prepared a list of questions which the Shaman read back to me after guiding me to my house, and then to the moon and back as a sort of practice to learn the mechanism of Iboga. He told me you can do anything, as long as you mean it 100%. I quickly learned this was exactly the case.</p><p>The answers to my questions were all mindblowing but also extremely simple and to the point. One of the answers was 'because you're too selfish.' Some of them actually revealed things about my parents which I later checked and found all were true.</p><p>Then he guided me into the body of his other patient that was in treatment beside me. I had just met her and knew nothing about her but soon could see the most amazing details of her entire nervous system and capillaries in her neck that were accumulated with this black toxin. It ended up that all her pain was centralized there and she spoke of having a negative entity she felt was there. I told her a bunch more about different parts of her body, the source, and that it would be healed as long as she believed. (Three days later her chronic pain of 10+ years was 100% gone).</p><p>Then the most intense parts came and at one point I remember thinking, shit there's no going back...this is going to happen for a few more hours and you just have to make the best of it. It wasn't that it was scary, but it was just incredibly true, raw, and intense. They weren't just visions. I was experiencing it just as if it was happening in real life (and who's to say it wasn't?)</p><p>At one point a giant yellow snake the size of the earth arched above the planet and then back down and dived full force into me and pushed me into the center of the earth. There I saw blocks of myself get pieced apart until there was nothing left. It felt liberating and this is when I realized this thing could really help me. I asked about my depression and for about an hour or two it showed me how my thoughts were working, how negative thoughts weren't part of my will, but they were attached like a virus to every positive will or thought that I had.</p><p>I asked desperately how to let them go. It kept telling me to dis-identify. I asked how to dis-identify. It said to see that they weren't true. I struggled with this for a while and realized that I still was believing something false, it was that simple. I got mad and begged for something to help me and then it gave me a tool. It showed me a simple window shutter. It said, open it with your mind, and it opened. It then told me that just like you can change a picture in your mind, you can change a belief or thought, and it is not a process, it is instant.</p><p>I started using the shutter visualization for everything negative. I was ready to let it all go and for a few minutes all these beliefs, one after the other were vanished. It was like I flexed the muscle of will strongly enough where finally thousands of these shutters opened into a wormhole which led to heaven. I heard it say 'You are cured now' and after that I experienced a week of utter bliss.</p><p>It was like I had gone to Pandora in the movie Avatar and three months later I have to say that I still feel amazing. My mind is so much clearer and emptier. It's more than I achieved through a ten day Vipassana silent meditation retreat.  This plant is truly amazing and I know the ceremony helped in a huge way to ensure an amazing vision for me and everyone who I've witnessed experience it there. I am finally able to live and have already done amazing things in the past couple of months and wake up everyday excited for more. I thank god every day for Iboga.</p>",
 "year": "2012",
 "id": "95673",
 "gender": "Male",
 "age": "24",
 "timestamp": "2012-10-02T07:00:00.000Z",
 "views": "2154",
 "dose": {
  "0": {
   "time": "DOSE: T+ 0:00",
   "amount": "1 Tbsp",
   "administration": "oral",
   "substance": "Tabernanthe iboga",
   "form": "(rootbark)"
  },
  "1": {
   "time": " T+ 0:30",
   "amount": "1 g",
   "administration": "oral",
   "substance": "Ibogaine",
   "form": "(extract)"
  }
 }
}
