{
 "id": 9567,
 "title": "Learning",
 "date": {
  "submission": "2007-04-18T07:00:00.000Z",
  "experience": "2006-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "AuraithX",
  "gender": "Male",
  "weight": 80
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "mg",
    "quantity": "7.5"
   },
   "administration": "insufflated",
   "substance": "MDPV"
  }
 ],
 "report": [
  "I noted the peak to be about 2hrs 30 minutes and the total duration about 4 hours.",
  "T",
  "Snorted 7.5mg",
  "T +15min",
  "feeling the onset now. I was clear-headed, energetic, and a lot more focused than I usually was. I decided to take this opportunity to do my English homework, to my amazement I was actually enjoying doing it whereas usually I find myself making every little excuse to get out of it but in contrast I was actually putting off other things for my English.",
  "T + 1hr",
  "The first hour flew by as I was doing my homework, at around the T +1hr mark I felt to feel a bit depressed because I wasn't able to do two things at once, I basically felt like I was underachieving for some odd-reason,or like I was coming-down.",
  "T+1hr 20min",
  "the peak had stabilized and I felt good again. I started to suck the roof of my mouth like I do on coke or MDA",
  "T + 1hr 45min",
  "I started to notice some euphoria which could be best compared to a cocaine buzz. I found myself taking those deep, pleasurable breaths and often lying back on my bed and just enjoying the fluttering in my chest.",
  "T + 2hr 45min",
  "The cocaine feeling has started to subside and continuously sucking the roof of my mouth is starting to annoy me.",
  "T + 3hr",
  "The peak is basically over. I am slowly losing the desire again to do any school work but start on my Computing Homework to make the most of what's left.",
  "T + 4hr",
  "back to base. feeling very hungry 'cause I have barely eaten all day. and tired.",
  "Overall, This was very useful as a study aid but I also noticed some euphoric sensation which I wasn't expecting reading other reports."
 ],
 "erowid": {
  "id": "57549",
  "citation": " AuraithX. \"Learning: experience with MDPV (ID 57549)\". Erowid.org. Apr 18, 2007. erowid.org/exp/57549",
  "substance": "MDPV",
  "views": "16338"
 }
}
