{
 "title": "The Connection Between Cats and the Universe",
 "author": "Meta-shroom-sil",
 "citation": " Meta-shroom-sil. \"The Connection Between Cats and the Universe: experience with Mushrooms - P. cubensis, Redrum & Cannabis (ID 9569)\". Erowid.org. Jul 7, 2005. erowid.org/exp/9569",
 "substance": "Mushrooms - P. cubensis, Redrum & Cannabis",
 "bodyweight": "275 lb",
 "report": "<p>It had been a long week of partying at my friend's house while his parents were away, when we had an idea. We had spent the week drinking like fish and smoking more pot than we knew what to do with, when the idea came to us that we should find something that would be a stronger mind trip. So, being the connected person that I am called a few people, and 5 hours later held in my hand 10 grams of P. cubensis, due to the difficulty I had in finding Acid. We agreed that when we all got home the next day, we were going to go back over to Mike's house and shroom together. Personally, I like to shroom on my own, as I get very insightful, however, we decided that we would all trip together.</p><p>I show up at Mike's house around 8:30 PM, the last one to arrive (also the one with the shrooms!). Mike's house is in it's usual state of disarray due to entirely too many drunken pothead dudes hanging around. I clear a path to my chair (that I claimed many moons ago as mine and mine alone when I am at his house), throw the Mad Dog bottles out of it and sit down. I take out my baggie, extract three nicely-shaped caps, grab a box of KFC from the end table and relax. Kyle takes the other three caps, giving us about 5 grams each. We chew the caps, swallow them and promptly start eating everything in sight to prevent the unhappy upsetness our stomachs usually experience on this wonderful substance. We sit back, me in my chair, and Kyle on the couch, and wait for the effects to be felt.</p><p>45 minutes pass, and we have yet to notice anything. About this time, Josh walks in the room with the bowl of Jell-O I made the night before. This was no ordinary Jell-O. Of the total 4 cups liquid needed to make a box, 1 cup was Redrum. He sits down and begins to scarf the wonderful concoction. Kyle and myself, upset at missing out on this, and upset about not noticing anything from the shrooms yet, get up and have some of the Jell-O. We take turns eating spoonfuls from the bowl. About the time that I am eating my fifth spoonful (about the equivalent of 4 oz. Redrum) I begin to notice that the quivering Jell-O has some sort of abnormal importance to me, almost a Buddhist feeling of guilt, like in a previous life I was some form of Jell-O. I begin to feel guilty for eating it without being concerned about how the Jell-O feels about being eaten. Realizing that at long last, the shrooms are having an effect, I return to my seat to ponder what it would be like if the Jell-o was eating me.</p><p>About this time, Kyle starts to talk about a wild visual he is having, about the guitarist from Mudvayne dancing with Bowser and the mushroom dude from Mario Brothers. Kyle is just a weird sort of guy. He will randomly come up with bizarre visuals, that seem to have no real importance. However, when I use P. cubensis, I almost always come back down feeling like I know more about the universe and how everything is linked together. For instance, what the cosmic relationship between order and chaos has to do with cats, or, more specifically, Mike's cat. Tigee, a tiger striped cat, is normally a very anti-social beast. He is perfectly content to be left alone. This evening, however, he was the guardian of all in the house. He kept a very watchful eye on everyone who had any significant amounts of drugs/alcohol in their systems. He was especially watchful of Kyle and myself, and at one point we made eye contact.</p><p>What I saw in the eyes of that cat is difficult to explain. He had a profound oldness of spirit, almost a wise and longing gaze that made me feel as if I was in the presence of a higher being. He moved about the room in a way that seemed to be much more intelligent than I had ever thought before. He was checking every nook and cranny systematically, as if looking for something. Finding nothing, he came back to me, sat on my chest and stared me right in the eyes. He spoke directly into my mind, telling me that he was one of a chosen few souls on the earth that was charged with protecting it from whatever would do it harm. He reported directly to something that he tried to define as the Earth's soul, or nature embodied, but I could not seem to comprehend what he was talking about. He told me that I had just passed through one of the states of consciousness that very few people make it to, that only a handful of human beings knew of the existence of his kind. He told me that because I had crossed into that state and found out about their kind, that someday I may be called upon to complete a task in the name of the Earth.</p><p>My conversation with the cat continued for some time, until he was called away to do something important. At that point, I spent the remainder of my trip marvelling at how good my hair and skin felt, and periodically catching a small visual. Ever since I came down, the cat has still acted differently around me, and has continued to make me marvel at how every movement it makes seems to be somehow connected to its mission to defend the planet.</p>",
 "year": "2001",
 "id": "9569",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2005-07-07T07:00:00.000Z",
 "views": "9093",
 "dose": {
  "0": {
   "time": "DOSE: T+ 0:00",
   "amount": "5.0 g",
   "administration": "oral",
   "substance": "Mushrooms - P. cubensis",
   "form": "(fresh)"
  },
  "1": {
   "time": " T+ 0:45",
   "amount": "4 oz",
   "administration": "oral",
   "substance": "Alcohol - Hard",
   "form": "(cookie / food)"
  },
  "2": {
   "time": " T+ 1:15",
   "amount": "2.0 g",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  }
 }
}
