{
 "title": "DMT Made Me See",
 "author": "HawaiianBlood81",
 "citation": " HawaiianBlood81. \"DMT Made Me See: experience with DMT (ID 95701)\". Erowid.org. Dec 20, 2012. erowid.org/exp/95701",
 "substance": "DMT",
 "bodyweight": "220 lb",
 "report": "<p>I apologize in advance for the improper grammar, punctuation, and rambling run ons... It adds to the state of mind I was in. I was coming down from a LSD Trip trying to integrate my DMT trip the week prior... This excerpt is what came to be...</p><p>DMT answered the question...and allowed me to see what LSD and Shrooms could not...</p><p>I'm HawaiianBlood, Ive been on the sideline of the Movement for some time now, just watching, yet always experiencing, and introducing new allies. I'm planning on going to school for Biochemical Engineering... My hopes to use the allies to there maximum potential, not the limited use people make it out to be... In hopes to help those with depression, also those who lost a loved one, to help accept inevitable death and to see the beauty in life as well as death, for terminally ill patients to no longer fear death... Such power resides yet so little is done to see its advancement...</p><p>'I guess it all comes down to this... Life is all about its greatest lessons... to teach you nothing more than what Its like to feel, to understand, and completely comprehend, Love, Hate Happiness, Sorrow, Joy, and Pain To give up all wants, and needs, to feel Free of cultural understanding, religious perspective, and personal aspects of life itself. I guess what I am trying to say... is we got it wrong... and until we Get it right. Life will continue to be nothing more than Habitual continuation of All replicating escalating problems, with no more a solution today than tomorrow Learn to free your minds... then try and solve the greatest mystery... ...LIFE ITSELF... ' ~HawaiianBlood81</p><p>There is something that has been bothering me for awhile, about life in general... There are multiple ideas in a constant perpetuating flux of absolute revelation that perplex, and intrigue me to such a level. With my new understanding of life, it almost adds up, or is it the answer. There should always be more to the story; I cant seem to figure out if thats it. The patterns of existence, the vibrating frequency of all reality ripples, each ripple, is a new tunnel, a new range of frequency, of thought, of pattern, of existence. Knowing the exactness of this benevolent idea, such judgment to be made, the criticism that follows, yet the secret of it all, kept to a self centered, egotistical, bipolar, Agnostic, yet conceited, overbearing and, undeniably overly intelligent being such as myself, for a good reason... I dove way over my head, almost driving myself to insanity trying to piece together the answer in this little game of life, such realization, such insights, seeing, believing, living, knowing... Most importantly knowing, for whats real and what reality is, there is such a fine line, though this line is invisible to those unwilling to look, to conform to question that of the conformed, but willing to believe in nothing, in stories, tales of morality and life given as a way to subdue and keep closed minds at bay, but not enough to those who wish to venture down the rabbit hole...</p><p>I can't keep thinking about this, but it will never stop. I feel that there is so much more now to existence, that everyone, needs to experience the psychedelic experience at least one time in there lives. It is so honestly beneficial to all mankind, it really has no limit to its potential; it deserves the chance, to be studied once again intensively.</p><p>Theres no real way to describe it, it's something we all want, yet never expect to be so everlasting, so incredibly bizarre that, it really shouldn't make sense, then when you compare it with reality... Blackness to blackness with a glimpse of consciousness, this idea seems too arrogant. Living it consciously, experiencing it, understanding it, thats the big part. People view psychedelics as a drug, because of societies attempt to abolish it, but why abolish such natural beauty, a learning instrument, designed to teach those who know how to use their power...</p><p>I would never want anyone to do something that they didn't want to do there self, nor would I pressure anyone into experiencing its power, I feel everyone deserves the possibility of the outcome, to know what the meaning of existence. It is advised to be mentally prepared to challenge and change your life and view the world as a whole, a whole yet now so complete, that you finally realize what it is to exist. People shouldnt consume psychedelics as recreational or a drug designed to inebriate ones self, but as mind expansive, and as a learning instrument, to view divine art of reality. When given the absolute proposition of taking this form of sacrament, whether it be Dimitri, Cid, Honguito, Mescalito, Aya, Sally-D, or any other sort of Entheogenic Psychedelic, take kindly to your choices and ask yourself, why do I want to take that little step into a world, you know you ineffably are not ready for? What is there to gain and what could be lost Then decide if youre ready for the experience, if youre ready to understand Existence, to know why you exist... What I find so astonishing is Ego Death, absolute nothingness to achieve nirvana, to let go of who you are, to experience the death of who you are, forgetting your identity, it is the true divine nature, and to witness it, is to feel it, not just see it... Everyone has the ability to achieve the state. Accept the divine, trust the divine, and let go, thats the key letting go of Who You Are, and realizing Who WE ARE...</p><p>Life is Now JUST! Cogito Ergo Sum 'I think, therefore I am'</p><p>The reason why I was so upset before was because of the tools I used as the Entheogens, my Mental Cognitive Awareness was dimmed yet slowly becoming aware of what was beyond the horizon of reality... Cid and Honguito gave light to a question, a question that everyone asks, the chemicals itself allow you to question the meaning of life/reality/existence, and they attempt to make sense out of the information your brain perceives, most astonishing assumptions and understandings yet missing the absolute truth the final solution the Ultimate Answer.</p><p>My new Experience is what changed it all. This was my first experience with the most powerful Ally known to man, produced in your brain and naturally metabolized. Dimitri which is what I have been trying to get my hands on for years, with failed attempt to synthetically make it myself.</p><p>The Questions were finally answered, the static unchanging reality we perceive so real was destroyed as were myself and, my ego, as if someone took the curtain and opened it up to the crowd... What I saw can only be described as Heavenly, Divine, Advanced yet Angelic... I was in awe for more than 20 minutes, like being taken from my original surroundings and tossed into a carnival of colossal colors raging into a fit of chaos. The world became almost instantly transformed, beautiful faces cover ever surface as did complex patterns.</p><p>The faces smiled, and seemed to not really be interested in me. But I definitely wasnt alone. I stared at the ceiling as the came into view, they greeted me, as I stared in disbelief they slowly drifted in front of my consciousness, my body no longer existed, Three figures watching me, aware of me, two were feminine, the other was masculine. I tried to control the experience, but the male figure waved his finger at me, in a way telling me I wasnt in control, at that point the colossal colors raged even harder, more chaotic as if the trip was being forced onto me. I could do nothing but let go and finally give in. As I gave into the void, the two feminine figures gently touched my conscious skin. They seemed so unreal yet I felt them there, and they perceived me better than I did them, yet when they reached through me I felt the sensation as more than real, I became engulfed in energy with information, answering everything, to understand finally knowing the answer was always right there in front of me, just waiting for the right instrument to hit that exact note, I watched as they slowly vanish into the walls, and sank into the floors, more and more my original perceptions were returning, and I once again became aware of who I am, and who we ARE... Harmony Exist yet its up to you to make it there. As of now You are every things way of feeling, and sensing itself.</p><p>'If we could sniff or swallow something that would, for five or six hours each day, abolish our solitude as individuals, atone us with our fellows in a glowing exaltation of affection and make life in all its aspects seem not only worth living, but divinely beautiful and significant, and if this heavenly, world-transfiguring drug were of such a kind that we could wake up next morning with a clear head and an undamaged constitution - then, it seems to me, all our problems (and not merely the one small problem of discovering a novel pleasure) would be wholly solved and earth would become paradise.' -Aldous Huxley</p>",
 "year": "2009",
 "id": "95701",
 "gender": "Not Specified",
 "age": "21",
 "timestamp": "2012-12-20T08:00:00.000Z",
 "views": "8209",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": " ",
   "administration": "",
   "substance": "DMT"
  }
 }
}
