{
 "id": 9585,
 "title": "Fractals, Hexagons and Nothing",
 "date": {
  "submission": "2007-02-12T08:00:00.000Z",
  "experience": "2006"
 },
 "author": {
  "name": "Kiffer",
  "gender": "Male",
  "weight": 66
 },
 "dose": [
  {
   "time": "0",
   "amount": "12 mg",
   "administration": "smoked",
   "substance": "5-MeO-DMT",
   "form": "(powder / crystals)"
  }
 ],
 "report": [
  "My interest in hallucinogens (2ce, 2cc, 2ci, 2cb, 5meoDMT, etc.) started my senior year of high school. Even before those, my life was hallucinogens, I thought I was the white rabbit, seen God, had drug-induced ESP, and conducted the movement of stars. Even tripping on a half-o of boomers wearing a ninja turtles blanket as a cape. These past trips were nothing compared to the overwhelming sensations and visuals associated with 5meoDMT.",
  "I was up at a cabin in the woods with two friends, E. and A. It is hard to recall if all these events happened in one day because I was tripping on everything the entire week and the events may be merged. It still accurately reflects what occurred during each dosing of 5meoDMT.",
  "A and I took a couple hits of blotter when we woke up, and tripped while E was at work (We did a wake-and-bake session and insufflated some 2ci as well). We spent the next six or something hours utilizing our acid energy by climbing mountains. E finally returned (he didnt have to work until later) and to celebrate, we first insufflated some 5meoDMT using a very skeptical mg scale (I think around 12-16mg ea). It took only a few minutes for it to kick in, both with its pleasurable mental swirl, as well as the nausea. I was feeling out of breath so, while E and A stayed in the cabin, I ran out to get some fresh air. Damn was it green outside. The best I can describe it is a decent mushroom high without the ridiculous giddiness, extremely analytical and aware, as well as tactile. I got over my nausea quicker than E and A (The fresh air helped, and I may have done a little less than them) and was simply floating on a very aware, semi-omnipotent high. This drug has always been very calm and soothing after the nausea wears off.",
  "After the nausea, we were straight tripping (very tactile, by the way). We then decided to each smoke a cone of 5meoDMT, taking turns sitting the tripper. None of us had ever smoked it before. A measured out what he thought was around 8-10mg, but it could have been more (sketchy mg scale) and capped a half bowl of bud with the tiny crystals. He held it in for about 15 seconds before he fell back onto the futon. Gone to another world, it appeared. I was up next, and I measured what I thought was 9-12 mg. I learned later that it was definitely at least 12 mg.",
  "T-0: Sitting down on the futon, smoked the crystals on a half bowl filter and took 2 hits in one lungful, trying to get every crystal, and trying to hold every bit in. Tastes and smells like smoking a plastic bag.",
  "T+0:15 (seconds): Before I can even exhale, I felt like an invisible hand pushed me gently on my forehead, pushing me back, and I could do nothing about it.",
  "T+0:30: HOLY SHIT THIS IS A TRIP. My entire world dissolved around me and my body was drunk, unable to stand. I couldnt believe it started so fast. I raised my hand as fast as I could (very very slow) and watched certain selected pieces pop out as if it was all just a very realistic puzzle with a hexagonal piece being removed. I tried to stand, but could only do so temporarily.",
  "T+0:45: I couldnt stay upright, and I collapsed onto the carpet beside the futon, bracing my upper body up as if I were doing some yoga position. It was comfy for a second. Breathing real deep.",
  "T+1:00: I couldnt stop repeating Holy shit Holy Shit. This is too much. Even for an experienced tripper, this was world-shattering in large doses. I never would have expected all this.",
  "T+2:00: I think I might be OD-ing, but Im not sure. Breathing felt too weird, mechanical almost. My body felt like it was dissolving, and the music from the CD player was aggressively bombarding me with noise, distorted really loud then really soft at fast frequencies so that I couldnt even tell what song it was. It really felt like the sound was pushing me down against the carpet. I thought I was going to dissolve away, or go into a coma or something weird. I quickly shook off these fears so I wouldnt have a bad trip, but I still voiced to E and A that I may have smoked too much. A told me to lie on my stomach and then Id be ok. Ill be damned, it worked.",
  "T+ 3:00: Staring at the blue carpet, body dissolved, and I am nothing except for a consciously produced in-and-out breathing. No thoughts whatsoever except for in and out. Even the strange visuals of the carpet and the distorted audio didnt faze me anymore. Everything just was and I wasnt. For the next 10 minutes I lied face down, comfortably on the floor.",
  "T+13:00: The trip is wearing off. I can hear E swinging in the hammock, and hes tripping on it too. I think I was the only one who ODed. E and A both seemed zoned on some imaginary mental quest, but not overwhelmed. I was now able to get up and make some tea.",
  "T+15:00: We are all talking about our trip. Its amazing that this was the hardest I have ever tripped before, and it only lasted about 15 minutes of real intensity. It may have extended further, but I was still on the outskirts of an acid trip, a 2ci trip, some insufflated 5meoDMT, and I was still stoned. E reported that he felt his teeth vibrating, which I thought would be very odd.",
  "Another 5meo-DMT trip (I believe later that day)",
  "T+0: A and I decided to trip outside instead of inside the cabin. A wanted to do a higher dose after I told him how ridiculous my trip was, and I wanted to do a lower dose after remembering how ridiculous my trip was. About 8-10 mg for me. We pre-measured the crystals and put them in separate pipes. We sat on a big rock and I smoked first. Plastic again.",
  "T+0:15: Pushed back again as if a wind hit me and I couldnt fight it. Damn that is cool. A grabbed the pipe from my hand so I wouldnt drop it. He then smoked right after me. I was a bit more prepared this time for the freaky rush.",
  "T+0:45: Ever seen the clouds in a Salvador Dali painting? How about M.C. Eschers fractal sketches? Mix those two and you might imagine what the clouds above me looked like: Fractals and harsh oil-paint colors pulling away from the larger body.",
  "T+4:00: I got up, letting A enjoy his trip on the rock, and stumbled curiously to the nearby stream. There is a water gate nearby with a balcony-type structure overlooking the river. All the water from the lakes pools down to this point, and theres a fucking balcony overlooking it. The water appeared to reverse its flow for a few seconds, moving upstream.",
  "T+14:00: After staring at the water for about ten minutes, I headed back to see what A was up to. He wasnt at the rock so I figured he went on a walk too.",
  "T+15:00: A comes back. Trip is over. We rejoice and feast on poor-version sopapillas (tortillas with honey).",
  "This drug is fucking amazing, but I think I'll save it for special occasions. I wouldn't use it recreationally anymore. And I wouldn't use this drug unless you have enough experience in losing your sanity. I want to do this drug while sitting on a beanbag outside."
 ],
 "erowid": {
  "id": "57618",
  "citation": " Kiffer. \"Fractals, Hexagons and Nothing: experience with 5-MeO-DMT (ID 57618)\". Erowid.org. Feb 12, 2007. erowid.org/exp/57618",
  "substance": "5-MeO-DMT",
  "views": "9966"
 }
}
