{
 "id": 9588,
 "title": "They Said It Was Non-Addictive",
 "date": {
  "submission": "2001-03-20T08:00:00.000Z",
  "experience": "2001-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Lucy",
  "gender": "Female",
  "weight": 68
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "mg",
    "quantity": "20",
    "grams": 0.02
   },
   "administration": "oral",
   "substance": "Paroxetine",
   "form": "pill/tablet"
  }
 ],
 "report": [
  "I was prescribed 20 mg per day.  My doctor told me that this medication was non-addictive.  Even when I described the physical and mental effects I was experiencing from withdrawl, she insisted that this was due only to the bodies struggle to rid itself of a chemical. If this is not addiction then what is? It soon became obvious to me that, after taking the pills for a month, the patient knows far more about them that the doctor and they are, in effect, on their own.",
  "Two weeks ago I took my last half-tablet after gradually reducing the amount I was taking. The side-effects I have experienced are as follows:",
  "1. Panic attacks far worse than I experienced before going onto the drug.",
  "2. disorientation and trouble keeping my balance.",
  "3. Involuntary crying and the feeling that I cannot cope with the slightest problem.",
  "4. Depression and sleeplessness.",
  "5. Stomach cramps and sickness.",
  "6. Dizziness when standing up.",
  "7. Tiredness and mood swings.",
  "I am posting this message because the withdrawl of this so-called non-addictive drug made me feel as though this was my 'normal' state I was returning to. As though this disorientation, that made me feel 'crazy' and out-of-touch with the world was how I was going to feel forever. But this is not the case as i am realising as the time since taking my last tablet increases. My father took Vallium in the sixties and was told at the time it was a non-addictive drug. This is now obviously not the case and I wonder if, in time, the same might be true of paroxetine. The withdrawl effects are severe enough to warrant further tests I'm sure."
 ],
 "erowid": {
  "id": "5763",
  "citation": " Lucy. \"They Said It Was Non-Addictive: experience with Paroxetine (Paxil) (ID 5763)\". Erowid.org. Mar 20, 2001. erowid.org/exp/5763",
  "substance": "Paroxetine (Paxil)",
  "views": "24474"
 }
}
