{
 "title": "Flashbacks and Conversations With Myself",
 "author": "Quail",
 "citation": " Quail. \"Flashbacks and Conversations With Myself: experience with LSD & 2C-B (ID 95945)\". Erowid.org. Apr 6, 2013. erowid.org/exp/95945",
 "substance": "LSD & 2C-B",
 "bodyweight": "108 lb",
 "header": [
  [
   "DOSE:",
   " ",
   "",
   "LSD",
   "",
   " ",
   "",
   "2C-B"
  ]
 ],
 "report": "<p>Warning: this report contains graphic imagery of sexual assault.</p><p>My previous experience with drugs has been varied, and when this experience had occurred I had used LSA, LSD, 2CB and mescaline and never had any kind of uncomfortable experience. LSD had given me a few useful insights, but nothing as difficult and life-changing as this one.</p><p>My mindset was generally good on the day, although I had recently begun therapy to address a sexual assault I experienced years ago, which had a huge impact on my mental health and my subsequent sexual experiences. It should really have occurred to me that perhaps this was a risky time to use psychedelics.</p><p>The setting for the trip was my boyfriend's room in his shared house, let's call him B. We were spending an evening together tripping and the plan was to take LSD and a bit of 2CB and listen to music, talk and enjoy each other's company.</p><p>The evening was fairly unremarkable in that I was having the same visuals I usually seem to experience (B took on a 'cobweby', 'Hallowe'eny' appearance and grew bat wings; he appeared to be smoking countless pipes, cigars and cigarettes; I kept hallucinating that I had spilled my drink, etc.) and having a wonderful time.</p><p>I can't say what it was exactly that cause my mindset to change, but I was curled over hugging a cushion and all of a sudden I felt torn apart by an emotional pain so powerful that I can't even begin to put it into words. I looked up and blood gushed from the walls and ceiling and I had what I can only describe as a flashback of my assault from the point of view of my vagina. I could vividly see the man who assaulted me kneeling over me and I felt that I was my vagina being penetrated and violated.</p><p>B quickly realised that something was happening to me, and began to try to talk to me. At this point B, the drugs (which I will refer to as Lucy) and I took on roles of different parts of my subconscious. B asked me questions about what was wrong, so I felt that he was the part of me that wanted to talk about the issue and try to resolve it. Lucy kept trying to distract me and 'trick' me out of talking with pretty patterns and irrelevant delusions, and I was scared of talking, wanting to say things but unable to communicate. We went in circles and I tried to 'trick' Lucy into believing that I said enough so that she would leave me alone and let me be, but I felt this urgency to communicate and kept repeating the phrase, 'I'm only tricking myself,' which I feel is very reflective of the way I deal with the mental health professionals who try to help me. I trick them into believing I am doing well, but it's me that suffers because my issues remain unresolved.</p><p>This went on for about an hour. At one point I believed that time had stopped and at another point I believed that days had past, that I had lost my mind and there were people waiting outside to take me away to a mental hospital (which actually felt like a relief at the time for some reason). One thing that I kept returning to was the deep ball of pain that ripped into every fiber of my body. I cried and moaned and felt the pain, the helplessness, powerlessness, fear of my assault and relived it again and again.</p><p>Feeling that pain was one of the most liberating things I have ever felt. As suddenly as the uncomfortable part of the trip had started, a wave of relief washed over me as though I had cast away a crushing burden.</p><p>I spent a little more time with B, and then we went to bed. After a few hours' sleep I awoke still seeing unusual colours and patterns, but feeling very emotionally fragile. The next day I awoke feeling better in myself and more positive than I have in a very long time.</p><p>Although at the time this trip was one of the most emotionally painful and draining experiences of my life, I don't call it a 'bad' trip. It was extremely uncomfortable, but it has helped me to confront issues that have been ruining my life for years. In the years since my assault, I had never once allowed myself to feel any pain at all. I believe that this experience has unlocked something in my memory and allowed me to truly begin to heal and recover.</p>",
 "year": "2012",
 "id": "95945",
 "gender": "Female",
 "age": "21",
 "timestamp": "2013-04-06T07:00:00.000Z",
 "views": "3173",
 "dose": [
  {
   "time": "DOSE:",
   "amount": " ",
   "administration": "",
   "substance": "LSD",
   "form": ""
  }
 ]
}
