{
 "title": "Best Hangover Ever",
 "author": "Lunch Box",
 "citation": " Lunch Box. \"Best Hangover Ever: experience with Nutmeg & Alcohol (ID 9596)\". Erowid.org. Jul 7, 2005. erowid.org/exp/9596",
 "substance": "Nutmeg & Alcohol",
 "bodyweight": "220 lb",
 "header": [
  "DOSE: T+ 0:00",
  "20 g",
  "oral",
  "Nutmeg",
  "(ground / crushed)",
  " T+ 3:00",
  "3 glasses",
  "oral",
  "Alcohol - Beer/Wine",
  "(liquid)",
  " T+ 4:00",
  "3 shots",
  "oral",
  "Alcohol - Hard",
  "(liquid)"
 ],
 "report": "<p>I was reading about nutmeg usage on the net, and said, 'hey, I have nutmeg' and so I ate about 20 grams or so of it. Probably a bit less. I didn't measure (stupid I know). Anyhoo, I ate it around 8 pm, and by 9 I was starting to feel the effects. Nothing fancy, just relaxed... real cool man. A friend called me up and offered me a ride to go to a bar, listen to some old tunes with his buddies.</p><p>So I walked a half hour walk, at about 9:45-10:00 to the University where he was gonna meet me. It was dark, and the way to the University is dark and through a trail in the forest. This is where I started to feel mild hallucinogenic effects. I had some decent trippin' music on my discman, Tool's 'Aenima' album, lots of texture. I heard alot more than I usually do. Alot of subtle reverb and echo effects made it through to me...guitar lines and stuff I haven't heard. The trees on the sides of the path were changing from black to grey then to a nice wintery white, which was strange but somehow comforting. I kept wondering if it was the nutmeg or the 'placebo' effect, but I'm sure now that it was the nutmeg's hallucinogenic effects kicking in. I was having a bit of trouble focusing on one spot while in motion. That's usually the sign for me, that I'm feelin' chemical effects.</p><p>So I made it to the university about 45 minutes early, at about 10:20 pm. I sat on the bleachers in the deserted track stadium. I bought a sprite because my mouth was damn dry, and I had forgotten my water. I ended up sitting there looking at the streetlamps across the way, amazed at the way the halo effect around the lights could dilute and expand and contract and dissolve and I tried to control it (don't remember if I could). I switched CD's to Jimi Hendrix, and listened to 'Are You Experienced?' again and again. An excellent song, again I heard stuff that probably wasn't there.</p><p>So eventually I was in my friends car, off to a scuzzy bar. I was completely coherent, probably overly so. I more clearly than I usually do. I didn't tell them I was on nutmeg, just didn't feel right. We got to the bar, and his friends made me buy a round as soon as I sat down. I was then introduced. We drank and sang along to the music, and I was pretty bored. I drank 3 beer, 1 rye & ginger, and then the guys wanted me to drink 4 shots of tequila. blech. I wasn't drunk enough for that, but I got through two. The second one almost made me hurl.</p><p>By 1:30 am, we were on are way home. I was feeling more drunk than anything else, the alcohol had seen the nutmeg in my system and said 'this is an alcohol town' and so the nutmeg took off to hide somewhere, until I pissed the alcohol away.</p><p>9:00 am class the next day. Woke up at 7:30 hung over, but it only lasted about an hour. I biked to school, and sat down for 2 1/2 hours of blah blah blah. I was a bit wobbly, nothing noticeable though. I was talkative, but had trouble reading. I had a significantly lowered attention span, even for me. I had a pretty good morning, I felt just kind of stoned... spaced out like. It was nice.</p><p>Effects wore off by about 6pm that night, except for being a tiny bit spaced out.</p><p>The only negative effects I experienced were suicidal thoughts while on the bleachers, about 2 1/2 hours in. This isn't anything new for me, as I suffer from clinical depression. Luckily I know how to control those urges, and they weren't much stronger than the urges I feel on a regular basis. Other drugs I've taken are worse. Acid brought me closer to the edge, granted I first took it was when I was more chemically inexperienced. Alcohol can also cause more problems for me than nutmeg did. I suppose its a bad idea to use any mind-altering drugs when depressed, so be careful. Consult your doctor (haha :).</p><p>Overall, it was a truly pleasurable experience, and I'll probably do it again.</p>",
 "year": "2001",
 "id": "9596",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2005-07-07T07:00:00.000Z",
 "views": "13182",
 "dose": {
  "0": {
   "time": "DOSE: T+ 0:00",
   "amount": "20 g",
   "administration": "oral",
   "substance": "Nutmeg",
   "form": "(ground / crushed)"
  },
  "1": {
   "time": " T+ 3:00",
   "amount": "3 glasses",
   "administration": "oral",
   "substance": "Alcohol - Beer/Wine",
   "form": "(liquid)"
  },
  "2": {
   "time": " T+ 4:00",
   "amount": "3 shots",
   "administration": "oral",
   "substance": "Alcohol - Hard",
   "form": "(liquid)"
  }
 }
}
