{
 "title": "A Cross Between Methylone and Meth",
 "author": "Ford",
 "citation": " Ford. \"A Cross Between Methylone and Meth: experience with bk-MBDB (ID 95989)\". Erowid.org. May 14, 2012. erowid.org/exp/95989",
 "substance": "bk-MBDB",
 "bodyweight": "270 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "200 mg",
   "",
   "bk-MBDB",
   "(powder / crystals)",
   " T+ 1:30",
   "150 mg",
   "",
   "bk-MBDB",
   "(powder / crystals)"
  ]
 ],
 "report": "<p>Well let me start by saying I am an experienced drug user. I've done it all marijuana, MDMA, MDA, cocaine, methamphetamine (former addict), ketamine, LSD, mushrooms, BZP and just about every other illicit substance excluding PCP. I am also an experienced user of research chemicals including Methylone, Mephedrone, PMA and many canabanoids. So with this said, I had an idea of what my Butylone experience would be like.</p><p>+0:00 - I start off with what I thought was a small dose, about 200 mg.</p><p>+0:15 - Start feeling the come-up, feel light an energetic. Music is sounding great just like with Methylone and MDMA.</p><p>+0:30 - Starting to peak, starting gloving in front of my mirror jamming out to Knife Party.</p><p>+1:00 - Still peaking, feel as if this substance has potential. Possibly would be fun to take at a rave or party. But I must add at this point I feel as if I had a pill that was one and a half parts methamphetamine to one part Methylone.</p><p>+1:30 - Thinking that I'm coming down (couldn't have been more wrong) so I bump another 150 mg.</p><p>+2:00 - Feel a slight come up.</p><p>+4:00 - Feeling come down gradually.</p><p>+5:30 - At this point I no longer feel good, I feel as if I have take an ecstasy pill that has been heavily cut with meth. The Methylone feeling high is no longer there. Just like with methamphetamine my teeth feel brittle like glass. It feels as if I were to bite something that my teeth would break.</p><p>+12:00 - Got absolutely no sleep, feeling dumb for taking such a high dose. I have taken at least 2000 ecstasy tablets, so I assumed this would have an effect on my tolerance. It didn't.</p><p>+16:00 - Finally come down, feeling a little irritable like with an MDMA comedown.</p><p>In conclusion, I would like to try this substance again at a lower dose. It was a really nice feeling. I mentioned that after the happy effect wears off that the substance felt just like meth, but the day after I took this substance I had no desire to hurry and do it again unlike with meth. So it suggests I'm unlikely to abuse it. I am not sure about the safety of this chemical though.</p>",
 "year": "2012",
 "id": "95989",
 "gender": "Female",
 "age": "18",
 "timestamp": "2012-05-14T07:00:00.000Z",
 "views": "4724"
}
