{
 "id": 96,
 "title": "More Than I Bargained For",
 "date": {
  "submission": "2013-09-20T07:00:00.000Z",
  "experience": "2013"
 },
 "author": {
  "name": "Allfordivinecommunio",
  "gender": "Male",
  "weight": "78 kg"
 },
 "dose": [
  {
   "time": "0",
   "amount": "1.2 mg",
   "administration": "sublingual",
   "substance": "25I-NBOMe"
  },
  {
   "time": " T+ 0:20",
   "amount": "1.2 mg",
   "administration": "sublingual",
   "substance": "25I-NBOMe"
  }
 ],
 "report": [
  "<p>2300 1200micrograms under tounge",
  "2320 1200micrograms under tongue",
  "0000 I'm out of my depth, my visual field is completely covered by repeated shapes. I look in my hand and droplets appear - a billion miracles forming.",
  "My voice is strange - echoing.",
  "I never expected this.",
  "Dreadful nausea - I'm frightened.",
  "0100 I float between feeling scared and joy. The nausea is passing. I lie on my bed and play my music.",
  "0200 My dark room fills now with gargoyles and the walls breathe.",
  "0230 Finally I find myself relaxing. The light that comes from behind begins to move forward and the gargoyles disappear.",
  "I seek out the light and as I look I see an intense light as people describe in Near Death Experiences. But it is first behind perspex. My path is clear.",
  "0300 Finally, fully joyful, the light - my communion with the divine - is fully visible and showers of beauty fall from it. I am an an 'atrium'. My audience with the divine light which lifts my spirits. All that is beautiful is a manifestation of the divine. And I am well stocked.",
  "Large polls hold this immense place - but the light is independent. Perhaps this drug is the way we may come to the divine.",
  "0400 Afterglow and much to say. Had I been cautious I would never have found such.</p>"
 ],
 "erowid": {
  "id": "100697",
  "citation": " Allfordivinecommunio. \"More Than I Bargained For: experience with 25I-NBOMe (ID 100697)\". Erowid.org. Sep 20, 2013. erowid.org/exp/100697",
  "substance": "25I-NBOMe",
  "views": "905"
 }
}
