{
 "id": 9604,
 "title": "Can Amph Tolerance be Reduced/Eliminated?",
 "date": {
  "submission": "2008-04-28T07:00:00.000Z",
  "experience": "2006"
 },
 "author": {
  "name": "Ubermensch",
  "gender": "Male",
  "weight": "165 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "40 mg",
   "administration": "oral",
   "substance": "Pharms - Fluoxetine",
   "form": "(daily)"
  },
  {
   "time": "0",
   "amount": "2 tsp",
   "administration": "oral",
   "substance": "DXM",
   "form": "(liquid)"
  },
  {
   "time": "0",
   "amount": "30 mg",
   "administration": "oral",
   "substance": "Amphetamines",
   "form": ""
  },
  {
   "time": "0",
   "amount": "2 tsp",
   "administration": "oral",
   "substance": "DXM",
   "form": "(liquid)"
  },
  {
   "time": "0",
   "amount": "30 mg",
   "administration": "oral",
   "substance": "Amphetamines",
   "form": ""
  }
 ],
 "report": [
  "I've been using Delsym (dextromethorphan polistirex, DXM, a sustained-release preparation of DXM) to prevent amphetamine-tolerance as long as I've been taking them. So that would be about 8-9 months of use without breaks, and the proof is in the pudding. :-)",
  "I haven't developed any tolerance whatsoever to any of the drug's effects. The dose started at 30mg/day (of the XR formulation), but an extra 30mg capsule later in the day was added onto that after a few weeks because they seemed to wear off too quickly for me. I stayed on that until a couple months ago when I switched to the immediate-release formulation, which I find lasts about eight hours per dose (quite surprisingly!), with a come-up beginning at approximately T+0:15 hours post-dose, a pronounced effect at T+1:00 pursuant, the peak at T+2:00 through T+7:00, followed by a gentle comedown which ends about T+9:00. The only difference I find between the IR and XR formulations of the drug is actually that the IR form lacks the mid-dose sluggishness and consequent 'second-wind'. So one dose at 6AM *really* kicks in at 8AM, beginning to wear off at 1PM, taking the second dose at noon times everything just perfectly. If I'm planning on making rounds of the bars with friends at night or practicing/playing a gig with my band, I just pop an extra 30mg in the early evening as needed.",
  "But back to the Delsym -- I used to take a full teaspoon of the 12-hour suspension twice daily (that's equivalent to 15mg Robitussin Maximum Strength Cough every six hours). This dose completely prevented any development of tolerance and *may* have even allayed some of the nastier stim side effects by antagonizing some excitatory neurotransmission via glutamate et al. For six weeks now though I've been taking Prozac at 40mg daily, which (along with its ultra-long-half-life metabolite, norfluoxetine) is among the most potent inhibitors of cytochrome P450 IID6 (aka debrisoquine 4-hydroxylase), along with quinidine and paroxetine. CYPIID6 is responsible for the metabolism via O-demethylation (removal of the methyl group at the sixth position in the structure) of dextromethorphan, which primarily acts upon PCP2 and sigma receptors, to the potent NMDA antagonist dextrorphan (DXO, the dextroratory form of the opioid levorphan, which is about equipotent to morphine). Thus I now take twice as much Delsym to ensure a more normal ratio of DXM to DXO in the blood. My doctor and all research I've done has assured me that this is perfectly safe (i.e. not nearly a dose sufficient to cause Olney's lesions, etc.).",
  "I would use another NMDA antagonist like Emenda (memantine HCl) if it were available to me, even if simply to avoid the simple carbohydrates in the syrup, but Medicaid will only cover three prescriptions monthly now that I've turned 21."
 ],
 "erowid": {
  "id": "57714",
  "citation": " Ubermensch. \"Can Amph Tolerance be Reduced/Eliminated?: experience with DXM Polistirex (Delsym) & Amphetamines (Dexedrine) (ID 57714)\". Erowid.org. Apr 28, 2008. erowid.org/exp/57714",
  "substance": "DXM Polistirex (Delsym) & Amphetamines (Dexedrine)",
  "views": "15054"
 }
}
