{
 "title": "Where the Hell Is My Mouth?",
 "author": "Phil",
 "citation": " Phil. \"Where the Hell Is My Mouth?: experience with Cannabis & 25I-NBOMe (ID 96091)\". Erowid.org. Sep 21, 2013. erowid.org/exp/96091",
 "substance": "Cannabis & 25I-NBOMe",
 "bodyweight": "140 lb",
 "report": "<p>I am writing this report mainly as a warning. Do not combine these substances unless after the NBOMe has worn off.</p><p>So one day, a friend of mine asked if I wanted some fake acid. I said sure and asked him what chemical it was. He told me it was NBOMe and I would later learn it was 25-i NBOMe. It was free, so why the hell not?</p><p>That Friday I went to another friend's house and was very excited to try the NBOMe. Overall it was a fantastic experience, but this report will focus on the difficult part.</p><p>T+5:00: At this point the NBOMe was still working, but not very powerfully. So the plan was for me and my friend to smoke a bowl or two of very fine Cannabis then go watch The Blob in his room. We end up doing two bowls then we head inside and start the movie.</p><p>T+5:30: I was hoping the cannabis would simply bring back some of the effects of the NBOMe, much as it does with LSD. Until now I felt absolutely no difference from before we had smoked. At this point the movie had just started and I began to notice colors emanating from the TV screen. At first they were subtle, but soon turned into opaque blocks flying out from the TV screen, almost obscuring my vision. 'Holy shit!' I thought, I was tripping really hard.</p><p>T+6:00ish: Holy shit this is nuts. I pretty much lost track of time, but this occurred between nine and ten PM. At this point I had a glowing body high and was still enjoying myself. The Blob had me enthralled, and I was not sure if they were speaking English. The trip was a little menacing at this point because I had to go home in about two hours, which scared the hell out of me. I began worrying if I would still be this high then, if I could hold my shit in front of my parents mainly. This was the beginning of the troubles.</p><p>T+I don't know: Shortly after realizing I was too high to go home, I began having the scariest feeling I have ever had to this day. My jaw muscles were very tense at this point and I had been opening and closing my mouth earlier to alleviate this. I tried to open my mouth to exercise the muscles, but my mouth remained closed. I pressed my tongue against the inside of my lips, but my tongue could not push through. 'Oh God no what is happening?' I thought to myself as I reached for my mouth with my hands. As soon as my hands touched my mouth, however, the feeling completely subsided. Oh holy shit that was scary, I get nervous just thinking about it. This feeling lasted for about 1 more hour then I slowly dropped back to a tolerable level of tripping. I went home and got some sleep and felt great the next day.</p><p>Basically, all I'm trying to say is be careful combining these substances. Plus, the NBOMe heavily inhibited my reasoning, so the above scenario of, 'losing my mouth' repeated itself constantly throughout the night. This combined with the view obscuring visuals made the experience very scary. Be Careful, friends.</p>",
 "year": "2010",
 "id": "96091",
 "gender": "Male",
 "age": "16",
 "timestamp": "2013-09-21T07:00:00.000Z",
 "views": "669",
 "dose": {
  "0": {
   "time": "DOSE: T+ 0:00",
   "amount": " ",
   "administration": "",
   "substance": "25I-NBOMe"
  },
  "1": {
   "time": " T+ 5:00",
   "amount": "1 bowl",
   "administration": "smoked",
   "substance": "Cannabis"
  }
 }
}
