{
 "title": "A Tale of Two",
 "author": "Psychedelic CiD",
 "citation": " Psychedelic CiD. \"A Tale of Two: experience with Morning Glory Seeds (ID 961)\". Erowid.org. Jan 24, 2001. erowid.org/exp/961",
 "substance": "Morning Glory Seeds",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   "5.5 g",
   "oral",
   "Morning Glory",
   "(ground / crushed)"
  ]
 ],
 "report": "<p>It was a slow night and my friend B and I had been sitting around his house all day.  Our plans were to walk up to the local coffee shop and pick up a 20 sack of grass from our dude.  We were planning on staying straight all night and smoking all the grass the next day, but I had decided to trip on heavenly blue MG seeds that I had bought and ground up two weeks prior.</p><p>Well, as I proceeded to leave B's house and retrieve the seeds, he yelled, 'Yeah man, I might as well do 'em, too.' This struck me as weird since he wouldn't touch anything besides weed - no X, no mushrooms, definitely no acid, and here he wanted to trip off a substance that is closely related to LSD?  I quickly passed the thought in my mind and agreed.</p><p>Upon my return, we poured the powdered seed solution into a bowl and mixed about 2 grams of MG with about 6 ounces of ginger ale, making 5 and a half little cups of black-like ginger ale.  We each downed two cups and took turns taking gulps from the last cup.</p><p>The ginger ale masked the taste of the MG completely.  The only thing noticable about the MG was how grainy the ginger ale was.</p><p>We sat around and talked for about 20 minutes.  I explained to B, who wasn't an experienced tripper, to open his mind to change and believe the MG was going to take effect.  He agreed.  About 30 minutes after ingestion he complained of slight nausea, while I felt none whatsoever.</p><p>Along with this nausea, however, was a slight feeling of an alcohol buzz without the disentoriation.  We were very talkative.</p><p>To ease B's nausea, I fetched a bottle of coca syrup, gave him a teaspoon, threw it in my backpack, then we proceeded to walk up to the local coffee shop to see our dude.</p><p>During the walk, B and I both agreed that we were seeing mild trails.  B was also feeling pretty heavy nausea, but did his best to ignore the feeling.  My state of mind stayed in the present, whereas B's took off.  When we reached the coffee shop (about one mile, a twenty minute walk), we bought a twenty and went to go smoke a bowl in a nearby alley.</p><p>The grass had blown me away - it was obviously great shit.  So, after about ten minutes of being stoned - the trip started to kick in hardcore.  I couldn't walk straight, my eyes were dilated to the point where my eye color was not clear, objects would morph into other objects, heavy trails were being observed, and if I observed anything in motion, especially cars, I would fall into a trance and follow them with my head and eyes.</p><p>As it turned out, B was feeling the same exact thing.  So we decied to walk to our friend's house.  It had been about an hour since the seeds were ingested and we both were tripping like we had taken two hits of acid apiece.</p><p>So, as we proceeded to walk on, I enjoyed the surroundings and felt a sense of well-being and placement.  I also felt a weird universe thing.  I was in my own universe and B in his.  However, when I 'channeled' into his, I saw he was having a horrible trip.  He was slipping in and out of personalities.  Every once in a while he'd come back and say, CID! I don't have much time before they will come back...please.... And that is as far as he ever got.  He would then start rambling about feelings (??).  These experiences he was going through also disoriented his time preception to the point of insanity.  He couldn't determine whether we had left the coffee shop ten minutes ago or yesterday.  He also thought we had tripped the week before, and we were just insane.  This really freaked me out, because I started to slip into his 'universe.' </p><p>We were walking to my friend's house using side streets - this also proved to be disturbing to B.  He would see intersections and think he was somewhere else.  Then he would think he was another age - younger most of the time.  Following that, he started talking to someone next to him.  So the majority of my trip was spent trying to keep him calm.  But I felt myself not helping, just walking and laughing hysterically at him.</p><p>As we approached my friend's house, B came close to my face and told me, 'Cid, what the hell is wrong with you?  I am totally sober, you have been acting really weird lately.'  Then he proceeded to explain EVERYTHING he was doing and told me I was doing it.  This blew my trip away.  I felt a real identity crisis.  I felt as if I could float into him and myself at the same time.  However, I knew how to keep this as a good trip, and I made the best of it.</p><p>We eventually reached my friend's house about a half hour after we left the coffee shop.  We spent the remainder of our time coming down at her house.  B was talked down by a close friend of mine while I sat in the corner and tweaked out.  I was seeing sides of things that I have never seen before in the conscious world.  Complete empathy was felt for everything.</p><p>B and I proceeded to go home about 2 hours after going to my friend's house.  He was still tripping hard, and so was I, but we both could enter and leave the normal world at will.</p><p>When B went home, he performed many 'rituals' that he found very weird the next morning.  He explained to me that he took off all his clothes, took a screw driver and gently rubbed it over himself for about a half hour.  He also thought he taped four movies off of Cinemax, but when we watched the tape it was all fuzzy.</p><p>When I went home, I smoked a small bud, turned off my lights and laid back in my room.  I saw mild visuals and felt like I was floating.  I constantly still saw 'other sides' of things and proceeded to philosophize about things.  I also noted a very 'deep' feeling.  I could make deep connections with things and people.  As it turned out, this feeling lasted about 24 hours.</p><p>I went to bed about 8 hours after I had ingested the MG seeds and I was still on a level plateau of tripping, however, it was pretty mild.  I woke up in the exact same state the next day,  went and got B, discussed the trip, and proceeded to smoke all the weed we got the night prior all day long.</p><p>Side effects of the MG seeds included: mild trails (24-36 hours), being spaced out (48 hours), and very mild visuals (24 hours).  However, many of these side affects may have lasted for the duration they did due to all of the grass B and I smoked the day after the trip.</p><p>All in all, the MG experience was much like acid, except a little milder as far as visuals, but just as intense mentally.  A dose beyond 7 or 8 grams of MG seeds, NOT PURE LSA, will make any human person throw up their guts.   I suggest taking no more than 6 grams for the people with the STRONGEST of stomachs.  Six grams is plenty to make you trip like your falling into insanity.  The trip was very pleasant and I will definitely try it again.</p>",
 "year": "2000",
 "id": "961",
 "gender": "Not Specified",
 "age": "Not Given",
 "timestamp": "2001-01-24T08:00:00.000Z",
 "views": "8969"
}
