{
 "id": 9611,
 "title": "Walking the Streets with a Demon in My Head",
 "date": {
  "submission": "2006-11-30T08:00:00.000Z",
  "experience": "2005"
 },
 "author": {
  "name": "Hayla",
  "gender": "Female",
  "weight": 48
 },
 "dose": [
  {
   "time": "0",
   "administration": "oral",
   "substance": "2C-P",
   "form": "(powder / crystals)"
  }
 ],
 "report": [
  "THE EFFECTS:",
  "I begin to ramble and talking is very exciting...  Everything I say is a punchline to a joke that everyone should get but they don't.  And if I take it with someone else... we both laugh a lot because I think the other person knows exactly what I am thinking.... I find myself narrating everything in my head and saying outloud 'DID I SAY THAT?? OR JUST THINK IT?'  Visuals get strong and I might see auras around people...  I'll find myself questioning everything I ever thought.",
  "THE EXPERIENCES:",
  "It's been more than a year since I have touched 2c-p...  I've done it twice, the first time I thought I was in love with it... everything felt heartbreakingly real, It was like living a vivid dream, and I felt very close to the friend I was with.",
  "The second time I took 2c-p was a nightmare.",
  "We took it around 9 o clock pm. Me and my friends B and J had just left a very boring birthday party and decided to take some and go to B's dorm, hang out and enjoy the visuals.  My friend B had never taken it before, had just started smoking weed... she was mostly against drugs.  My friend J and I had done it before...",
  "So we get tired of the dorm... B gets paranoid and kicks us out for 'talking too loud'  (we were whispering)  At first time went slowly.  and then hours went by and I found myself outside in the city, lost with my friend J.  Now all I can remember is a slide show of night people, cops, and me completely vulnerable.  Around 5 am my friend B lets us back in her dorm room briefly and kicks us out again. me and my friend J ended up trying to walk home... getting in a horrible fight in a grave yard unable to make it home.",
  "When I take too much 2c-p their personality becomes intensified.  I wanted to stay inside the dorm... where I felt safe, I didn't want to deal with anyone but my friends. My friend B wanted us to be completely quite... which is impossible when I am on 2c-p.  My friend J wanted to be out in the nightlife..  I wanted to die and kept telling people that I had just met."
 ],
 "erowid": {
  "id": "57737",
  "citation": " Hayla. \"Walking the Streets with a Demon in My Head: experience with 2C-P (ID 57737)\". Erowid.org. Nov 30, 2006. erowid.org/exp/57737",
  "substance": "2C-P",
  "views": "8499"
 }
}
