{
 "id": 9620,
 "title": "Complete Mutiny (Literally)",
 "date": {
  "submission": "2002-02-04T08:00:00.000Z",
  "experience": "1999-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Mike Rakhabit",
  "gender": "Male",
  "weight": 61
 },
 "dose": [
  {
   "time": "0",
   "amount": "800 mg",
   "administration": "oral",
   "substance": "Pharms - Cyclizine",
   "form": "pill / tablet"
  }
 ],
 "report": [
  "I have never really been a big fan of marijuana or alcohol (definitely a user, just not a big fan). I'm more into the instant gratification type of drugs, ie. MDMA, LSD, pain killers. I don't have to worry about smoking or filling my stomach with liquids I'm gonna puke up anyway.",
  "A friend told me about Marezine, and I was instantly intrigued by some of the stories he had witnessed and heard about. I mean, a drug that basically shuts off your waking mind and keeps your body and dream state wide awake? Christ, where do I sign up?",
  "Well, it's somewhat hard to find 'good' OTC drugs these days, especially in Washington, so I ordered two boxes of Marezine from an online pharmacy for four bucks a pop plus shipping.",
  "(I'm not going to go into detail about the effects, because it's pretty much like Dramamine and that's been pretty well documented here already).",
  "I ate by myself because I am a big fan of frying by myself, but that had to have been my first mistake in a long night of many mistakes. I ate around 8PM and it only took an hour or so before I started feeling anything. There was about 15 minutes of lightness and mild euphoria before everything snapped and I started tripping balls.",
  "I don't really remember much else too vividly, except for some great conversations with some really nice people who weren't there, and what was written in the police report . . .",
  "After everything kicked in, I felt like experiencing the outdoors, so I made my way down to the Seattle waterfront and got (God knows how) onto the Seattle/Bremerton ferry at around 10:30. I sat down, talked to a few people and then got really mad at the direction the boat was going in.",
  "I remember telling my 'friends' to go do something about it, but they had the nerve to disappear, so I stumbled around the boat until I found the bridge and proceeded to tell each and every person up there (imaginary and real) to 'turn the boat around because we're going in an illegal direction.' I really think it was the back and forth screaming of 'This is my boat,' 'No, this is MY boat!' that lead them to believe something was up with me though.",
  "Next thing I know, I'm in what seems to be the broom closet courtesy of three huge men. I honestly don't remember much after that until the next morning, but it's my understanding that I was screaming 'mutiny' at the top of my lungs for about 20 minutes straight while I was in there.",
  "After a fun day in jail and receiving a lot of shit from my friends, I'd still say it would be worth doing again. I would definitely require of myself a babysitter, and perhaps a lower dosage so periods of the trip aren't so faint, but I can only imagine I was having some fun that night. I probably won't be doing this too often though."
 ],
 "erowid": {
  "id": "5776",
  "citation": " Mike Rakhabit. \"Complete Mutiny (Literally): experience with Cyclizine (Marezine) (ID 5776)\". Erowid.org. Feb 4, 2002. erowid.org/exp/5776",
  "substance": "Cyclizine (Marezine)",
  "views": "16155"
 }
}
