{
 "title": "One Became Infinity and Infinity Became One",
 "author": "Knight",
 "citation": " Knight. \"One Became Infinity and Infinity Became One: experience with 25I-NBOMe & MDMA (ID 96220)\". Erowid.org. Jun 14, 2012. erowid.org/exp/96220",
 "substance": "25I-NBOMe & MDMA",
 "bodyweight": "170 lb",
 "report": "<p>I have tried 25i and MDMA on several occasions. My threshold dose for 25i is 1.5 mg and at that dose I start seeing breathing walls, colors are enhanced and music becomes wonderful and if I close my eyes while listening to music, I can create my own world, not CEV but my imagination runs wild. MDMA causes well, MDMA like effects. Everything is nice, I love everybody and life can't get any better.</p><p>The trip:</p><p>It's 5.00 am on Thursday and me and the wife aren't able to sleep. So I suggest that we do 25i and MDMA. She agrees to babysit me because I wanted to take 25i+MDMA. I had eaten a fatty meal a few hours before that would come to haunt me later.</p><p>5.30 am - I take 2 1000ug tabs of 25i sublingually.</p><p>6.00 am - I chew them and swallow them.</p><p>6.10 am - It hits. Everything becomes CLEAR. I tell my wife to put on music. (She has taken MDMA and is next to me cuddling). She puts on my playlist and I notice that I can't tell time. By that I mean concept of time is foreign to me. I can't tell if it's been 1 min or 1 hour or 1 day. I convey this to my wife and she says not to worry and enjoy it. By this time I am ++/+++. I just close my eyes and listen to the music and my imagination is running wild in my head.</p><p>6:48 am - I ask my wife the time and tell her to give me MDMA. I take about 200 mg and back to listening to music.</p><p>God Knows When - MDMA hits and by hits I mean if beer is walking, weed is a bicycle, 25i a sports car, then MDMA+25i is four space shuttles strapped to your ass and being launched into space.</p><p>Some time later - I start throwing up probably because of the fatty meal I had eaten and the bitter taste of powdered MDMA.</p><p>Some time later - I had to use the bathroom. I was dearly hanging on because I felt like all my sphincters would relax and I would create a bloody mess. I use the bathroom. Walls are closing on me. I start getting claustrophobic. I put on some clothes and ask my wife to take me outside for a walk. We walk a few feet outside and it hits again and I am TORN FROM REALITY AND TIME. I don't know who I am, what I am, what to do and I rush for the safety of the house.</p><p>Once inside, the walls start closing on me again and I rush outside. Outside everything is tooooooooooooooo fast. My wife is talking to me but her voice sounds like the voice we hear in video games when your character is coming out of sleep or serious injury. It's all echoey and has a reverb to it.</p><p>I decide to sit in the doorway and it keeps hitting in waves. TIME SLOOOOOOOOOOOOOWS DOWN. I start counting in my head - One thousand and one. In that one second, I have lived billions and trillions of years worth of thoughts in my head and just as my thoughts are ending, I can hear myself end the one thousand and one count. One has become infinity and infinity has become one to me. I start panicking because if one second is this long and the trip lasts for 8 hours, I am fucked!!!</p><p>I tell my wife to count because maybe I am not counting right and even with her counting it's the same to me. One is infinity and infinity is one to me. I start freaking out. Some sanity still prevails in me and I try to calm myself down. I tell myself that I have taken a drug and it will end. It will wear off. I ask my wife to talk to me about all the things I like. She talks to me about the things I like and the first time we met and it helps a little bit and the waves become more bearable but still scary.</p><p>I realize that I need something to calm my anxiety. I tell my wife to give me 10 mg of diazepam and 15 mins later all the anxiety is gone. I enjoy the waves hitting me. Scary but now I know what to expect. I come inside and ask my wife to put on some cartoon movies. We watch Shrek Forever and the drugs seem to be wearing off.</p><p>I look at the time and it's 9.30 am. It's been only 3.5 hours since I started. I take some marijuana to cut the speedy feeling that MDMA and 25i seems to give me. I hate feeling buzzed. I still can't understand the concept of time. What is 1 second, 1 min or 1 hour? I can't estimate how long it has been!!</p><p>Marijuana helps and I fall asleep waking up occasionally. I drink a bottle of electrolyte and take some more marijuana and fall asleep again. Still can't tell time!!</p><p>Wake up at 8.00 pm because we had a birthday party to attend. Still can't tell time!! We stay long enough for cake and snacks and return home.</p><p>I take more marijuana and fall asleep. Wake up 5.00 pm today and everything seems to be fairly normal. I can estimate time and the depression that I seemed to have after the trip yesterday has gone away.</p><p>Insights -</p><p>Those were the longest 3.5 hours of life. Every second was infinity so I lived 3 and a half hours worth of infinity. So many thoughts racing in my head while I was lost as to who I was. That was just the mind. The body feeling was soooooooo intense that one point of time I swore to God and Satan and everything else that I would never, ever touch drugs again.</p><p>Some may call this a bad trip but sometimes we learn from the bad things in life. I realized that I freaked out yesterday because all the facades that we put up for the world were torn away and my real self was exposed which I had never taken time to cultivate. Hence, I felt lost. I didn't know who I was because I had never taken time to cultivate the real Knight. I guess I have to stop living according to other peoples standards and spend more time growing the REAL ME.</p><p>Also, always have a babysitter if you are going to try anything new especially a psychedelic.</p>",
 "year": "2012",
 "id": "96220",
 "gender": "Male",
 "age": "27",
 "timestamp": "2012-06-14T07:00:00.000Z",
 "views": "9726",
 "dose": [
  {
   "time": "0",
   "amount": "2 ",
   "administration": "sublingual",
   "substance": "2C-I-NBOMe",
   "form": "(blotter / tab)"
  },
  {
   "time": " T+ 1:18",
   "amount": "200 mg",
   "administration": "oral",
   "substance": "MDMA",
   "form": "(powder / crystals)"
  },
  {
   "time": " T+ 0:00",
   "amount": "10 mg",
   "administration": "oral",
   "substance": "Pharms - Diazepam",
   "form": "(pill / tablet)"
  },
  {
   "time": " T+ 0:00",
   "administration": "",
   "substance": "Cannabis",
   "form": ""
  }
 ]
}
