{
 "id": 9629,
 "title": "Maintenance",
 "date": {
  "submission": "2007-10-18T07:00:00.000Z",
  "experience": "2006-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "kiz",
  "gender": "Male",
  "weight": 64
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "mg",
    "quantity": "4.0"
   },
   "administration": "sublingual",
   "substance": "Buprenorphine",
   "form": "pill/tablet"
  }
 ],
 "report": [
  "I have been addicted to opiates since around 2003.  It started out, like most opiate addictions, with eating vicodin and percocet.  For about two years my tolerance remained almost nill and I could even eat only 5mg of hydrocodone and be high.  However, with time and increased frequency of use, my tolerance sky rocketed.  I started using OxyContin, dilaudid, and methadone.  In January of '06, tired of the sickness and infrequency of availability, I started on methadone.",
  "The methadone clinic was a horrible place.  At my clinic there is no requirement for twelve-step meetings or any counseling.  I was given drug tests but when I tested positive for opiates or other substances they didn't do anything about it.  The intake process was as follows: I went into the clinic at around 5:30am after making an appointment with the doctor about two days previous.  I went in sick from withdrawal.  The doctor examined me and determined that I was in withdrawal and they proceeded to dose me with 30mg of liquid methadone, which did little to abate my sickness.  Then they took a psycho-social evaluation and my use history, as well as introduced me to my 'counselor.'  Then they took my $50 initial fee and sent me on my way.  I was on methadone for about seven months.  In that time I was also abusing other drugs and had no real desire to get 'clean,' I just didn't want to be opiate dependent anymore.  It made me lethargic and somewhat depressed.",
  "After finally going to an in-patient facility for twenty-eight days I kicked methadone (which is a bitch!) and got totally clean.  About three months after leaving the facility I was put on Suboxone for my cravings.  This did more for me in two weeks than all seven months I was on methadone.  Suboxone isn't an average opiate.  First of all, there is no 'rush.'  Even on methadone, at least for a while, I get a high after I take my dose.  Suboxone was way more mellow.",
  "I usually take my first dose (2mg, sublingual) at about 6am.  It takes about an hour to an hour and a half for me to notice it coming on.  It's more of a stoned feeling than anything else, not the speedy high I get from OxyContin/Methadone.  The first thing I noticed is a relaxation of my muscles.",
  "From there it takes about 2-3 hours for the full effects to hit me.  Once it sets in, I experience a lift in my mood.  I usually eat breakfast once the initial dose takes effect.  Cigarettes start sounding more appealing and my desire to use opiates is nullified.  A lot of the effects are similar to normal opiates.  I usually get kinda itchy and hot, as well as a little woozy.  About four hours after dosing the full effects are reached and I'm able to go about my day normal and happy.  For the first few days I got headaches and insomnia, two normal side effects of Suboxone.",
  "Since being prescribed, I have been clean.  I have no desire to do any drugs and have been going to counseling and AA/NA meetings.  It has done wonders for me, completely eliminating any opiate cravings I used to get.  It seems to have little to no recreational value, but is a very useful tool for addiction recovery."
 ],
 "erowid": {
  "id": "57793",
  "citation": " kiz. \"Maintenance: experience with Buprenorphine with Naloxone (ID 57793)\". Erowid.org. Oct 18, 2007. erowid.org/exp/57793",
  "substance": "Buprenorphine with Naloxone",
  "views": "8676"
 }
}
