{
 "title": "Touched by an Angel",
 "author": "RabbitHabit",
 "citation": " RabbitHabit. \"Touched by an Angel: experience with Ecstasy (ID 963)\". Erowid.org. Dec 12, 2000. erowid.org/exp/963",
 "substance": "Ecstasy",
 "bodyweight": "130 lb",
 "report": [
  "<p>Never in my life have I dreamed about trying 'X.'  As a matter of fact, i didn't even know what that was, until one unforgettable night.  Growing up in Europe in a totally drug free country, where drugs were a sin, i was always interested in those poeple who did it, but i knew it was just wrong for me to do it, up until i came to the USA.  Maybe after a year in the USA i started smoking weed, which was all right but not what was i looking for.  Just when i turned 16 i went with my best friend and her boyfrind and his friend to some rave clubs.  I've seen them inhaling vicks but i just thought they were sick.  I've seen people massaging all over the place and then it became unclear to me what was going on.  On the way from the club their pupils were dilated, and as i mentioned, i didn't know much so i was still confused.",
  "Now after all that confusion my time came.  As soon as we came home, the guy friend went to the room and asked me if i wanna take 'X.'  Not thinking twice about it, i swallowed the thing up.  Before actually getting the vibe of 'X,' i started asking many questions, realizing that i had put something in my mouth that i didn't know anything about.  They just told me simply wait.  After about 30 min...BIG BOOOOOOOOMMMMMMM happend in my head.  It felt like these gods hands were taking me over, lifting me higher, taking me to some other dimension...taking me to PLUR - peace, love, unity, respect.  I was constantly smiling.  I even started crying about how happy i was and kept on saying this is AMAZING...i was in heaven.  Then the friend came and asked me if i wanted an airplane ride.  Not knowing what that was, i accepted....  The BLOWING up moment came, i was GONE in heaven.  I was in this awsome place called earth where everything was PERFECT.  That sense of perfection and happiness was awsome, it couldn't stop.  It was like I put all my problems aside and just live it out.  It was something i honestly needed after having so many problems at home.  LOVE was endless...it was something i will NEVER forget.....and i will always ask myself why it can't be like this every day.",
  "I didn't wanna do it that much because i honestly liked it to much.  I usually do it once in 2 months and i've been able to maintain my tolerance.  Make sure you dance while you're on it and also drink plenty of water.  Just don't dance too much so your body doesn't get overheated.  The reason i am saying this is the day after taking 'X' you get this 'eaten up' feeling and if you sweat it out you don't feel mushy like that.  Also, drink a lot of o.j. or take vitamin c.</p>"
 ],
 "year": "2000",
 "id": "963",
 "views": "7237",
 "dose": [
  {
   "time": "0",
   "amount": "2 tablets",
   "administration": "oral",
   "substance": "MDMA",
   "form": "(pill / tablet)"
  }
 ],
 "submissionDate": "2000-12-12T08:00:00.000Z"
}
