{
 "title": "Scratching the Surface of Reality",
 "author": "Clement Gaston",
 "citation": " Clement Gaston. \"Scratching the Surface of Reality: experience with Salvia Divinorum (ID 96334)\". Erowid.org. Nov 9, 2012. erowid.org/exp/96334",
 "substance": "Salvia Divinorum",
 "bodyweight": "61 kg",
 "report": "<p>I ordered 20 grams of dried salvia leaves couple weeks back.</p><p>So one morning I decided to try it out. Then took a leaf and chucked it in my little pipe (not a bong). I took a few hits and yes its a harsh heat on the longs but it wasn't uncomfortable either.</p><p>The first moments I thought I felt something but then it quickly went as it came.</p><p>Very slight visual distortations like the lines where walls and ceiling meet started to vibrate.</p><p>The leaf seemed to be burned completely so decided to put another leaf in.</p><p>This time the feeling was very similar to the first one but I didn't reached a point of drastic changes.</p><p>I was thinking to maybe buy extract because I smoke reefer every day and I thought smoking salvia leaves wouldn't get me past the treshold.</p><p>I then opened the can with leaves and I took another leaf and crushed the leaf off the twig and pressed it in the pipe. I then took some more not even counting how much I took as long as the pipe was filled completely.</p><p>The Lift off:</p><p>Lighted up and felt a tingle and needles sensation over my upper body then suddenly jolting into my feet.</p><p>I stutterd something and threw myself on the couch uncontrolled (I was sitting on a chair first). My mouth kinda went jelly when I tried to say something. My vision started to melt and unfold like a 3d cube, it sides fell down to 2d vision. My whole vision tilted about 45 counterclockwise.</p><p>The sense of self was completely gone. Any attachment to the ego was not existent.</p><p>Everything got molded into one colorfull plastic paint like texture dripping down like raindrops on a window.</p><p>I closed my eyes and I saw all kinds of colors and patterns going really fast.</p><p>A very flesh and blood/organic tone to it.</p><p>I had the feeling I was being dissolved inside out.</p><p>My vision returned to normal for a few seconds.</p><p>I then said: 'I know what this does, I know what this does'.</p><p>Suddenly my body stood up and it spoke 'I know what this does' again and took the pipe</p><p>And went to the kitchen and started to clean the pipe. (Not sure why I did that).</p><p>It felt like my body was being moved by something else and had no conscious recollection</p><p>Of deciding to stand up and walk around.</p><p>I was a little freaked out cause I didnt expect this drastic change in vision.</p><p>It seemed my mind wanted to go elsewhere instead of in my head.</p><p>I didn't had time to be afraid or put any emotions to it, it all went so fast.</p><p>Stripped down from everything that connected me to to normal reality and the body.</p><p>My body sat down just outside the back door viewing the garden.</p><p>Then again my vision collapsed just like it did before. Oscillating back and forth to this reality and the other one wherever it was.</p><p>I tried to connect to something that was in my house without any luck.</p><p>I gave myself over to the oscillating waves and no longer wanted to hold on to anything. Waves of energy went through my mind. Very hard to describe what I felt or saw.</p><p>I started counting : 1, 2, 3 and then suddenly everything returned back to normal.</p><p>A little shook up by the intensity of the event I stood up and laughed (without the facial expression) a little while thinking wtf was that!. Took me about 40 min to totally come to my senses. I felt stunned, altered, the feeling of something went wrong and I had to return.</p><p>The Aftermath:</p><p>Do I call it a breakthrough? It feels more like an initiation into the technical side of the experience. How my body reacts and what happens to my vision. The behaviour of thought patterns. A milestone has been set for future explorations. I know the process to the other side now and how it feels getting there. Fully prepared one can never be with this, it all depends on the inner mind settings and the intention.</p><p>I've been thinking and wondering about it for a week about what exactly happened and trying to recall every second. Hightened awareness is the overal tone. Re-evalution of myself is needed. I noticed I became more humble in this earth reality. But not quite fitting in, this really is a projected illusion we play in. Once you know the rules the game is up. No one can diverge you from the exit any longer. The moment I realise this body is just a vehicle to navigate on this plane makes me feel weird. The realisation that my consciousness is temporary locked into it scares me sometimes. The ability to move out has always been a great desire. Salvia is a tool for this. Who am I? Where am I? What do I do here? Humanity's oldest and most profound unanswered questions. This tool engages you in a search inside yourself and calls you to return to your true place of home. Persuiting dreams, isn't that what we all do? I know what my dream is, it's waking up from this dream.</p><p>I feel my personality has shifted and reshaped. The self seems less important now. Charateristics iv'e had trouble with seem to be dissolved. A certain level of compassion gained, even more introvert as I already was before. A decrease of interest in external impulse and desire to interact with this level. A normal reaction I think once you tapped into higher frequencies. It still feels I'm unzipping information from this. I also strongly feel a calling to come back to the Salvia reality. For those who attempt it for the first time, I can only say: don't try to hang on, just let go. It will be much easier that way.</p><p>About dosing to have the desired experience I only can say learn to walk before you run</p><p>Because eventually you will fall on your face when you decide to run. It's hard to meassure the amount of Salvinorin Alpha in a single leaf. I do not have any desire to try extracts just because I'm highly sensitive to this. Handle with respect at any times.</p>",
 "year": "2012",
 "id": "96334",
 "gender": "Male",
 "age": "35",
 "timestamp": "2012-11-09T08:00:00.000Z",
 "views": "1054",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "3 leaves",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "(leaves)"
  }
 }
}
