{
 "id": 9637,
 "title": "There Is a Witch in My Room",
 "date": {
  "submission": "2008-04-02T07:00:00.000Z",
  "experience": "2006"
 },
 "author": {
  "name": "Heinrich",
  "gender": "Male",
  "weight": "170 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "50 seeds",
   "administration": "oral",
   "substance": "Datura"
  },
  {
   "time": "0",
   "amount": " T+ 0:45",
   "administration": "100 seeds",
   "substance": "oral"
  },
  {
   "time": "Datura",
   "amount": "",
   "administration": " T+ 1:00",
   "substance": "100 seeds"
  },
  {
   "time": "oral",
   "amount": "Datura",
   "administration": "",
   "substance": " T+ 1:00"
  },
  {
   "time": "300 seeds",
   "amount": "oral",
   "administration": "Morning Glory",
   "substance": ""
  },
  {
   "time": " T+ 0:00",
   "administration": "smoked",
   "substance": "Cannabis"
  }
 ],
 "report": [
  "<p>A friend of mine found some datura growing next to the library at our college.  He picked it to give to his roommate who was interested in trying it.  He read the experiences online and decided not to try it.  I have regular piss tests thanks to the state of Maryland, so I was bored and looking for a new drug to try.  I read that datura was truly terrifying for many and for some reason I really wanted to try it.  After thinking about doing it for a few days I decided on a Thursday night to eat 50 seeds. ",
  "After about 45 minutes and no effects I ate 100 more and then after 15 minutes another 100.  I was getting angry that I was having no effects.  I was looking for the most terrifying drug experience and nothing was happening.  After another half hour I started to feel a light buzz and I found that everything felt lighter.  I don't know what I was thinking or how intoxicated I actually was at that time, but I decided to eat 300 Morning Glory seeds that my friend had left over from experimenting with extracting LSA. ",
  "About 20 minutes after eating the Morning Glory I threw up, like I always do after eating morning glory.  We left my friends room and went downstairs to mine and we smoked a little bit of pot and I found it impossible to use a bowl.  After taking a few hits I remembered the piss test that I would have and started freaking the fuck out.  I couldn't stop thinking about the possibility of going to jail. ",
  "I kicked everyone out of my room and the furniture in the room appeared to be floating 3 inches off the ground.  I started seeing objects appear out of the floor and ceiling and at first it was really fun.  It felt like a normal LSA trip but then the effects of the datura started.  The things I was seeing in the ceiling started turning into violent scenes and faces in agony.  I occasionally saw blood dripping from my ceiling.  It was like my ceiling turn into a Saw movie. It took about 20 minutes for me to realize that it was just a hallucination and decided to turn the lights off to stop.  This made the trip fun again and I lay down in my bed and tried to relax. ",
  "I was alone now and started feeling detached from everything in the world and may have fallen asleep. ",
  "I suddenly started feeling intense anxiety for no reason and when I looked in the corner of my room I saw there was a woman there.  I realized that she was a witch and I was somewhat happy to see it because I didnt believe that it was a real theme of datura.  The witch turned her head and she had no face except for yellow eyes.  This scared the shit out of me.  Every time I looked away she looked away and after a few minutes of finding the courage to look at her again every few seconds, Her eyes turned blood red.  I wanted to get out of my room but she was next to the door.  I was trapped in my room because the window led to the roof where I knew I shouldnt go onto in my condition. ",
  "I finally got up turned the lights on and ran out of my room.  Fight when I got up to escape the witch that I thought was going to kill me I also felt like I had just woken up.  I don't know if I was dreaming about the witch or not but either way I left my room and didn't go back for two-and-a-half hours. ",
  "I found my way outside and smoked a cigarette and when I looked at the sky the moon turned into a swastika.  I was partially amazed and partially scared.  When I looked away and looked back at the moon it was gone and ran when people walked by me I kept asking them if they stole the moon and if the witch in my room was trying to kill me.  After walking the halls and being incredibly frightened for 2 and half hours I went back to my room to go to sleep.  I wanted nothing more than to sleep the trip off and return to reality.  When I turned the lights off, I immediately lay down in my bed and never looked into the witches corner.  I eventually fell asleep and had some of the craziest dreams I've ever had.  I sleep through the next day continuing to have interesting dreams and didn't feel right all day.",
  "I will not do datura again and it really did not produce any desirable effects.  My hallucinations were violence, blood, agony, witches and swastikas.  It has been more than a month and I still don't think I have completely recovered mentally.</p>"
 ],
 "erowid": {
  "id": "57807",
  "citation": " Heinrich. \"There Is a Witch in My Room: experience with Datura & Morning Glory (ID 57807)\". Erowid.org. Apr 2, 2008. erowid.org/exp/57807",
  "substance": "Datura & Morning Glory",
  "views": "17644"
 }
}
