{
 "title": "Great Binge Until the Awful Comedown",
 "author": "Steve",
 "citation": " Steve. \"Great Binge Until the Awful Comedown: experience with Methylphenidate & Cannabis (ID 96384)\". Erowid.org. Nov 13, 2013. erowid.org/exp/96384",
 "substance": "Methylphenidate & Cannabis",
 "bodyweight": "75 kg",
 "header": [
  "DOSE: T+ 0:00",
  "30 mg",
  "oral",
  "Pharms - Methylphenidate",
  "(pill / tablet)",
  " T+ 2:00",
  "15 mg",
  "insufflated",
  "Pharms - Methylphenidate",
  "(ground / crushed)",
  " T+ 3:00",
  "15 mg",
  "insufflated",
  "Pharms - Methylphenidate",
  "(ground / crushed)",
  " T+ 4:00",
  "15 mg",
  "insufflated",
  "Pharms - Methylphenidate",
  "(ground / crushed)",
  " T+ 5:00",
  " repeated",
  "insufflated",
  "Pharms - Methylphenidate",
  "(ground / crushed)",
  " T+ 15:00",
  "0.4 g",
  "smoked",
  "Cannabis",
  ""
 ],
 "report": "<p>I'd like to tell you guys about my first experience with Methylphenidate (Ritalin). Asked a friend to get me 5 capsules of NVR R30 Ritalin LA (30 mg each) to help me study for my finals the next day since I couldn't get any amphetamine like I did last year when I ran out of time. In the morning I had a bowl of cereal and was well rested before taking any Ritalin. Already had quite some experience with stimulants, mostly MDMA, amphetamine and cocaine but I don't have any tolerance since I don't do 'hard drugs' that often.</p><p>11:00am T+0:00: Got my capsules, instantly took one orally.</p><p>12:00pm T+1:00: Didn't notice any changes, kind of strange. I was a bit hungry so I ate a sandwich, it's better to eat something while on stimulants.</p><p>01:00pm T+2:00: Still nothing, a bit disappointed I decided to snort half a capsule. So I opened one, since they were time release I had to break up the little rock-hard balls to create a fine powder. That wasn't very easy, crushing between spoons finally did the trick.</p><p>01:30pm T+2:30: BOOOOM, snorting really catapulted me in to hyper-space. Pretty lovely, euphoric and wide awake! This reminded me of some very good amphetamine I had a while back. Sadly I started gaming instead of learning for my finals, was going a bit to hard to just study.</p><p>02:00pm T+3:00: Euphoria was going leaving me, noooo! Decided to snort the other half, 60 mg so far, this brought the Amp right back in me hmmm! By this time I was already getting that feeling of a binge starting, I knew I wasn't going to be able to resist.</p><p>03:00pm T+4:00: Took some more lines, about 10-15 mg. I couldn't stand the comedown from this type of amphetamine, very strange. Kind of like cocaine, just can't stop till it's all gone. This was going to be a long night but I didn't know yet. I felt stimulated but that strong feeling always went away after an hour. Started studying and it was quite easy, did a lot of work.</p><p>04:00pm T+5:00: Crushed up all the pills I had left, started binging on it. I felt like superman but the nice effects didn't stay for long which made me do more and more and more. After this I kind of lost track of time, started binging a lot and didn't pay any attention to doses/time. Eating was a bit difficult at 06:00pm but I did get some food inside of me. A good tip if you don't want to become a complete zombie the day after stimulants!</p><p>10:00pm T+11:00: Finished my last lines, by now I took 30 mg orally and snorted 120 mg. Studied a bit more til about 12:00am and then came the come-down. :(</p><p>Thinking I was going to get some sleep on this (weaker) amphetamine was a big mistake! Once the 'on top of the world' feelings die I was left with an over-stimulated brain that just kept snapping from one thing to another.</p><p>Laid wide wake in my bed till about 02:00am, I was going nuts so decided to roll a big fat joint to get to sleep. Smoked a white widow joint, about 0,4 grams, this felt good but I still wasn't getting sleepy. Went back to bed and watched the hours go by will moving around in bed to find a good position, after 04:00am I don't really remember anything and I'm not sure if I had some sleep; kind of weird state of being between awake and sleeping, had some kind of visuals when my eyes were closed and even felt my eyes go from one side to the other. REM cycle??</p><p>The day after I slept till 12:00pm, woke up with a headache and even missed my finals. I'll never touch Ritalin again, just way too addictive when snorted! And I do not recommend anyone binging on it, it's not worth it! While I find normal amphetamine sulphate isn't that addictive and I don't turn into a strung out binging addict when on them (also while snorting), I think this has to do with the power of amphetamine sulphate: the rush lasts longer and not that bad of a come-down.</p>",
 "year": "2012",
 "id": "96384",
 "gender": "Male",
 "age": "23",
 "timestamp": "2013-11-13T08:00:00.000Z",
 "views": "1140",
 "dose": {
  "0": {
   "time": "DOSE: T+ 0:00",
   "amount": "30 mg",
   "administration": "oral",
   "substance": "Pharms - Methylphenidate",
   "form": "(pill / tablet)"
  },
  "1": {
   "time": " T+ 2:00",
   "amount": "15 mg",
   "administration": "insufflated",
   "substance": "Pharms - Methylphenidate",
   "form": "(ground / crushed)"
  },
  "2": {
   "time": " T+ 3:00",
   "amount": "15 mg",
   "administration": "insufflated",
   "substance": "Pharms - Methylphenidate",
   "form": "(ground / crushed)"
  },
  "3": {
   "time": " T+ 4:00",
   "amount": "15 mg",
   "administration": "insufflated",
   "substance": "Pharms - Methylphenidate",
   "form": "(ground / crushed)"
  },
  "4": {
   "time": " T+ 5:00",
   "amount": " repeated",
   "administration": "insufflated",
   "substance": "Pharms - Methylphenidate",
   "form": "(ground / crushed)"
  },
  "5": {
   "time": " T+ 15:00",
   "amount": "0.4 g",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": ""
  }
 }
}
