{
 "id": 9647,
 "title": "A Long Night and a Longer Day",
 "date": {
  "submission": "2008-05-10T07:00:00.000Z",
  "experience": "2006-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Ryan",
  "gender": "Male",
  "weight": 91
 },
 "dose": [
  {
   "time": "0",
   "amount": "13 tablets",
   "administration": "oral",
   "substance": "Hydrocodone",
   "form": "pill/tablet"
  }
 ],
 "report": [
  "[Erowid Note: this person took between 6.5 and 8.6 grams of acetaminophen (paracetamol) which can be dangerous to the liver if taken in very high doses; over 10 grams at a time can be fatal. The maximum daily dosage (adult) is 4 grams (this estimate is from emedicine.com, more on acetaminophen can be found through your favorite search engine). People with liver disease or who are regular users of alcohol are more at risk of liver failure from high doses of acetaminophen, even doses lower than 4 grams.]",
  "I am a seventeen year old drug addict and I think anyone reading this should know that before they continue in my past. I have done several drugs of which hydrocodine(vic from now on) which is most pertinat.",
  "It started as a nice night, I went with a good girl friend of mine to a carnival which was in town that weekend. We got a little stoned (smoked reefer) and watched the fireworks. All and all a very nice evening until I looked at my watch and noticed I was very late and I was due home over an hour ago, and to add to it my father was calling me every five minutes since to remind me how late I was and how much more pissed off he was. To add to his fire I was finishing a ciggarette as he walked out to my car when I pulled in. He hated it when I smoked.",
  "Well he was unbelievably pissed as I mentioned and this was the last straw. He gave up screaming and hit me a couple of times. He regretted it as did I believe me. I was so astonished I didn't fight back. I did nothing except after he went to bed I found his vic. I was emotionally destressed at the time so I took a hand full of the huge pills and forced them down. The I took another hand full and forced those down. I turned my T.V. on much too loud and passed out a short time later.",
  "My parents tried frantically to wake me up the next morning with out results, but I did open my eyes. It was almost impossible to keep them open. Then I threw up and couldn't move away from the barf. Nothing even registered in my mind at the time. Shortly thereafter I passed out once again. I slowly stayed up for more time in periods it wasn't till 5 days later I was able to spend a whole day awake and alert. It was horrible, I almost died and it was all around stupid."
 ],
 "erowid": {
  "id": "57836",
  "citation": " Ryan. \"A Long Night and a Longer Day: experience with Hydrocodone (Vicodin) (ID 57836)\". Erowid.org. May 10, 2008. erowid.org/exp/57836",
  "substance": "Hydrocodone (Vicodin)",
  "views": "10298"
 }
}
