{
 "id": 9651,
 "title": "My Friends in the Parallel World",
 "date": {
  "submission": "2007-02-09T08:00:00.000Z",
  "experience": "2006-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "velmwend",
  "gender": "Male"
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "cig.",
    "quantity": "1"
   },
   "administration": "smoked",
   "substance": "Calea zacatechichi",
   "form": "plant material"
  }
 ],
 "report": [
  "Calea has been sat in my store cupboard for over a year. Initially I tried the bitter brew (and boy is it bitter) and then I tried smoking, and then both, but with no noticeable effects. I wasn't expecting anything amazing - just some vivid, linear dreams with which to contemplate the following day. I eventually gave up experimenting.",
  "Returning to my calea recently I finally had the experience I'd been waiting for.",
  "30 minutes before bed I smoked a double-skinned cigarette packed with tobacco and calea. When I lay in bed later I immediatey became aware of an increased auditory sensitivity. I feel asleep and had the most vivid, colour-saturated dream. I was in a parallel world populated by a host of weird and wonderful critters. Elves, gnomes, angels, the lot. They showed me how they could tamper with the human world. A group of mischevious elves demonstrated how they could 'transmit' aromas into the real world. They sat and giggled as they showed me two men standing on path, sniffing and saying, 'what's that smell?' Then they showed me floating images of all the human cultures and individuals past and present who had managed to step into the parallel world and share in its wonders. The dream, which was linear, peaked with a carnival procession of all these wonderful creatures. The procession ended at the mouth of a colourful, rotating vortex, outside of which stood a crowd of human children. It looked asif these children were preparing to enter the vortex and the creatures had come to celebrate and say goodbye.",
  "I've never had a dream so vivid, so colourful, or so profound as this one. I'm putting it down to the calea. It's also a dream that has revived my interest in mysticism and fairy tales.",
  "I have a newfound respect and belief in the power of Calea."
 ],
 "erowid": {
  "id": "57854",
  "citation": " velmwend. \"My Friends in the Parallel World: experience with Calea zacatechichi (ID 57854)\". Erowid.org. Feb 9, 2007. erowid.org/exp/57854",
  "substance": "Calea zacatechichi",
  "views": "12933"
 }
}
