{
 "id": 9655,
 "title": "Addy's Stronger Cousin",
 "date": {
  "submission": "2008-05-07T07:00:00.000Z",
  "experience": "2006-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "John Bowerman",
  "gender": "Male",
  "weight": 59
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "mg",
    "quantity": "3.0",
    "grams": 0.003
   },
   "administration": "insufflated",
   "substance": "Amphetamines",
   "form": "ground/crushed"
  },
  {
   "time": "1:00",
   "amount": {
    "unit": "mg",
    "quantity": "3.0",
    "grams": 0.003
   },
   "administration": "insufflated",
   "substance": "Amphetamines",
   "form": "ground/crushed"
  },
  {
   "time": "2:00",
   "amount": {
    "unit": "mg",
    "quantity": "3.0",
    "grams": 0.003
   },
   "administration": "insufflated",
   "substance": "Amphetamines",
   "form": "ground/crushed"
  },
  {
   "time": "3:00",
   "amount": {
    "unit": "mg",
    "quantity": "3.0",
    "grams": 0.003
   },
   "administration": "insufflated",
   "substance": "Amphetamines",
   "form": "ground/crushed"
  }
 ],
 "report": [
  "It was around 7p.m. and my friend had just got a bottle of 130 10mg pills of dexedrine. We were use to doing lines of adderall so we didn't think this would be much different. We broke up a 10mg pill into 3 lines. I took one whole line to start off with and my Friend (100lbs girl) took a little more than half of hers. We popped in requiem for a dream to start the night off.",
  "I right away started to feel alot better than I did with adderall and she agreed. After a 10 mins or so I started to feel like a light meth high. After probably an hour I did another line and she finished hers off. It then started to feel alot more intense and she had check her pulse at 100bpms. We hung out for a while longer until about 9p.m. when we decided to break up another pill. She did a few little bumps off of it and left the rest for me which I then broke up into two lines and took one. It felt more and more like when I've smoke a few hits of good meth.",
  "She took off to do some homework for the night and I talked on the phone for about an hour till I took the last line. About 30 to 45 mins after that it felt like a really good body high and I ended up cleaning my whole room. I was very talkative and couldn't sit still for quite some time. I ended up watching family guy season 4 all the way through and wasn't able to sleep until about 5a.m.",
  "I decided to write this because I didn't realize how much different this was or at least made me react when I did it than adderall or any other ADD meds. It was a really good alternate to meth for me at least and I had a good time on it other than the fact that we did it so late I wasn't able to get to sleep well. I think it would be a good drug to do earlier or if I had a long night of partying ahead."
 ],
 "erowid": {
  "id": "57869",
  "citation": " John Bowerman. \"Addy's Stronger Cousin: experience with Amphetamines (Dexedrine) (ID 57869)\". Erowid.org. May 7, 2008. erowid.org/exp/57869",
  "substance": "Amphetamines (Dexedrine)",
  "views": "9162"
 }
}
