{
 "id": 9656,
 "title": "Phase III",
 "date": {
  "submission": "2008-04-29T07:00:00.000Z",
  "experience": "2006"
 },
 "author": {
  "name": "MasterDemoMann",
  "gender": "Male",
  "weight": "200 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "75 mg",
   "administration": "insufflated",
   "substance": "Pharms - Venlafaxine",
   "form": "(ground / crushed)"
  }
 ],
 "report": [
  "<p>Ok, I'm going to write this as we go along. I have a single 75mg Effexor XR that I have crushed up to snort. Previously I've tried to smoke these out of a meth pipe, and have taken the pills orally. Not much of an effect other than a bad taste in my mouth and a bad headache. Before we continue with 'Phase III' of my experiment, I'm going to smoke a cig and use the restroom.",
  "*5 Minutes Later*",
  "Ok. First line. In coke values, its about a 3-5 dollar line. Done. It has a bit of a burn to it, like snorting adderal, but nothing too bad. Not like meth.",
  "Here's the second line. About a 10 dollar line. As it is I'm sick with the flu right now this isn't helping my stuffy nose, but here it goes.",
  "Jesus christ that one burned! Thats comparable to doing meth! Ugh. I couldn't even finish the line. So, I'm gonna finish it in the other nostril.",
  "Already I'm feeling lift in attitude. My vision feels somewhat odd and I don't feel the usual way I do. I still have about a 15 dollar line out but I'm not sure I wanna finish it. I feel pretty awake right now too, already colors and sounds seem very sharp and easy to detect. My armpits are sweating too. My hands are starting to shudder slightly. Its almost like speed, but somewhat different. I have an odd tasting drip coming down my throat too. My nose has cleared up some. I can't help but look around at everything as I type, my budhha and dragons, posters, the picture of Mount Fuji on the wall, the effexor on the plate. I'm now starting to feel as though, well, that feeling in my stomache as though I'm excited.",
  "Interesting.",
  "Will write a part two to describe the peak and comedown!</p>"
 ],
 "erowid": {
  "id": "57873",
  "citation": " MasterDemoMann. \"Phase III: experience with Venlafaxine  (Effexor XR) (ID 57873)\". Erowid.org. Apr 29, 2008. erowid.org/exp/57873",
  "substance": "Venlafaxine  (Effexor XR)",
  "views": "21299"
 }
}
