{
 "id": 9657,
 "title": "Scagged at T+1h, Stoned the Morning After",
 "date": {
  "submission": "2007-08-29T07:00:00.000Z",
  "experience": "2006-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "solaarcoma",
  "gender": "Male",
  "weight": 90
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "mg",
    "quantity": "300"
   },
   "administration": "oral",
   "substance": "Pregabalin",
   "form": "capsule"
  },
  {
   "time": "0",
   "amount": {
    "unit": "mg",
    "quantity": "20"
   },
   "administration": "oral",
   "substance": "Amitriptyline"
  }
 ],
 "report": [
  "To give a representation of its strength - a friend of mine has post herpetic neuralgia, a serious pain in the face (literally).  He had been taking 2000mg Neurontin (gabapentin) bd (twice daily), but recently his prescription was changed to 200mg Lyrica bd (twice daily), so I would estimate that Lyrica (pregabalin) has similar effects to Neurontin and is equivalent to 10 times the strength without some of the side effects of high dose Neurontin (gabapentin).",
  "Last night (20.30h) I took 300mg of Lyrica and 20mg of Amitryptiline.  After working a 12 hour shift and not having eaten anything for 6 hours (2 cups of coffee drank), I was reasonably tired anyway.  At T+1h (21.30h) I was slurring my speech and watching the wall was as interesting as watching the TV.  Not so much Visuals but the inner voice which is always present seemed to be uninterested in anything that was going on. Closed eye visuals were random unmoving geometric shapes.  I have similar effects with morphine, but with this there was more of a numbness than the tingle I get with morphine.  I went to bed at 22.00h and fell asleep instantly.",
  "In the morning (09.00h) I remember a few random dreams, but feel I have had many others which are forgotten.  For me the dreams remembered are very much science based, but my work the previous day had been problem solving based so I was in that frame of mind.  I am writing this at 16.00h and am still quite 'fuzzy headed'.  All day I have had a stoned feeling (like a heavy hash rather than grass) so now I am going to take 100mg Lyrica (pregabalin) and 10mg Amitryptiline just to feel nothing for a little while longer.  Might throw in a Xanax later as well.  I have been told that after a while of using Amitryptiline the somnolescent (sleep inducing) effects are greatly reduced."
 ],
 "erowid": {
  "id": "57874",
  "citation": " solaarcoma. \"Scagged at T+1h, Stoned the Morning After: experience with Pregabalin & Amitriptyline (ID 57874)\". Erowid.org. Aug 29, 2007. erowid.org/exp/57874",
  "substance": "Pregabalin & Amitriptyline",
  "views": "29899"
 }
}
