{
 "title": "Olianic Epiphany",
 "author": "Useful Idiot",
 "citation": " Useful Idiot. \"Olianic Epiphany: experience with Cannabis & Salvia divinorum (ID 9666)\". Erowid.org. Jul 7, 2005. erowid.org/exp/9666",
 "substance": "Cannabis & Salvia divinorum",
 "bodyweight": "60 kg",
 "report": [
  "<p>Recently, the searing hate and destruction overseas left me feeling somewhat distant and vague as to why I had chose to become a human being. Upon returning from a scheduled governmental appointment my mind raced with enthusiasm and love for nature and life. It was as if I was being drawn somewhere, I became unconscious of my movement and simply flowed along the streets of my suburb lost in the recesses of my dissolute teenage mind.",
  "",
  "The next conscious thought I had, I was marvelling at a small specimen of acacia maiden ii when an ant caught my eye on one of its shoots. I snapped of this shoot feeling somewhat callous for the plants well being. Then it begun. I became unconscious again to my movement, staring into the cutting of acacia and marvelling at the small organism inhabiting it.",
  "",
  "It was as if love, Oliani, mother nature, whatever analogy you like accepted me for the first time. Recognized my absolute disdain for the current states of minds humans are lost in, and my absolute desire to break free of this mental enslavement and learn how to properly engage the forces of love and light.",
  "",
  "She hugged me, beautifully, like the feeling you have when you hug someone you love, except it was BIG, it was everywhere, every image my consciousness fell into poured love back into my being. A dog barks, conscious, I notice the sky as moving dots of energy flowing everywhere, more extreme barking, I focus my eyes on the pure energy of the situation, I see my own aura moving ahead of me, and the dog watching its every move. The sky is no longer blue with white fluffy clouds, I perceive a dark red flowing energy of IMMENSE power, it tells me its ready.",
  "",
  "It tells me to get ready.",
  "",
  "I arrive home, spiritual coincidence rendered my conformist devout religious grandmother away for the weekend, and my open minded hallucinogenically raped father having the weekend of work, telling me my 'incense' had arrived. Salvia divinorum. The medium, In my humble perception, to EXPLORE your connection with this divine source of love I had experienced before totally naturally, with no residual substances in my body (bar some cannabinoids that I don't think will ever be clear from my system due to a life long pledge of love and devotion to the cannabinoid teacher).",
  "",
  "Two distinct spiritual epiphanies, one message being, Love, love is the way to free yourself. The second, Prepare yourself for the coming of thy.",
  "",
  "Thy you might ask? I was blessed with the Divinorum for this purpose.",
  "",
  "Quickly I realised, where am I? What is this weird thing in my hand with smoke coming out of it? What have I done? RELAX. You're being showed something. I feel my spirit being gently removed from my body, and in a split second, shattered and spread across eternity. I realised our true nature.  We are love and light. We can only evolve through the realisation of this.",
  "",
  "Realisation that love is the ultimate balancing force, and when enough people have the knowledge and desire to engage the forces of the universe those being love the human race will be ready for the next step. It is as if we have fucked up so much, especially with impending war in Afghanistan, that the powers that be have felt it necessary to surge the energy. Come direct to us. Like they did me.",
  "",
  "Force us into direct confrontation with ourselves",
  "where you cannot lie",
  "where all is truth and all is merely vibrating energy",
  "where all we have is thought",
  "negative",
  "positive",
  "Ive heard that in the middle you find god. You must embrace your enemies, they are you. You created them.",
  "",
  "They come from your own hate and destruction within, you must not push things away from your consciousness, bring them out into the light where their purpose and reason can be made known.",
  "",
  "Many contemporary styled bodies flash before my minds eye, cargo pants, skate shoes, backwards caps.. all racing from every perceivable angle into each other. Forming small piles of these bodies, that were revealed by the flicker of candle light across my carpet. Small lumps in my vision of reality at that time under the s.d. Going into trance meditating on said lumps revealed their nature. Contemporary socialism and its dead like state in the minds eye.",
  "",
  "I spoke to my father as if my higher self had taken over, and started to reveal why and how I had formed my being as such an introspective mysterious character.",
  "",
  "From an early age I knew I was whole, complete and a true son of god.",
  "",
  "It is this belief, the ultimate power of thought, that we are eternal, our destiny great and permanent, that will keep my resonation high and my love for life high throughout these last.. turbulent times. All of you, peace . . . love . . . insight . . . trust in the true nature of yourself and the universe and you will not be forsaken.</p>"
 ],
 "year": "2001",
 "id": "9666",
 "gender": "Male",
 "views": "4605",
 "dose": [
  {
   "time": "0",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  },
  {
   "time": "0",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "(plant material)"
  }
 ],
 "submissionDate": "2005-07-07T07:00:00.000Z"
}
