{
 "title": "Taking It With You",
 "author": "Captain Heroin",
 "citation": " Captain Heroin. \"Taking It With You: experience with MDA (ID 96662)\". Erowid.org. Feb 22, 2013. erowid.org/exp/96662",
 "substance": "MDA",
 "bodyweight": "160 lb",
 "header": [
  "DOSE:",
  "100 mg",
  "IV",
  "MDA"
 ],
 "report": "<p>It was Spring of 2009. Right before spring break, my friend came over with some lovely surprises. MDMA and MDA. The MDMA was pressed in tablets, 200mg each. The MDA was in capsule form; each capsule had 200mg. It was clear some capsules were more filled than others either due to the powder being inconsistent in fluffiness/compression or due to the scale being slightly off, I am not sure which. I decided that I would get two of each so that my fiancee and I would have at least two good experiences with what we had. Before he left, I asked him if he would let me have the one that was most-full with powder and he said yes!!! I was quite lucky to be friends with this person.</p><p>I dissolved the largest capsule in about 20 units of water; it dissolved very easily. It must have been very pure, there was no obvious cut in it. The amount of water stayed the same. This was divided amongst me and my fiancee - 10 units each.</p><p>Within 10 seconds of injecting, I had the sensation that I had just injected a combination of euphorants (cocaine, meth, heroin...and something very psychedelic) all at once, and became so nauseous I vomited instantly. After vomiting I felt very relieved and the high was much more enjoyable. The last visual contact I had with reality was staring into the vomit emulsifying into water, while visuals began growing within this. It was quite intense and it felt like I was accelerating at a frighteningly high speed towards the peak.</p><p>I remember reading trip reports about 2c-T-7 and MDMA, the negative reaction which happens to people in this dangerous combination is that they feel the peak accelerating quickly, they feel it's almost 'too pleasurable' and then it gets more intense to the point where it's dysphoric due to the intensity.</p><p>This is basically what it felt like, however it never became dysphoric. Just very intense. The degree of CNS stimulation I experienced was surreal.  The visuals built to the point where all I could see was visuals.</p><p>The out of body experience began here. I had the sensation I was being pulled out of my body, and my visual input seemed to consist like that of a fly - seeing one image tiled infinitely, basically. The amount of visuals that were happening in each cube were phenomenal. After I had zoomed out to see all of this, a vortex formed in the middle of it and I was being pulled into it. The visuals are spinning and changing more rapidly, to the point where it would make most other psychedelic experiences I have had rather mundane.</p><p>After this seemed to go on for a while, it came to a halt and I felt the stasis on the other side. It was comforting to get there. I met what other people would call God, or an alien entity. You could also conceptualize this being as yourself in an eternal form. I could tell that life after death was possible for people, through living a life filled with love. Karma is a real factor in life, and I can tell that this is true today. I also remember thinking how absurd any of this would sound to most people.</p><p>I remember seeing another tiled grid, however this was very different from before where there were just visuals. This seemed to be a recording of my life. I had the ability to zoom in on single frames and examine each part of it. I was able to have a brief moment of watching myself from a third party perspective, reminiscent of how people describe out of body experiences during surgery. This brought me to the realization that my entire life has already happened. My body is temporary; it lived/lives within a time in existence. Our souls can relive lives that have existed in time. Nothing changes, though you have the illusion that you are doing it for the first time.</p><p>Why do I think such psychotic thoughts, you might ask? This isn't the first time this grim realization has been brought up in my mind. I was once on about five grams of dried mushrooms. I remember looping through a 1 minute window of time at least 5 or 6 times in a row. Every time, I tried to say or do something different, but it was as if I was destined to say the same thing. This was incredibly frustrating to me. But after the first few times it happened, it was more frightening than anything. I tried to explain what was going on to my fiancee but she wasn't as heavily effected as I was. For hours, this same thing kept happening. Near the end of this plateau, the derealization was strong enough to the point where I decided if it wasn't real then there was no harm in acting as if it is real. Meaning, dreaming can't hurt you. It felt very good to be out of the delirium like state I was in during that plateau. Sorry for the trip down memory lane. Moving on.</p><p>Since this experience I have had different thoughts about my initial reactions to this experience. Perhaps soul matter exist in more human beings rather than the one we all know to be ourselves. Perhaps there are many more realities than just the one we know to be true. What I realized as this trip tied itself up is that after your body dies, your soul will still exist and it can't take anything physically real with it. The only thing you take with you is positive karma and the love you have built between people in life.</p><p>As the plateau faded back to baseline, I found myself essentially sober (minus being very shaken up, still very physically stimulated, but not tripping at all) within 20 minutes. How could this whole psychedelic trip take place in 20 minutes? Likewise, how could I have possibly re-lived 1 minute so many times over? This further reinforces the realization that perceiving time isn't limited to the constructs of time and space.</p>",
 "year": "2009",
 "id": "96662",
 "gender": "Male",
 "age": "21",
 "timestamp": "2013-02-22T08:00:00.000Z",
 "views": "1858",
 "dose": {}
}
