{
 "title": "Spoonful of Opium",
 "author": "Salvia Syndicate",
 "citation": " Salvia Syndicate. \"Spoonful of Opium: experience with Opium (ID 9670)\". Erowid.org. Jul 8, 2005. erowid.org/exp/9670",
 "substance": "Opium",
 "bodyweight": "145 lb",
 "report": "<p>First and foremost:</p><p>I want every reader to know that I have a there's a difference between addiction and fascination. I am fascinated by drugs and the history and culture that encompass them. I could be addicted to beer if I didn't have to drink so much liquid. I could be addicted to hard alcohol if it didn't give me indigestion. I could be addicted to other drugs...but I'm not. In fact, I have had made more runs to the med kit this year because of hangnails, not drugs. Point being: Most of my physical problems this year have been associated with hangnails and not drug addiction. Point hopefully comprehended, I shall move on.</p><p>I wondered across a magical crop of poppies so I thought it would be cool to harvest it and smoke them. I have a feeling they were Chinese pops, but I'm not an expert. Nonetheless, I decided to play expert and harvest the O. I harvested the O. Went through the whole bit, and came out with about four tablespoons worth of O. Not bad for the two people smoking the fringe bennies.</p><p>Anyway, it just so happens I became curious and gulped down one of the tablespoons.</p><p> *AUTHOR'S NOTE*</p><p> Don't do this.</p><p>So, I did a tablespoon of raw, yellowish, sticky, buttdwelling poppie blood and tried to play it cool in front of my buddy as if it were an easy stunt. It wasn't.</p><p>My first instinct was to nix the operation and call it a nightbut I didn't. I swallowed down the mound of bitter-butt butter and gasped for air. Now all I had to do was keep it down.</p><p>I must've kept it down for about two hours when the effects kicked in. My body went into overdrive and I started sweating and feeling ill. I pretty much knew where this situation was leading but it was a little too late fix my mistake.</p><p>That's when things went AWOL. My mother came into my room, spoke something and left. Her voice had changed to something very demonic. This was very displeasing. It was more so when everyone I was talking to sounded like Satan.</p><p>I had only one worry and it had nothing to do with the fact everyone sounded like Satan. My biggest worry had more to do with the fact that I may have gone overboard and now I'm going to end up in the hospital which would eventually root me through to rehab. This made my heart rate jumpalong with the overdose symptoms.</p><p>I crashed through the bathroom and door and smothered the porcelain seat with puke. Anything that had been in there from the last week I am certain came out that night. The raw opium had cleared my stomachblood and all. After a few spastic heaves, I fell to the ground, relieved that my intestines were still intact.</p><p>After reviving from the incident, I quickly went to bed to avoid Satan and his followers. Which was a good thing because the whole scenario was really becoming too much reality for me. I woke up the morning after feeling really quite great. Probably won't do it again.</p>",
 "year": "2001",
 "id": "9670",
 "gender": "Not Specified",
 "timestamp": "2005-07-08T07:00:00.000Z",
 "views": "33754",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "1 tsp",
   "administration": "oral",
   "substance": "Opium",
   "form": "(tar / resin)"
  }
 }
}
