{
 "id": 9673,
 "title": "Talkative and Euphoric",
 "date": {
  "submission": "2007-01-16T08:00:00.000Z",
  "experience": "2006-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Tyler S",
  "gender": "Male",
  "weight": 100
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "mg",
    "quantity": "250"
   },
   "administration": "oral",
   "substance": "Propylhexedrine"
  },
  {
   "time": "24:00",
   "amount": {
    "unit": "mg",
    "quantity": "500"
   },
   "administration": "oral",
   "substance": "Propylhexedrine"
  }
 ],
 "report": [
  "The following is as extensive a report I could muster on the awesome experience a friend and I encountered on propylhexedrine. The report spans two consecutive nights, the first involving my girlfriend and I on a threshold dose of 250 mgs and the second my friend D, my GF and I on 500 mg.",
  "First Experience:",
  "Purchased two packets of over the counter Benzedrex at our local CVS pharmacy. Rushed home as time was short, and neither of us wanted to be concerned about the amount of sleep we would be getting before work the following morning at 7 AM. Once we got back to our cozy little apartment, I was in charge of preparing the Benzedrex whilst milady fed the kitties.",
  "Having read much on the internet, I was thoroughly prepared for the night. I removed the cotton rod from the center of each of the Benzedrex capsule, and after washing my hands separated each rod into approximately 8-10 tiny bits. Settling down around the plate on which our little treats were arranged, my GF and I began the process of consumption, swallowing each little bite with a mouthful of pepsi and waiting 1-2 minutes b/t each one so as to avoid bowel obstruction. The following is as thorough an account I could muster:",
  "T::0 Finished swallowing the cotton, had to drink several cups of soda to wash that nasty menthol taste from my mouth.",
  "T+10: Though I had just eaten, had to use restroom quite suddenly to, uh, void my bowels. Probably doesnt effect anything, butyou never know.",
  "T+11:  Oh! Almost immediately after using the restroom, a definite increase in sensitivity to sound is observed.",
  "T+20: Slight onset is detectable, akin to the early stages of a good tweak session: tremors in extremities and slight nystagmus (sp?). Drank a beer.",
  "T+21: Drank another.",
  "T+25: Stomachs starting to grumble, weird menthol burpsnot as bad as Ive read tho.",
  "T+30: Boreddrank another beerId stop, but Bud Lights just so easy!",
  "T+40:  Went to the pisser, burped up a piece of cotton on the wayodd sensation. Maybe beer was a bad choice?",
  "T+60: Had 5 beers so far  no more noticeable effects from the Benzedrex, think Ill just get drunk.",
  "T+120: Hahahahaaaaaa.up to 6 beers and possibly 4 double vodka & pepsis, this stuffs kicking in now!! Pretty intense effect, though nothing like methamphetamines or cocaineloving Mortal Kombat, been goin at it for a good hour or so  recommend alcohol with this stuff, definitely enhances!",
  "After the last entry, I have no real recollection of events. An empty bottle of vodka leads me to believe I continued to drink, and when I went to bed Im told I sleepwalked out the front door  though I was aiming for the bathroom. Other than that, no difficulty sleeping.",
  "The next night, however, was a completely different experience. Though I had been sick all day (just from the alcohol I believe), my girl picked my friend D up along with 6 packets of Benzedrex. The following is an account of the events of the night:",
  "T::0 Ate all the little bits of cotton (nearly 20 a person this time) with Dr. Pepper as a chaser.",
  "T+20: Slight onset of effects, including tingling in physical extremities, mental clarity greatly increased, been involved in intense discussion on legal drinking age",
  "T+27: Voided bowels. Again. Sorry if TMI!",
  "T+31: Examined my eyes in bathroom mirrorforgot to do this yesterdayinsane pupil dilation!",
  "T+35: Listened to some DJ Tiestointense stuff!! Musics becoming really enjoyable, definitely at a +1",
  "T+37: EUPHORIA!",
  "T+38: Rapid rapid onsethard to write, strong sensitivity to sound and light, warm feeling in chest, +2 for sure",
  "T+60: Full into it now, extremely talkative and euphoric, insane levels of concentration, must focus on many things at once to stay occupied or I get bored. Perhaps this is the manic energy I read so much aboutseriously, Im playing pool on my cell phone, watching Pirates of the Caribbean II, writing this and talking to my friend. WOW.",
  "T+120: On steady plateau, energy leveling out, marked difficulty urinating (a problem I often experience while tweaking)",
  "T+4hrs 30min: Definite altered state, nearly a +3, will try 750 mg next time.",
  "All in all, when done properly this drug can be amazing. Take what conclusions you may, Id just like to point out onset at 20 mins and full effects still felt up to 5 hours after consumption on a 500 mg dose."
 ],
 "erowid": {
  "id": "57930",
  "citation": " Tyler S. \"Talkative and Euphoric: experience with Pharms - Propylhexedrine (ID 57930)\". Erowid.org. Jan 16, 2007. erowid.org/exp/57930",
  "substance": "Pharms - Propylhexedrine",
  "views": "27705"
 }
}
