{
 "id": 9676,
 "title": "Sweet Night",
 "date": {
  "submission": "2008-04-27T07:00:00.000Z",
  "experience": "2006"
 },
 "author": {
  "name": "Mila/Mila",
  "gender": "Female",
  "weight": "125 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "1.0 mg",
   "administration": "oral",
   "substance": "Pharms - Alprazolam",
   "form": "(pill / tablet)"
  },
  {
   "time": "0",
   "amount": "5 glasses",
   "administration": "oral",
   "substance": "Alcohol",
   "form": "(liquid)"
  },
  {
   "time": "0",
   "amount": "1.0 g",
   "administration": "insufflated",
   "substance": "Cocaine",
   "form": "(powder / crystals)"
  },
  {
   "time": "0",
   "amount": "1.0 g",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  }
 ],
 "report": [
  "So I'm big on xanax. Bars are just awesome. Im not prescribed to them so I end up paying a lot of money per bar (about 5 bucks) but it's worth it because they're just amazing. Floating, comfortable in any position, horny and happy. It's amazing. So I took a bar one night as I had been drinking. Now normally I like to mix pills and alcohol, especially xanax and alcohol, but tonight my friend came by with a bunch of nice blow. We tried it out and me and my friends each got a bag.",
  "So 5 lines into it, I notice the xanax has completely worn off and Im back on my paranoid cocaine feeling that I always get when I do it. No matter how much alcohol I drink, Im just irritated and paranoid and needing more all night long. So Im practically sober at this point except obviously Im not, but in my head all I think is depressing and anxious thoughts, which the xanax had originally reduced tremendously.",
  "Anyway, I continued doing my bag because it was there and just got even hornier. Eventually all I wanted was to have sex and smoke some weed. I took out my bong and we smoked a few packs. That was excellent. Everything I was experiencing sort of came rushing back but it was all blurred behind a cannabis haze. So I was horny and happy and still anxious but in a good docile way and I wasnt really thinking paranoid things but more like disconnecting from everything for a while. Then I got my much deserved sex and passed on out. Of course I get hazy in the morning as to what the hell happened the previous night but thats expected with xanax taken by itself. So yeah. Great night."
 ],
 "erowid": {
  "id": "57935",
  "citation": " Mila/Mila. \"Sweet Night: experience with Alprazolam (Xanax), Cocaine, Alcohol & Cannabis (ID 57935)\". Erowid.org. Apr 27, 2008. erowid.org/exp/57935",
  "substance": "Alprazolam (Xanax), Cocaine, Alcohol & Cannabis",
  "views": "20423"
 }
}
