{
 "id": 9679,
 "title": "Too Much, Two Drugs, First Time",
 "date": {
  "submission": "2002-02-04T08:00:00.000Z",
  "experience": "2000-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Mr. Stan",
  "gender": "Male",
  "weight": 86
 },
 "dose": [
  {
   "time": "0",
   "amount": "3 hits",
   "administration": "oral",
   "substance": "LSD",
   "form": "blotter / tab"
  },
  {
   "time": "0",
   "amount": "3.5 g",
   "administration": "oral",
   "substance": "Mushrooms",
   "form": "dried"
  }
 ],
 "report": [
  "Me and my friends had been raving quite often and we decided we were going to take one of our 'newer' friends down to a free rave in memory of a girl.",
  "We were all excited to go down and see our friend roll. We get down and the place is dry of E. I hadnt tried mushrooms before, so when asking around for Ecstasy I found mushrooms and I decided to buy an 1/8. My friends bought 2 pills of E (1 was bunk).",
  "We kept asking around hoping to find some E for everyone. We walked around for a while, and then a guy came selling UFO acid. We bought a total of about 20 hits. We all took 3. The guy that I bought it from told me to only take 2. But I figured I knew what I was getting myself into, so I took 3. We then walked back to his car that was parked on the hill, and waited to see what would happen. I didnt think anything was happening, and then stuff started getting weird, very weird. I wont even describe the visuals, because I cant. OFF THE WALL. A smashed plastic sack was between me & a friend in the back seat. Suddenly it started growing, and pulsing. I could actually see the back melting and creasing. It looked very alive. Me and my freind were tripping out on this, and then he smashed it. It looked dead. very dead. not at all like a bag.",
  "I remember looking my mask that had Tiger Balm on the inside and I could see it moving aorund on the mask, it would rise off the mask about 2 inches and just start spinning towards my face. My friends hair all stood out on end and started spinning.",
  "After this, I went insane. I felt a very strong pain right above the back of my mouth. This pain was the worst feeling I have ever had. I felt that I was losing my mind. I was very scared. It was very intense.  I have had this same feeling but not as bad after that when tripping (on acid). I felt the thing in my mind that was keeping me sane was snapping and dislodging the barrier between my rational section of my brain, and the hidden insane part. After about 2 hours of this I was still in the car, which was probably my biggest mistake.",
  "I had waaaaaayyyy to much acid for my first time. Anything that gave my brain stimulation seemed to overload it, all I wanted to do was curl up in a ball and sleep, but I couldnt do anything. I wouldnt leave the car.",
  "The moral of the story is, w/ acid or any strong drug, make sure your first time you take a handleable dosage."
 ],
 "erowid": {
  "id": "5794",
  "citation": " Mr. Stan. \"Too Much, Two Drugs, First Time: experience with LSD & Mushrooms (ID 5794)\". Erowid.org. Feb 4, 2002. erowid.org/exp/5794",
  "substance": "LSD & Mushrooms",
  "views": "15627"
 }
}
