{
 "id": 9683,
 "title": "The Secret Sedative",
 "date": {
  "submission": "2007-02-14T08:00:00.000Z",
  "experience": "2006-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Kratom",
  "gender": "Male",
  "weight": 86
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "number": "2.0",
    "unit": "g"
   },
   "administration": "oral",
   "substance": "Kratom",
   "form": "liquid"
  },
  {
   "time": "1:30",
   "amount": {
    "number": "2.0",
    "unit": "g"
   },
   "administration": "oral",
   "substance": "Kratom",
   "form": "liquid"
  }
 ],
 "report": [
  "After doing some investigation of Kratom, I decided it was time for me to test it out. I ordered 4G of 15x extract from an online vendor for ~$20 and a week later, the brown powdery substance arrived at my dorm. Just for reference, I have had experience with hydrocodone and oxycodone. To feel a good euphoria with hydrocodone, I would need to take around 30mg.",
  "2:30  I mix roughly half of the powder into a bottle of water and take a shower. The mixed drink tasted very similar to green tea with no sugar. Not the best tasting substance in the world, but definitely tolerable.",
  "3:00  I go outside and have a cigarette. I can feel the buzz slowly rolling up. It feels very similar to an opiate buzz. Mild euphoria ensues. By the time  I finished my cigarette, I could feel some significant effects.",
  "3:15  I find an empty lounge, plug in my laptop and start listening to The Wall by Pink Floyd. By this time I am feeling pretty euphoric. The great gig in the sky has now come on and I let my eyes roll back into my head. I begin to get a little bit itchy. Nothing different than a typical opiate itch.",
  "3:30  I feel like I have plateaued.",
  "4:00  I decide to re-dose the rest of the extract (2G). I mix it with water again and down it. Suddenly I realize I haven't eaten anything today so I head to the cafeteria to grab a bite.",
  "4:30  After eating some disgusting cafeteria food, I feel some nausea set it. It is mild, but definitely unsettling. I start to have some hot flashes and sweat. I'm not sure if it is because of the re-dose or if it was the food. I would venture to say it's a mix of both.",
  "4:40  Back in my dorm, the euphoria kicks in strong than before. I put on my headphones and start listening to Stairway to Heaven by Led Zeppelin. After shedding some clothes, the nausea starts to subside.",
  "5:10  Nausea has come back and I suddenly have the urge to vomit. In one big heave, a fully loaded hamburger, french fries, asparagus and corn come flying out into the toilet. After a few convulsions, I brush my teeth. I surprisingly feel fine about a minute later. The buzz seems to have subsided after vomiting.",
  "5:30  Seems like the euphoria has almost completely subsided.",
  "Conclusion: Very interesting drug. The taste was very mild and the euphoria that I received from it was not bad. The itching involved seemed less severe than it would have been if I had taken an equivalent amount of Vicodin or Percocets. Unfortunately, the nausea involved was definitely a pitfall. I would speculate that while the nausea was involved with the drug, it was significantly increased by the awful, awful cafeteria food."
 ],
 "erowid": {
  "id": "57960",
  "citation": " Kratom. \"The Secret Sedative: experience with Kratom (15x extract) (ID 57960)\". Erowid.org. Feb 14, 2007. erowid.org/exp/57960",
  "substance": "Kratom (15x extract)",
  "views": "6974"
 }
}
