{
 "title": "Introspective Solitude",
 "author": "loveless",
 "citation": " loveless. \"Introspective Solitude: experience with 25I-NBOMe (ID 96843)\". Erowid.org. Jul 27, 2012. erowid.org/exp/96843",
 "substance": "25I-NBOMe",
 "bodyweight": "80 kg",
 "header": [
  [
   "DOSE:",
   "1.2 mg",
   "sublingual",
   "2C-I-NBOMe",
   "(blotter / tab)"
  ]
 ],
 "report": "<p>Previous experiences: Cannabis, hash and salvia. This was my first experience with psychedelics beyond salvia, which I had not enjoyed due to lack of noticeable effects and nausea. Frequent user of marijuana and had decided to explore.</p><p>Held 1.2mg tab under tongue for an hour. My report starts from when I put the tab in my mouth. I was alone for this trip but in hindsight I wish I had a sitter or user to experience it with. I also wish I had taken this about 4 hours later due to the insomnia style effects of the substance</p><p>T+0:00; 10:30p.m. I place the tab under my tongue and hold it there for 20 minutes, then move it with my tongue to the area between my upper teeth and gum due to trouble keeping it in place.</p><p>T+0:20; My tongue is feeling very numb and the tab has a bitter taste, I have trouble holding it in place so I transfer it a buccal method of administration. This just transfers the numbness but still has a noticeable effects. I feel slightly dizzy at this point but no noticeable effects otherwise.</p><p>T+0:40; The walls are starting to 'breathe' and I can tell it has had an effect already. I feel clearheaded and able to type on Skype normally. I do not get any effects when looking at the screen but get peripheral blurring and the wall effect. I decide to shut down my laptop and continue this trip in bed.</p><p>T+0:45; I lie in bed and put on my iPod. I also turn off all the lights in my room and just listen to the music.</p><p>T+1.00; The books in my bookshelf are reflecting the moon light seeping from my window and are the only things I can see in the room. They seem to be blurring upwards as if they're moving downwards and have smooth tracers. I feel very clearheaded but am enjoying the music and show from the light. Music feels noticeably more layered and wider. The light feels like it is wrapping itself round my bed like ivy.</p><p>T+1.30; 0.00p.m. I am texting a friend and begin to notice the effects on the screen of my phone. The screen seems multi-layered and almost 3D. It is also distorting beyond the text and leaving tracers when ever I move it. I spend about 10 minutes enjoying this and playing with the tracers in the dark. I feel euphoric at this experience and just want to enjoy it. The 25i seems to have lifted my mood a lot.</p><p>T+2:00; I decide to put a light on in my room. It's one of those energy-efficient light bulbs that starts off quite dim and reaches full intensity after about 20 minutes. It appears to be a lush colour over everything in the room. Getting extreme tracers with my hands and have fun moving in time to the music. The walls are lit up in multiple colours and seem to be like the reflections of a disco ball, but coloured green, red and blue.</p><p>T+3:00; Listening to dream-pop and the intense amount of reverb in the songs feels far deeper than it normally would and lasts so much longer. Lots of time distortion going on and  a minute seems to take 10 minutes when I check my phone. Whenever the music stops an annoying buzzing seems to come in, then another with dissonance to the one that came just before. Music fixes this but this disappears after half an hour.</p><p>T+3:30; Right headphone dies and I spend about 10 minutes trying to fix it. I loose all concept of how it works and blame the drug, but decide it's actually not working. I boot up my laptop and browse some forums whilst listening to music on better headphones. The screen is glowing and I am noticing patterns in lots of pictures that seem to be moving.</p><p>T:+4:00; I decide to get off the computer and just enjoy the visuals. Feeling quite overheated and struggling to get the perfect position in bed. The pattern in my duvet seems to be moving in time to something. The individual hairs in my blanket are insanely detailed and seem to have a tribal style painting below them. This is just shadows but keep on coming in and out of focus. The individual hairs of the blanket are giving off purple light at their ends, in a similar style to those artificial christmas trees you can buy, but instead they're extending beyond the duvet and purple lines of light are just extending over my bed. This is by far the coolest effect so far. I get some slight unease about being on my own whilst experiencing this and consider what would happen if something happened to me. These bad thoughts give way to some paranoia but go away after an hour once I am certain I am still alive and experiencing this safely.</p><p>T:+5:00; The effects are dying down now but I get the effects on the blanket for another hour. I get quite thirsty and have to go to the toilet a few times and drink some glasses of water. I decide to go to sleep but keep on getting reduced effects of everything described above. Sleep feels impossible for the next hour. Euporia is replaced by frustration at how late I'm going to sleep and seeming inability to actually fall asleep.</p><p>T:+6:30; 5:00p.m. The effects are pretty much gone by now and I fall asleep for about 4 hours before waking up naturally. I woke up about half an hour before my alarm was meant to wake me up. I feel pretty tired but slightly enlightened due to this experience and spend the rest of the day trying to remember the effects and mood shifts. I look pretty tired but this was due to lack of sleep. I normally go to sleep about half-midnight so this was not a normal sleeping pattern for me.</p><p>This drug is amazing and I'm glad I decided to use it as my first psychedelic experience. If I could repeat the whole thing I would have used a sitter or experienced it with a friend. I would definitely have used it far earlier in the day, around 6 or 7p.m. I should treated it with more respect and thought about the effects on sleep and my perception of my setting whilst experience it but I feel nothing negative came out this experience apart from the tiredness and feel spirituality richer for it.</p>",
 "year": "2012",
 "id": "96843",
 "gender": "Male",
 "age": "18",
 "timestamp": "2012-07-27T07:00:00.000Z",
 "views": "4591",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "1.2 mg",
   "administration": "sublingual",
   "substance": "2C-I-NBOMe",
   "form": "(blotter / tab)"
  }
 ]
}
