{
 "id": 9689,
 "title": "Kicked My Ass",
 "date": {
  "submission": "2007-03-07T08:00:00.000Z",
  "experience": "2006"
 },
 "author": {
  "name": "Thewideandwise",
  "gender": "Male",
  "weight": "238 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "1.067 seeds",
   "administration": "insufflated",
   "substance": "Anadenanthera peregrina",
   "form": "(seeds)"
  }
 ],
 "report": [
  "I made the seeds (2) in the microwave (about 35 second on high each) and took off the covers of the seeds and ground the insides up.. They have a kinda plastic/fragile feeling, yellow and green, but they ground up well. And so I added edible lime to activate the seeds. I made 2 lines and snorted a 1/2 of the first line to see if they work.....o yea they work!!!! I might add that they dont hurt at all if I wet the inside of my nose with water. ",
  "(note: I have never tried anything except different varieties of pot but thats all)",
  "I lay down and my face started to get very very hot like my face was a 1/2 inch from a fire (this might me ok hot for some ppl but I love the cold, like I take -20 degree showers and I love it) so my neck started to get hot too but being greedy I wanted 'totally awesome amazingness new world things' so I finished the first line but tried a 1/15 of the next line but decided to stop because I hated how hot my face was!",
  "This is where it got weird.",
  "I lay back down and started to stare at the ceiling light in my room to see what would happen but I started to feel sick to my stomack and stayed as still as I could. Staying still helped my stomach but increased the power of the trip. I ended up saying 'why did I do this to myself....' and 'omg Im going insane' I looked into my headboard mirror and I looked orange and I thought I was gunna just burn up. I kept looking and saying that about 3 times until I felt really sick and ended up puking in my trashbin in my room (because I ate lots of food before trying the seeds!) Then the trip went into hyper mode!!! My computer screen turned the brightest blue Ive ever seen, the color was so 'basic' it was wierd.....the helium tank in my room and no inpurities but was just a purfect orange even tho normally it has tons of black scratches! The white ceiling it my room was sooooo flat and purfect I had to stair at it for a long time, o yea sooooo smooth. The light and tv dont change but everything else does!",
  "A little bit later I rolled over onto my stomach and looked at a pillow on the floor and it had a face...so.......I started talking to it lol I knew I was insane but it was ok. Last thing I could remember was when I was laying down and I looked at my hand and it was plastic, like a huge life-like baby doll hand lol soooo cool. It would change when I moved my fingers but thats all I can remember so yea I only took 1 and a 1/15 seeds but Ive never tried a psychedelic before!!!",
  "Well all I have to say is if I could extract the 5-meo-dmt from it so I don't get sick, then I will try it again but until then I bought 1,000 seeds for $20 (500 yopo, 500 celbri) so Im all good."
 ],
 "erowid": {
  "id": "57982",
  "citation": " Thewideandwise. \"Kicked My Ass: experience with Anadenanthera peregrina (ID 57982)\". Erowid.org. Mar 7, 2007. erowid.org/exp/57982",
  "substance": "Anadenanthera peregrina",
  "views": "6184"
 }
}
