{
 "id": 9695,
 "title": "Ended Up in the Hospital",
 "date": {
  "submission": "2007-01-06T08:00:00.000Z",
  "experience": "2004-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Mr_Bongz",
  "gender": "Male",
  "weight": 68
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "number": "40",
    "unit": "mg"
   },
   "administration": "oral",
   "substance": "Zolpidem",
   "form": "pill/tablet"
  }
 ],
 "report": [
  "I'd like to start by saying that I didn't initially take Ambien to trip, I used it as a sleep aid and became dependent on it.",
  "Two years ago, I had sleeping problems. I didn't know why, and I never saw a doctor for it. I just couldn't sleep and it drove me crazy. Once I found out about Tylenol PM, I took that because it helped aid my sleep. Then once the bottle of Tylenol was empty, I found my dad's prescription Abmien. I did some quick research and decided to try it.",
  "Let me tell you, Ambien gave me the best sleep ever. I would wake up so relaxed and felt energized the next day. I started taking reasonable doses almost every night, like between 10 ang 20mg.",
  "It was inevitable that having taken it so much for sleep that I would eventually realize how it made me feel when I was awake and on Ambien. I smoked pot frequently at that time, and I liked the way I felt on Ambien. It made me feel light, carefree, (tired), and hazy.",
  "So, the one night I decided that instead of just going to sleep after eating my Ambien, I would instead go to my basement and have fun while on the drug. Take advantage of the way I feel, rather than sleep it off. BIG MISTAKE.",
  "Details here are very hazy. I took 4 10mg Ambiens that night, more than I usually had taken, but still didn't seem like too much to me. I wanted to feel good, then have the best sleep of my life.",
  "The last thing I remember was sitting on my couch watching TV. My next memory jumps to me waking up in the ER in a scary hospital bed, and my dad walking over to me saying 'So what other drugs do you take?'",
  "Apparently what happened was that I tried to make it upstairs to my room on the third floor sometime in the middle of the night, and I collapsed on the second staircase. My mom found me passed out and drove me to the hospital with my dad. While half-conscious in the ER, I admitted to them that I had taken abunch of Ambien, though I couldn't remember exactly how many. Still being under the guidance of my parents, I was pretty fucked.",
  "I was sent to weekly therapy after that, and my parents don't seem to look at me the same anymore. It WASN'T worth it, and I will avoid Ambien and stick to my Celestial Seasons Tea that puts me to sleep the same."
 ],
 "erowid": {
  "id": "57994",
  "citation": " Mr_Bongz. \"Ended Up in the Hospital: experience with Zolpidem (Ambien) (ID 57994)\". Erowid.org. Jan 6, 2007. erowid.org/exp/57994",
  "substance": "Zolpidem (Ambien)",
  "views": "9141"
 }
}
