{
 "title": "A Spiritual Experience",
 "author": "Respondent 14 / Angeline",
 "citation": " Respondent 14 / Angeline. \"A Spiritual Experience: experience with MDMA (Ecstasy) (ID 96977)\". Erowid.org. Jul 23, 2012. erowid.org/exp/96977",
 "substance": "MDMA (Ecstasy)",
 "bodyweight": "90 lb",
 "report": "<p>[Most of the text below is also a part of the longer version of this account]</p><p>The best that I ever felt on ecstasy was something that was not quite happiness nor euphoria, but rather a profound and perfect sense of unity of mind, body, spirit and soul; and I understood in an instant exactly what happiness and being happy involved; and at the same time I was overwhelmed by a hope that I would someday get there.</p><p>I realised that I was looking for something that few people understand or achieve; something that I understand but haven't achieved and cannot articulate. I am searching for a state of being in which mind, body, spirit and soul are fundamentally indivisible yet each feeds the understanding of the other - a feeling that all the words in the world can only understate.</p><p>That night I almost found it. Someday I think I might. It is not something I will find alone, but rather by a dynamic combination of factors which have to be in the right place at the right time. I don't see ecstasy as escapism but rather it helps me on my journey, shows me the direction, or perhaps it helps me to see that direction, and</p><p>gives me the will to follow it.</p><p>I personally don't believe I would have ever reached that point without the use of a psychoactive drug; which is why the 'I don't need drugs to have a good time' attitude is rather puzzling to me. I suppose the question is does it matter anyway, some people get on perfectly without either the use of drugs or reaching that state; my answer would be yes, it does matter a lot, or I wouldn't look for it, and having been made aware for the existence of such a state I don't think I will ever stop looking.</p><p>I've been trying to understand for a long time the antipathy towards the usage of chemicals for purposes other than the purely medicinal. And failed, really.</p><p>From a 22 year old English woman who works as a research student in computer graphics and virtual reality.</p>",
 "year": "",
 "id": "96977",
 "gender": "Female",
 "age": "22",
 "timestamp": "2012-07-23T07:00:00.000Z",
 "views": "891",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": " ",
   "administration": "oral",
   "substance": "MDMA"
  }
 }
}
