{
 "title": "How Buddha Must Have Felt Every Day",
 "author": "Respondent 20",
 "citation": " Respondent 20. \"How Buddha Must Have Felt Every Day: experience with MDMA (Ecstasy) (ID 96979)\". Erowid.org. Jul 23, 2012. erowid.org/exp/96979",
 "substance": "MDMA (Ecstasy)",
 "bodyweight": "",
 "header": [
  "DOSE:",
  " ",
  "oral",
  "MDMA"
 ],
 "report": "<p>I have been experimenting with drugs for four of my nineteen years of life. I have always been drawn to the 'unseen,' and have been continually let down by things external to me such as religion, intelligence, and outside methods of spirituality. That is why I started doing drugs; not completely out of self-abuse, which is one of the reasons many people experiment with drugs, but out of the mystique associated with</p><p>them and in hopes that I could find what it was I was searching for: The meaning of life. I tried every drug I could get my hands on, some of it pure and some of it cut with who knows what. Then, my freshman year, I was introduced to ecstasy.</p><p>I received this ecstasy from the East Coast, and was assured that it was pure. The first time I tried it I was blown away by its power; the entire time I was on it all I could picture were Tibetan monks at prayer. That began a spiritual escalation for me, and ever since that time every dose I have taken has been a completely spiritual one. But the physical after-effects of that first time were incredible. I was feverishly sick, with chills, delusions, and incessant vomiting. It was two days before the</p><p>sickness went away completely, and I vowed never to do it again. It was a very short-lived vow.</p><p>I then took ecstasy about once a week, maybe more, for about four months, and that period of my life was the most beautiful it has ever been. I was so in touch with myself that nothing could get me down. Even being off of the drug, I still floated in a cloud which touched the ground. It wasn't as if I were hidden in a mask of unreality; it was as if I was The Real, and everything I felt, saw, touched, and tasted came to life in a way it never had before. Everything made sense, and the Taoist 'action by nonaction' guided my existence. The trees spoke to me in soft words of wonder, and I returned their voice with one of beauty and purity. Life was beautiful, and I lived it the way it was meant to be lived.</p><p>A friend of mine who I was with when he took it for the first time said, 'Now I know how Buddha must have felt every day.' That says it all.</p><p>Those days of love and connection with everything are lost to me now, though. I have not done ecstasy for four months, and a lot has transpired in my life since then. I was forced to move to a town full of bullshit, where the people wouldn't know spirituality unless they saw it on MTV. It was there that I lost it. The Beauty, Peace, and Fulfillment I experienced when on E: Gone. I wish that I could get that back, but I am afraid that by doing the drug again, it will only be the drug working magic and not myself. But if I could do it, just one more time, I would be there. I could remember how things really are. I could feel myself in all things; and all things in myself.</p><p>A 19 year old American woman</p>",
 "year": "",
 "id": "96979",
 "gender": "Female",
 "age": "19",
 "timestamp": "2012-07-23T07:00:00.000Z",
 "views": "1086",
 "dose": {}
}
