{
 "title": "Flight of the Mind",
 "author": "Respondent 71",
 "citation": " Respondent 71. \"Flight of the Mind: experience with MDMA (Ecstasy) & Meditation (ID 96981)\". Erowid.org. Jul 23, 2012. erowid.org/exp/96981",
 "substance": "MDMA (Ecstasy) & Meditation",
 "bodyweight": "",
 "report": "<p>After 6 hours of an MDMA trip (approx.150mg.), I laid down in bed to sleep and decided to try to relax my mind and do a little meditation. At first, it was hard to keep my mind focused on nothing. Within 15 minutes, things started slowing down and meditation progressed. While in deep meditation, a sensation overpowered my body, a sensation which seemed unfamiliar yet innate. Total consciousness and a pure connection with the universe. I felt myself part of the earth, the moon, the stars and all the energies within. I could feel the energies of everything both independently as well as universally.</p><p>After taking in this hectic bombardment and absorbing it into my energy, something wonderful happened. Flashes of light appeared before my closed eyes and transformed into celestial objects. These visions were not vague, blurry, dreamy visions. They were as clear as a photograph! After overcoming my bewilderment, it felt completely natural to explore this newly remembered ability.</p><p>With the purest of thought, I appeared to be flying over ancient Egypt. The details of the blue sky and yellow pyramids were so beautiful, I could hardly believe it. As soon as I started thinking about what was happening, the visions would fade. I felt myself consciously thinking and slipping away from this experience. I took a minute to focus on my energy body and reenergize it. In an instant, I was back! I felt in total control of my consciousness and decided to experiment. I 'asked' to see ancient Rome and within an instant, there it was, in all its beauty. The hundreds of columnar structures and the coliseum structurally intact!</p><p>I proceeded to once again 'ask' to see what I need to see and immediately I was transported to a graveyard. Terror filled my entire body as I thought I was to be shown my own fate. It was at that point I realized that I had asked to see this and with this fear removed, I was shown the grave stone of an ex-girlfriend! (Nothing has become of this vision as of yet, thankfully).</p><p>I firmly believe my experience was not one of an earthly plane. Since this experience, I feel more connected with the energies that collectively make up the universe. I also believe we all have these powers within us and each of us has the power to project our spirits. A spark of conscious thought can manifest anything (or anywhere) we want. The trick is keep your thoughts pure and unselfish and the whole universe with all its power and energy is really within each of us. If anyone out there has experienced anything like this, PLEASE contact me. I have so many questions and can expound on this in greater detail.</p><p>Peace.</p><p>From: daytripr@nym.lycaeum.org</p>",
 "year": "",
 "id": "96981",
 "gender": "Not Specified",
 "age": "Not Given",
 "timestamp": "2012-07-23T07:00:00.000Z",
 "views": "1350",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "150 mg",
   "administration": "oral",
   "substance": "MDMA"
  }
 }
}
