{
 "title": "Too Many Pills",
 "author": "Respondent 48",
 "citation": " Respondent 48. \"Too Many Pills: experience with MDMA (Ecstasy) (ID 96989)\". Erowid.org. Jul 23, 2012. erowid.org/exp/96989",
 "substance": "MDMA (Ecstasy)",
 "bodyweight": "115 kg",
 "header": [
  [
   "DOSE:",
   "4 tablets",
   "oral",
   "MDMA"
  ]
 ],
 "report": "<p>Recently I went to a rave in the UK with a bunch of my friends. It lasted from 7pm till 7am, and was a legally organised one with onsite paramedics etc. I'm 6ft tall and weigh about 115kg, and have found that with practically every single drug I take, I must take double the dose of everyone else. Whether coke, acid, e, speed, shrooms, hash or whatever. This isnt much fun as it can get quite expensive.</p><p>Anyway, that night I decided to double double drop, therefore entailing that I drop four e's at once. I had bought 20 White Doves to give to my friends and had swapped one for a Fido Dido, so i dropped three white doves and a Fido Dido. I hadnt eaten anything all day apart from half a sanwhich on the minibus down, and so I came up very quickly.</p><p>Within about 25 minutes I began to feel a slightly euphoric sensation in myself, so I stood up and felt completely overwhelmed with it, TOO strong. I decided to go for a little walk to see if I would feel any better by walking around. Well I didnt, and began to experience 'picture frame', staccatto like vision. I felt sick and went to first aid.</p><p>When I got there I was sweating profusely, and I was getting muscle spasms. There were two paramedics inside and the older of them asked me what was the matter. 'Overdose' I replied.</p><p>He asked me what I had taken and I told him honestly. The older of the two then replied, 'Your in fucking dreamworld' this didnt really help as it just made me feel annoyed with him, as the last thing you need when you are overdosing is someone to patronise you for your wrongdoings.</p><p>They sat me down and made me take off my t-shirt and gave me a glass of water drink, the younger one telling me to sip it, otherwise I would be sick again. I seemed to go into a bit of a trance as i stood up and started cleaning my soiled t-shirt under the tap.</p><p>About an hour after entering first aid, I left and went to find my friends. They asked me what had happened and so I told them, and then they began to massage my back because I was shaking so much. Throughout the rest of the night, I experienced a rather mellow trip nothing as intense as it would be with four pills, because I had brought most of them back up.</p><p>For the next couple of days afterwards I was an emotional wreck, paranoid as hell, shaking, involuntary muscle spasms, and my tonsilitis came back. Not much fun. This was merely to say that sometimes although we think we need a lot more to get us going than others, a sense of caution should be adopted whenever we take drugs. If I hadnt been sick, maybe something worse would have happened to me. I havent stopped taking e, but now I take it more in moderation than before, and find myself enjoying myself, rather than freaking out my friends.</p>",
 "year": "",
 "id": "96989",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2012-07-23T07:00:00.000Z",
 "views": "1437"
}
