{
 "id": 9698,
 "title": "Acid Depression",
 "date": {
  "submission": "2000-10-03T07:00:00.000Z",
  "experience": "2000"
 },
 "author": {
  "name": "~k~",
  "gender": "Female",
  "weight": 49
 },
 "dose": [
  {
   "time": "0",
   "amount": "1 hit",
   "administration": "oral",
   "substance": "LSD",
   "form": "(gel tab)"
  },
  {
   "time": "0",
   "administration": "oral",
   "substance": "Mushrooms",
   "form": "(dried)"
  }
 ],
 "report": [
  "One day last summer, my girlfriend and I decided to take some green gel tabs.  My girlfriend, who is only 4'9' and 90lbs, and I (5'3' 107 lbs) had no idea how potent this stuff was. ",
  "Our first mistake was taking a dosage that was too high for our body weights and level of experience.  We had both tripped previously but only on 1 hit and it wasn't that strong.",
  "Our second mistake was taking it on a Saturday morning on our way to an acquaintence's house, which we had only met several weeks prior to our usage.",
  "When we arrived we still weren't really feeling it, but after about an hour, I looked at my girlfriend and she started freaking out.  I looked at her and all of the sudden I started feeling the trip too.  It hit really fast and really hard.  She started crying.  She wouldn't or couldn't talk.  So I asked her if she wanted to leave the place that we were, even though I know how dangerous it is to drive, but we had to get out of there.",
  "I didn't want to be driving so I tried to think of the most comfortable, closest place we could go.  We went to my good friend Sue's house who lived nearby.  This was the best thing I could have done.",
  "Although I had never had any experience with anyone having a bad trip...I seemed to understand where my friend was at.  If I didn't talk myself down, I would slip into the terrified state that she was in.",
  "After we got to my friends house, I held my girlfriend and just talked soothingly to her.  I reminded her that we were just tripping and that this feeling would end.  I told her that if she concentrated, she could pull herself out of it.  After about 2 hours of consoling her...she finally came out of it.  If I hadn't had to work so hard on consoling her...I would have probably started wigging out too.  I couldn't sleep for about 32 hours from the time I took the acid.",
  "Now you would think that we learned our lesson about experimenting with psychedelic drugs but about a year later, we decided to do some shrooms.  Now she had done them before but I never had.",
  "I bought some from a very close friend of mine.  I told him about her bad acid trip and asked him approximately how much shrooms we should take given our previous experience.  He told me that 1/2 of an eighth would be good for both of us.  Well, he was way off...because I took only the caps from 1/2 of an eighth and that was a little too much.",
  "We took them on a Sunday morning because neither one of us had to work the next day.  We were watching Behind the Music on VH1.  For some reason I couldn't stand watching TV.  It was mentally disturbing to me so I decided to take a shower and get dressed so that we could go do something.  Well, I couldn't stand in the shower because my legs felt like cement.  My girlfriend and I took a hot bath instead.  It felt so good.  We sat in there for about an hour and watched our kittens play.  That was the best part of the experience.  After we finally got out...I didn't have the ability to get dressed so we just layed on our bed.  All kinds of strange and demented thoughts went through my head.  I started questioning who I was and my relationships with my girlfriend and my parents.  Things felt really depressing to me.  I am a lesbian and I started questioning if I was making the right choices.  It's hard to explain but I started to feel trapped in my life.",
  "After about a 1/2 hour which felt longer than the rest of the entire day, some friends of mine stopped over.  That pulled me out of the depression.  After getting a horrible sleep that night, the affects finally wore off.",
  "I will never touch any psychedelic drugs again.  Not because I had a horrible trip...but because it seems to bring too intense of a feeling and the depression lasted a couple of days after the intitial trips."
 ],
 "erowid": {
  "id": "580",
  "citation": " ~k~. \"Acid Depression: experience with LSD (ID 580)\". Erowid.org. Oct 3, 2000. erowid.org/exp/580",
  "substance": "LSD",
  "views": "11786"
 }
}
