{
 "title": "Dealing with Dependency",
 "author": "Respondent 101",
 "citation": " Respondent 101. \"Dealing with Dependency: experience with MDMA (Ecstasy) (ID 96995)\". Erowid.org. Jul 23, 2012. erowid.org/exp/96995",
 "substance": "MDMA (Ecstasy)",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   " ",
   "oral",
   "MDMA"
  ]
 ],
 "report": "<p>For the past three years (since I was 20 years old), I have been taking ecstasy. It started off as one cheeky pill in a UK nightclub, but within a couple of months I was loving the stuff, taking it every Friday and Saturday night, normally 2-3 pills on a Friday, and 3-4 on a Saturday. I found that I needed more on a Saturday than a Friday to bring me back to the same level as the night before. The first year or so of taking the drug was made up of fantastic experiences, and the comedowns weren't too bad. Sometimes I felt tired and worn out but my mental state was OK. A year or so later things had begun to deteriorate. I was still taking E on a regular basis, but more out of dependency than fun - I felt I could only enjoy myself on E and nothing else.</p><p>During the week I would feel depressed and very wound up. I wasn't sleeping properly and was having anxiety attacks. I found the only way to try to keep myself occupied in the weekday evenings and to aid sleep, was to go drinking. A bad move, a year later I was put on anti-depressants (Prozac) and my blood-pressure was high (dangerously so when having taken E even up to 4 days before), I was suffering pains around the kidney area, and my memory was a complete mess.</p><p>I tell myself I have tried to stop, and tell myself now as I write this that last weekend was the last time. Maybe it will be, but I'm sure it won't. In recent months I have tried to change my social life, hanging out with the few other friends I have that don't take the drug (I could name probably 50 people I know, and who have been out clubbing with or whatever, who take the drug once a week or so). I have begun to be able to enjoy myself more without it, but still end up taking Ecstasy every 2-3 weekends or so, and every time the depression or anxiety begins to kick in I tell myself it's the last time.</p><p>From my experiences, I would say that Ecstasy is a wonderful drug in the right context, it can bring out in you overwhelming feelings of happiness and love for people, if kept to moderate use, but the prolonged exposure to chemical happiness can affect considerably the users ability to be happy for real.</p>",
 "year": "",
 "id": "96995",
 "gender": "Not Specified",
 "age": "23",
 "timestamp": "2012-07-23T07:00:00.000Z",
 "views": "2199",
 "dose": [
  {
   "time": "DOSE:",
   "amount": " ",
   "administration": "oral",
   "substance": "MDMA"
  }
 ]
}
