{
 "title": "E, Tai Chi and Disenchantment",
 "author": "Respondent 8",
 "citation": " Respondent 8. \"E, Tai Chi and Disenchantment: experience with MDMA (Ecstasy) (ID 96997)\". Erowid.org. Jul 24, 2012. erowid.org/exp/96997",
 "substance": "MDMA (Ecstasy)",
 "bodyweight": "",
 "report": [
  "<p>The first drug I took was cannabis when I was sixteen. Some eight years later, in 1992, I tried half of a rhubarb and custard with my girlfriend and some other friends, now all Drs of Chemistry like me. Although not very strong, it made me think 'hmmm, there's something to this'. Anyway, enter Megadogs, full of ravers like myself, and a few of the best times of my life.\rTai Chi",
  "About this time I started doing Tai Chi. After about a year I was struck by the remarkable similarity between the 'inner peace and clarity' of the state of mind attained by about an hour of focus on Tai Chi and 100mg+ of MDMA. In fact, the closest I have ever come to the euphoria I experienced initially on E was by doing Tai Chi. The combination of E + tai chi was quite amusing, because any focus on my body or breathing in a tai chi way gave me waves of euphoria, regardless of how little or much effort I put into the exercise. Once the initial overwhelming tingles had subsided, I could also understand what my teacher was getting at. It seemed to make me far more sensitive to my own body's energy and enabled me to correct my posture to ensure more effective energy flows. I used to do tai chi and E at raves, and it enhanced the E feelings enormously. I think the sensations (enhanced by 4/4 beats and all that) can be extended to this idea about focus on breathing and 'internal' rhythms.\rDisenchantment",
  "After a couple of years, I found that the honeymoon period was drawing to a close. What was missing? After talking to lots of disenchanted clubbers I came to the conclusion that MDMA feeds on excitement and novelty. After a while, the brain assimilates a lot of experiences, and comes up with an 'ideal' which must be met in order to have a good night: good music, friendly doorstaff, no queues for the toilets, room to dance-yet a feeling that the dancefloor is full and intimate, cool conditions, smiles from strangers, all the people you are with having an excellent time, free water, interesting light shows etc, etc. Many now only use amphetamine because they get too disappointed compared with the euphoria of their first few times.\rAlternative",
  "I've now developed some tai chi exercises that I can do without looking too conspicuous at raves, and are quite an acceptable alternative to MDMA. Although tai chi can never re-create the oneness and empathy of initial E experiences, no one has the crushing disappointment that a 'pear-shaped' evening on MDMA can generate.",
  "MDMA is an astounding discovery. It has helped to change the way I think, and I don't know anybody who hasn't found it fascinating and enlightening. If used intelligently I think it has tremendous potential as a therapeutic tool.",
  "P.S. Best quote about the subtlety of MDMA (from my brother, the first time he tried it). 'Do you think this is working? I don't know, but would we be on the stage otherwise?'",
  "A British university teacher of organic chemistry</p>"
 ],
 "year": "1992",
 "id": "96997",
 "age": "24",
 "views": "1315",
 "dose": [
  {
   "time": "0",
   "administration": "oral",
   "substance": "MDMA"
  }
 ],
 "submissionDate": "2012-07-24T07:00:00.000Z"
}
