{
 "title": "Coming Down from the Clouds",
 "author": "Respondent 96",
 "citation": " Respondent 96. \"Coming Down from the Clouds: experience with MDMA (Ecstasy) (ID 96993)\". Erowid.org. Jul 23, 2012. erowid.org/exp/96993",
 "substance": "MDMA (Ecstasy)",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   " ",
   "oral",
   "MDMA"
  ]
 ],
 "report": "</p>Disillusioned e-user 'comes down from the clouds'</p><p>As a recreational drug user for over 12 years I've travelled through the low and high roads of most drug fads worth remembering. Like many small-town teenagers in the mid 80's I was fairly sheltered from drugs and never really knew what to expect when I finally indulged. Drugs like cocaine, speed, and crack were passed around from time to time but never seemed to have the same effect on me as it did many of my friends. I never wanted to buy more when supplies ran out, I always slept 8+ hours a night and I could never experience orgasm when 'high'. Not much of a bad trip at all, just a fair waste of money and time.</p><p>It wasn't until years later when a friend of mine began dealing in LSD that I began to experience glorious, psychoactive trips that lasted sometimes for days. After a few months I was embezzling hundreds of dollars a week from my job just so I could spend more time tripping, drawing, writing, recording, etc. Although I would never suggest someone endanger their freedom for inner peace I would have to admit I found my soul deep into a three-day psychedelic experience funded by money stolen from the large corporation I was employed by.</p><p>Years later, after a long hiatus from every type of drug other than weed, I met a young kid who offered me a few hits of ecstasy in return for a ride home from an all-ages show. He hadn't met up with his friends as planned and had two hits left over. After my weak attempt at a 'no thanks' he placed them in my ashtray and said I could probably use a break anyway. A few minutes later we arrived at his sister's house and he waved goodbye as I pulled away from the curb with a couple of speckled pills in my possession.</p><p>Within three days I could no longer resist and I swallowed one before going to a BT concert downtown. It had been years since I had been to a show in a small club and I was overwhelmed by the culture of joy percolating both on and off the dance floor. Nobody was facing the stage or fighting for a vantage point, in fact you couldn't even see the 'band' through the dry ice and lights. Strangers were dancing, touching and rubbing each other without the aggression or lust of past experiences. It was nothing short of paradise.</p><p>And whether by coincidence or not, my graphic design business tripled in revenue shortly therafter and I began a year-long pleasure trip courtesy of my e-enabled libido. I had money, cars, love affairs (both hetero and homosexual) and a bright outlook in every direction. The music being produced at the time seemed to forecast some type of perfect communion between fantasy and reality with no dark clouds to speak of. But as all good things begin they also soon end.</p><p>As silly as it may sound, I came home one night after a good roll and found my 9 year-old cat dead in my front yard and lost it completely. I laid down in the grass and stared at the stars and cried for what seemed forever. I thought constantly of death, failure, loss and fatigue for months afterwards. After a small internal depression I opened up to my family and wife about my feelings and found out I had not really been floating around free of problems for the last year, but had instead been slowly pushing away everything that disagreed with my 'e' philosophy until nobody around dared contradict my beliefs. Among other things, my mother had been diagnosed with cancer three months previous and she hadn't told me because she didn't 'want to ruin things' for me. My wife, who I thought was perfect and strong, was afraid to tell me she too was depressed because she thought I wouldn't want to deal with it.</p><p>What I found was a lot of people waiting for me to come down from the clouds and begin sharing in the good and bad of being a real person again. What seemed like a gift was just another shortcut that eventually led to nowhere of importance. And although I came away with a new-found sense of faith I'm also left with deep fears of how numb I actually became to myself and others. When I think of the accessories to the lifestyle - the music, the sex, the clothes, the cover charges - I wonder how long before enough 'floaters' reach the end of the rope and realize what b.s. it all was.</p><p>But for those still caught up it in all, enjoy the view from up above and try not to fly away from yourself forever....it sucks even more on the way down.</p>",
 "year": "",
 "id": "96993",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2012-07-23T07:00:00.000Z",
 "views": "1076"
}
