{
 "title": "Profoundly Changed My Life",
 "author": "Respondent 58",
 "citation": " Respondent 58. \"Profoundly Changed My Life: experience with MDMA (Ecstasy) (ID 97008)\". Erowid.org. Jul 23, 2012. erowid.org/exp/97008",
 "substance": "MDMA (Ecstasy)",
 "bodyweight": "",
 "report": "<p>Incredible E experience that has profoundly changed my life</p><p>I have sat down to write about an experience that has profoundly changed my life. I have all these emotions inside which need to be expressed, and writing them down seems to be the most natural outlet for me now.</p><p>I first took ecstasy with some friends in Toronto in May 1997. I was scared and unsure about taking it because I was totally in the dark about this drug and had no idea what its effects would be. I had always promised never to touch drugs apart from marijuana, however curiosity overcame me, and I dove in, snorting the white powder up my nose and feeling guilty and like a junkie. The chemical taste in my mouth was horrible and as I gulped massive amounts of water I began to question what I had just done. We waited for some time and slowly it began to take effect. The evening was wonderful, shared with a few close friends in their apartment. We spent much of the time dancing and then laying on the floor listening to amazing techno. The food and coffee we shared was the best I had ever had in my life.</p><p>I now see that event as a stepping stone to a higher level which I experienced this weekend on E, a trip which seemed 10 times better. Myself and friends were invited to a wedding on a small island up the coast of Vancouver Island. As soon as I set foot on the small island, I knew that it was truly a special place. Everyone there seemed to be enjoying life and in touch with themselves and with nature. There we met Gabriel and Gary, two beautiful people whom I didn't even know up until this point, but by the time we parted, I felt as though I was losing my best friends. The five of us spent the next few days together on the island. We camped the first night and awoke to the amazing scenery surrounding us in awe.</p><p>The wedding was that afternoon on some bluffs overlooking the blue calm waters of the Pacific. It was truly beautiful. The people getting married had so much positive energy and the surroundings were unreal. The day God gave us was sunny, warm, unforgettable - we were truly blessed that day I feel. Our excitement for the after wedding rave mounted by the second. Gabriel gave us each speed/caffeine pills, and we headed up the trail in the darkness, being drawn forward by the pulsating bass. We entered the grounds and stared around in delight. It was in the middle of a field, with the DJ booth up near the front decorated in tinsel, there was a tent shaped like a mushroom with a flashing strobe light, a stand with energy balls, FREE water and free smoothies (a major bonus to the evening!!!) and an oasis of trees with a couch and comfortable chairs, encircled by Christmas lights.</p><p>We managed to stake out the couch as our gathering area and put down sleeping bags as there was a slight chill in the air. The caffeine pills started to kick in and I began to feel my heart pump faster and my body begin to move to the music. People near us were swallowing capsules of E and we decided that we would see if anyone was selling, but although we searched the whole grounds no one had any. We all sat on the couch in nervous anticipation, each of us wanting to feel it so badly it almost hurt. We waited more than an hour, and it seemed like the evening would be fruitless. We remained on the couch talking. Everyone was in their own groups, eating and talking, smoking, or consuming their drugs. I started to worry that the whole evening would be this way, that everyone would remain with their friends, and not mingle freely and openly with each other, like I had heard they did at raves. This was my first one, and after hearing stories from a few friends about how amazing they were, I was filled with nervous energy, not knowing what to expect of the evening. I don't think in my wildest imagination I could have known what it would be like.</p><p>Finally the wedding couple arrived with some E's and we each had one capsule which we swallowed together. I grabbed the capsule hungrily and emptied it all onto my tongue. Once I felt the chemical sensation on my tongue I bought a drank of ginger beer and sat down to wait. We all sat for a while, quite silently, and impatiently waiting for it to kick in. I felt nothing for some time. All of a sudden, Pedro leapt off the couch screaming, I'm rushing!! I have to go dance!! He disappeared into the crowd of dancing bodies up at the front. This was after five minutes. I was quite surprised, and began to wonder when it would finally hit me. The amazing thing is you sit there and wait, and then suddenly without knowing it, you have entered a blissful state.</p><p>My first indication that I was rushing was that the beat of the bass from the techno began to fill my brain and I was unable to sit still any longer on the couch. I reached the middle of the dance floor and let the music take me to heights I never dreamed imaginable. I lost all self consciousness, and felt in tune with the music, as though the bass was a life force and I was connected to it. My movements became fluid and I was able to dance along with it in utter freedom and abandon. I forgot that there were other people around me dancing and entered a state which I can only attempt to describe. In the mushroom tent the flashing strobe light combined with the E produced visions of shards of purple and white lights flashing around me and on the ground, with the faces of the people around me swimming in the light. Everyone else was on their own trip, yet I felt connected to them because we were all experiencing the same amazing feelings. I returned to the main dance floor, where the music encompassed my whole body and lifted me. I put on my dark sunglasses and lost myself once again.</p><p>A feeling of utter and sheer joy shot through my body making me vibrate and glow with warmth and energy. I felt a feeling of incredible love. It was as if at that moment I understood what love really is, I felt as though I understood so many things than ever before, the mysteries of life opened up to me. While this was happening, I realized that I wanted to share this with my friends; I wanted to be with them in this experience. I went back to the couch and a couple of them were still there, feeling really good they said and they didn't want to move from the couch. I however was soaring and decided to return to dance. Shortly thereafter I was joined by Gabriel. I was so happy to see him, he came up to me and we looked at each other and just hugged each other, knowing exactly what the other was feeling without needing words. 'Isn't this incredible' he uttered, and at that moment we both looked up at the stars. As this island was far from the city lights, we could see the entire night sky, including the milky way. I looked up at the stars and was almost shocked to tears by their sheer beauty. Gabriel and I held hands while enjoying the moment, and then we began to dance.</p><p>I must have spent the next several hours dancing, time lost all meaning. I was filled with an energy I had never known, and I was able to dance effortlessly without tiring once. I looked around me and everyone was lost enjoying the truly ecstatic feeling that this amazing drug brings. The music was absolutely incredible too. A DJ named Akira came on whose set was composed mostly of Goa trance. It was at this time that I was peaking and so were most of the people at the party, so we were all able to share the experience together.</p><p>I realized that I hadn't seen Pedro or Lorna in a while and tore myself away from the hypnotic music for a moment to check on them at the couch and then returned to the dance floor. It was there that I saw Gary. I looked into his eyes and grabbed his hand. 'Do you want a hug?' he asked instinctively. I said yes and we hugged warmly, I felt the heat from our bodies enveloping each other. It felt so wonderful to be touched. I asked him how he felt, but I knew it just by looking at him. He described what an amazing rush he was having, and soon after we were joined again by Gabriel. Gary and Gabriel hugged each other unashamedly and then the three of us hugged tightly, not moving for a few minutes. Then we broke away and became absorbed in when I danced uncontrollably, totally losing myself in the music. Everyone around me was caring and warm. If you bumped into anyone, or vice versa we would say sorry and then sometimes hug. People shared candy and lollipops with each other. At one point I was dehydrated and a girl I didn't even know went and got me a bottle of water. I felt so incredibly grateful. I was amazed at how unselfish everyone was. Everyone kept saying 'Why can't everyday be like this!!!'</p><p>I felt love that night, and I saw that human beings could be wonderful and beautiful. Before this weekend I had been feeling untrustworthy and frustrated by people, but now my outlook has completely changed. It was so easy to go up to anyone and just say hi and ask how they were feeling. Everyone was enthusiastic about sharing and describing what they were experiencing. Everyone smiled and hugged each other. I felt that at that moment nothing could ever be more perfect, nothing could be better, nothing could ever feel this GOOD!!! I felt that life was something wonderful and precious, I felt that life was something so much more than I had ever understood it. Everything I touched felt wonderful, all the colours before me were so alive. I suddenly felt like I knew exactly who I was and what I wanted out of life. I reached a state of amazing clarity and purity. My friends looked up at me and smiled, taking pleasure in the fact that I was taking pleasure. Everything was revealed to me that night it seemed. I felt all inhibitions and boundaries fall away from me. Everyone there seemed like a beautiful person, inside and out. I felt like no one was judging anyone, everyone and everything was accepted. I wondered again why life couldn't be this way always, why it took a chemical to achieve this kind of bliss.</p><p>I looked over and saw a group of people all giving each other massages, and I was filled with a strange sense of love towards them. I approached them and without even asking them they immediately told me to sit down and join in. I met a guy named Q, who gave me the most wonderful back massage, the feel of his hands on my body felt absolutely amazing. A girl came around and gave us each stickers and glitter to put on our faces. It was like she was giving me the most amazing gift, in fact any time anyone gave me anything I thanked them as if from the bottom of my heart and we hugged.</p><p>The vibe at this party was very very positive. It was small, about 200 people, which was really nice I think. That way I was able to interact with almost everyone who was there. I started feeling really really good, and sensual. Q took me by the hand and led me into the woods. However not for one moment was I afraid or did I think something sexual would happen. In fact sexual thoughts were the last thing on my mind. I was just really enjoying being with this person whom I didn't know at all, yet I knew completely. We walked to a swing in the forest, which we both stood on, and then looked up at the dark canopy of trees above us while we swung, a truly trippy experience. I leaned back sighing, and crying out how good I was feeling. We kissed each other and hugged in the forest. Then I told him I needed to get back to my friends, and he completely understood. We hugged each other some more, enjoying the feel of each others bodies. I saw him a few times later that night but we didn't' speak again.</p><p>I returned to the couch, where told me to come sit next to him on the couch. We spent the next little while in each others arms, caressing each other. Skin felt so amazing it was unreal. It felt so wonderful to be sharing this experience with him, we hugged and remained close to one another, feeling love toward each other, not saying anything, just groaning in sheer ecstasy. We both felt as though we were bonding on some spiritual level. Eventually we both lay back on the couch our heads reaching the ground and felt the drug take its effect. I was unable to move, and lay there with eyes closed for some time feeling something that was so intense it was unbelievable. All I can say to describe this is that I felt a very very powerful feeling of love and warmth flowing through me, unlike anything I could have imagined. I guess I could say it was similar to having an orgasm for several hours straight.</p><p>The music was more than just music this time, it was something else entirely, something I can't fully explain. It seized me, took hold of me, and transported me somewhere else, put me in touch with my feelings, and towards the people around me. I knew everyone else was feeling the same way. At some points, Akira would tease us with the music, building up our anticipation until it was almost unbearable then plunge us into a loop and a beat that overtook me. At many points when the music was particularly good, I screamed out. Sometimes we would all scream together, and wave our hands. It was such a release!!! To be able to just shout and scream in almost animal abandon because your emotions were so strong. Gary and I ended up right in front of Akira the DJ's, with the speakers pumping that mind bending bass right into our brains. When they played something good I gave them the thumbs up and they smiled at me. They were having as much fun as we were. A girl gave me some tinsel from the DJ booth and I wrapped it around me like a boa. I felt like I was beautiful.</p><p>It was then that I suddenly looked around me and realized it was getting light. I could hardly believe me eyes. Where had all the time gone?? Could this dream be ending?? I started to start to come down a bit but the feelings were still strong and powerful within me. The people who organized the event set out fruit on the table. I beheld all this with delight. I devoured the fruit as though I handout eaten in weeks. Each bite made my taste buds explode with pleasure. As more people came to the table I would hand them some grapes or a piece of melon and tell them to try it and they would cry out with the ecstasy of eating and enjoying the food to the fullest.</p><p>As the sun rose I stared around me at the beauty surrounding me, not only in the surroundings but in the people. I felt as though I was awakening from a very powerful dream. We sat on the couch for the rest of the time, not speaking much, hardly believing what had just happened. It all felt so unreal. I started to come down and suddenly felt very very cold. I dove into my sleeping bag and remained there for a few hours, dissolving into a deep, profound sleep. My friends were barely able to wake me up from it, and it was with regret and sadness that we packed up our things and started to leave the site at around 8 am.</p><p>We hugged a lot of people on the way out, saying goodbyes as though we were all old friends. The saddest part was knowing we probably would never see each other again. We all felt incredibly exhausted and completely worn out. We went to a nearby beach where we crashed for around three hours in the sun. I was really really out of it, hardly coherent at this point. The sleep made me feel a bit better but I knew I needed a lot more to recover from it all. One of the side effects was a really bad jaw clench which bothered me the whole next day. My jaw felt so stiff I could hardly open it.</p><p>We spent the next day in somewhat of a daze. We all talked about our experiences with each other, and reliving the evening made me feel closer to the four of them. One thing Gary said has stuck with me. He said 'last night is the closest I ever came to feeling part of a tribe.' I enjoyed food more that day, and I especially felt really in touch with nature.</p><p>The whole day I also felt as though I had made some sort of philosophical discovery, I felt as though my life had changed, and for the better. I still felt quite out of it the whole next day, spilling coffee on myself, not able to drive properly etc. A feeling of peace and calm was within our little circle that day. I felt as though we had become a closely knit family. It was as though we all had a new appreciation for one another the next day, as though we understood each other like no one else had before. I especially felt as though Gabriel and I had a new kinship. We made a bonfire on the beach that night and sat around it watching the stars, and realizing with sadness that we would have to leave this place, this wonderful island filled with nature and harmony, a place where we had experienced something special and real. I could hardly bear the thought of leaving. It was like were leaving a Garden of Eden or something.</p><p>We left the island the next morning, and even as we were sailing away on the ferry I felt depressed. Returning to reality since then has been difficult I must say. We spent the day at the beach on the west coast of Vancouver Island, which was a beautiful drive. It gave us all time to be alone with our thoughts. I finally felt like myself again that day, yet I was left with a feeling of thoughtfulness. I haven't stopped thinking really since then. The five us of spent the day together and took the ferry back to the mainland that night. We all knew that we would have to part soon. Gabriel left us that night to continue up north to visit a friend. We said goodbye to him on the highway. I wonder if I will ever see him again. I miss him so much already.</p><p>I was supposed to start school today but was unable to deal with any of it. I met my friends at the campus and they were also unable to cope with being back in the city. It was as if all of our stress levels had increased overnight, and it was depressing. We were all having problems dealing with going back to our 'normal' lives so to speak. I wondered how I would ever deal with it again. Gary said, 'How can we go back to being the way we were after experiencing that? I could die now and be happy, I have felt true happiness.' I understood how he felt. I eventually returned him to the hotel where he left for the airport and where I said goodbye to Lorna and Pedro. On the way home in the car I burst into tears. For a number of reasons I suppose. Sadness that the elation, the euphoria of that weekend has ended, sadness that the people I felt so close to now where gone, and who knows when I'll see them again. I feel like something is missing right now, in fact I feel pretty depressed. What a powerful trip!!! Coming down from such heights has been hard.</p><p>I now know that this weekend has changed my life. And for the better. Its not just the E, I mean I feel like I have really learned something from all of this. It is hard to put into words, really it is. Basically I feel more in touch with myself and my feelings. I feel like I know where I am heading in life. I have always felt kind of unguided, uncertain of my future. I think if I can find harmony in my life, find a soulmate like the people who got married and reach the kind of bliss I felt and saw on that island, then I can really be happy. Life seems like a wonderfully exciting adventure to me now, just full of experiences waiting to happen. LIFE!!! Its something to be tasted, something to be lived to the fullest. Its something deep, that I felt I could never understand. I feel like many of the mysteries of life were revealed to me this weekend, but I feel like I am only just beginning to understand, but I am on my way now. I wonder if people live their lives and never reach this kind of spiritual understanding. I think and hope that if I continue down this newfound path I will eventually reach that point of true happiness and understanding which we should all aspire to every day of our lives.</p><p>I feel like a new person, I feel like a joyful person, and I want to share this joy with others. I want to love and be loved. I hope that what I have described can maybe help others learn too. That is basically why I wrote about this experience. It was too powerful to keep to myself. I'm</p>",
 "year": "",
 "id": "97008",
 "gender": "Not Specified",
 "timestamp": "2012-07-23T07:00:00.000Z",
 "views": "1588",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "1 capsl",
   "administration": "oral",
   "substance": "MDMA"
  }
 }
}
