{
 "title": "Helps Me to Live with My Schizophrenia",
 "author": "Respondent 39",
 "citation": " Respondent 39. \"Helps Me to Live with My Schizophrenia: experience with MDMA (Ecstasy) (ID 97002)\". Erowid.org. Jul 23, 2012. erowid.org/exp/97002",
 "substance": "MDMA (Ecstasy)",
 "bodyweight": "",
 "report": "<p>I cannot give you my name or even where I am from, but let me assure that everything I write here is true. I was diagnosed with schizophrenia at an early age, which is considered worse than if it develops at later. To treat this disease, I have been prescribed just about every psychotropic drug imaginable and none of them even compared to the effects that ecstasy has had on me.</p><p>Ecstasy has allowed me to see my disorder in a whole new light. I went from being an asocial, withdrawn, and somewhat paranoid zombie to a sensitive human being who experiences love and every other human emotion. I had never really felt much love in my life until I had experienced ecstasy, and I am convinced that I would have committed suicide by now without it.</p><p>You see without love a human being just withers away and dies, sometimes slowly and sometimes abruptly by suicide. You can live for a long time without love, but in the end you will die before your time. This is what many schizophrenics do everyday, they live without love. As a result, an alarming large number of people with this most tragic disease take their own life.</p><p>For me, ecstasy is not simply a party drug (although, I did use it at parties), it was much more than that. Ecstasy is the most effective medicine that I have found to date in treating my schizophrenia. It is not a cure, and it is not conventional medicine. By conventional medicine I mean a drug which directly treats the symptoms. No, ecstasy has worked for me in a different, but very equally important manner.</p><p>Ecstasy has helped me to live with schizophrenia. You see the medication that is currently given for schizophrenia helps to limit the symptoms (and it does so in some cases more than others), but you are left on your own to deal with whatever symptoms that may remain. Ecstasy helps to bridge that gap, it helps you to live with whatever symptoms you may have that the medication doesn't help with. I still live with paranoid symptoms everyday, but I am now okay with that. I accept myself for who I am, I can live with being schizophrenic. It was ecstasy that helped me come to these terms.</p><p>I came to this realization with just myself and ecstasy, I had no therapist to guide me in this area. I've had lots of therapy, but none of it really compares to what ecstasy and myself have taught me. One can only imagine how much better ecstasy therapy would be for me if I had an experienced therapist to guide me.</p><p>I continue to use ecstasy, and I will continue to use it in limited amounts until something better, or a cure for schizophrenia comes along. I do want to make it clear that ecstasy is in no way a substitution for the proper medication in dealing with schizophrenia. Medication remains essential in keeping this disease in check. Ecstasy is simply another kind of medication that should be used (infrequently) to supplement the more traditional medications.</p><p>Anonymous email</p>",
 "year": "",
 "id": "97002",
 "timestamp": "2012-07-23T07:00:00.000Z",
 "views": "1625",
 "dose": [
  {
   "time": "0",
   "administration": "oral",
   "substance": "MDMA"
  }
 ]
}
