{
 "title": "Senior Executive's Viewpoint",
 "author": "Respondent 12",
 "citation": " Respondent 12. \"Senior Executive's Viewpoint: experience with MDMA (Ecstasy) (ID 97004)\". Erowid.org. Jul 26, 2012. erowid.org/exp/97004",
 "substance": "MDMA (Ecstasy)",
 "bodyweight": "200 lb",
 "header": [
  "DOSE: T+ 0:00",
  "120 mg",
  "oral",
  "MDMA",
  " T+ 1:30",
  "120 mg",
  "oral",
  "MDMA"
 ],
 "report": "<p>Potential for training in business / A senior executive's experience and viewpoint</p><p>My wife and I are both science graduates and I am a business manager with a large company. Obviously with our background we feel we are better educated than the average recreational drug user, and we both applaud your crusade against ignorance, especially with regard to non-addictive substances such as marijuana and MDMA. I have taken MDMA about 30 times over the past 2 years, after being introduced to it by a friend. Prior to that I had no experience of drugs, other than being a social drinker (I have never smoked). Although we almost exclusively use MDMA in the typical nightclub environment with friends, I am becoming more interested in alternative uses - in particular its possible role in improving performance at work.</p><p>I am absolutely convinced that if you were to take a sales team away for a weekend and gave them a couple of sessions on MDMA you would definitely see marked improvements in performance. The increased empathy with others would help them sell more effectively since they would be more aware of the customers situation (and also their personality and what matters to them), but also they would feel an enormous sense of togetherness with their other team members.</p><p>We only take MDMA in the UK, since the quality in the US is poor, and since it is much harder to find clubs which play the type of music we like (UK house), we don't want to have a disappointing experience. As I mentioned, we only take MDMA on a night out with a group of close friends. For us, the most satisfying and enjoyable aspects of MDMA use (in this setting) are:</p><p>1. The almost childlike pleasure of being able to meet people without the usual barriers we put up to defend ourselves in normal situations. This applies (for me) to being able to meet other men for the first time without any trace of initial hostility, and being able to approach women without it being perceived as a sexual advance.</p><p>2. Enjoyment from being able to dance with absolutely no self-consciousness, and also from feeling 'at one' with the music - the ability to effortlessly dance in time with the music (whether real or perceived).</p><p>3. Completely forgetting the outside world and the stresses associated with a very demanding job back in the US, and also for us, the relief of not having to constantly deal with the subtle differences in society encountered by expatriates abroad.</p><p>4. Seeing others enjoy themselves so freely and completely.</p><p>I am sure MDMA use can be enjoyable and rewarding outside the nightclub setting, though we are both reluctant to try it since we feel that without the combination of light, music, surrounding and other people on MDMA, the experience will be disappointing.</p><p>Since I have taken MDMA over 30 times, I will try to describe my impression of the effectiveness of the drug with sustained use. I am fortunate in that I have a good supply of pure MDMA. I weigh 200 pounds and am physically in good shape with about 12-15% body fat. I normally take a dose of 120mg with an additional 120mg at T+90min. I have also found that a small amount of speed taken prior to the first dose prolongs the effect of the MDMA. On a longer night (we usually go until 3.30am, but sometimes we continue elsewhere until about 7 or 8am) I have found that a very small amount of speed prolongs the effect of the MDMA rather than taking another dose.</p><p>One time I took 1/4 to 1/2 a dose of LSD, which was very interesting. It seemed to prolong the effect of the MDMA, and while not causing any visuals. Once I looked at a person I didn't know, and I convinced myself they were someone else - someone I knew.</p><p>More recently, we have been experimenting with GHB (sodium gamma hydroxy buterol). GHB is normally used for inducing REM sleep, but if it is taken with the MDMA, it acts to enhance the MDMA effect. A word of caution, though - taking GHB in liquid form while in a hot nightclub one can easily take to much - and an overdose will rapidly induce a coma. This is especially dangerous since hospital staff don't know how to deal with GHB overdose.</p><p>Although much has been written about the decrease in effectiveness of MDMA with use, in my experience, after the first 1 or 2 times which seemed more intense (although this was probably due more to the novelty of first experience), I have found no drop off in the intensity of the effect. What is much more important is the mood, setting, company and music. We take great care to optimize these variables, or wait for the right time. It is also true to say, however, that I generally have 3-4 months break in between doses.</p><p>I have definitely experienced small changes in my personality which I believe (hopefully) are irreversible. The main change is the feeling of empathy with others, and the ability to understand other points of view. While I still feel stress, an experience with MDMA definitely reduces stress for a period of weeks. These points interest me most, since I work in highly competitive sales situations.</p><p>When we got home, she said she felt compelled to write down her experiences. What was interesting was that at the time she wrote it she could not communicate verbally very well, yet her handwriting was so beautiful. At first felt she would not be able to write legibly, but once she started she found it no problem at all.</p><p>I hope these random thoughts help in some way - overall I can say that MDMA has had a positive effect on both our lives and our relationship. I have no desire to try harder drugs such as Cocaine and Heroin, and whenever we go out socially, my alcohol intake has dropped considerably. In fact I find it sad that people drink heavily in attempt to get to a place only MDMA can take you. Of course it can never be achieved with alcohol, and had they experienced MDMA, they would quickly realize the futility of their efforts. I think once you have used MDMA, you see the negative aspects of alcohol, and therefore tend to drink less.</p><p>The only slightly negative aspect of my experience of MDMA is that I have found it more difficult to get along with one of my closest friends - a heavy drinker who has never tried MDMA. If only he would try it we would have our close friendship back... If only we could use MDMA to treat alcoholism!</p><p>English man living in the USA aged 40</p>",
 "year": "",
 "id": "97004",
 "gender": "Male",
 "age": "40",
 "timestamp": "2012-07-26T07:00:00.000Z",
 "views": "7043",
 "dose": {}
}
