{
 "title": "Honesty Towards Men",
 "author": "Respondent 13",
 "citation": " Respondent 13. \"Honesty Towards Men: experience with MDMA (Ecstasy) (ID 97016)\". Erowid.org. Jul 23, 2012. erowid.org/exp/97016",
 "substance": "MDMA (Ecstasy)",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   " ",
   "oral",
   "MDMA"
  ]
 ],
 "report": "</p>\nI have just started taking e this year, and I'm already 27! I believe that at any time we can ask for guidance from our guardian spirits and I do that all the time.</p><p>When I'm on e, it seems like the channels are super clear and I can receive a lot of advice and insight in a very short period of time. For example, last time I felt this, I was advised by my guardian spirits that 'honesty towards men,' meaning the guys I encountered, was one of my life purposes here on earth. They encouraged me to speak exactly what was on my mind to the men in my life, not to hold back for fear of hurting them or having them think poorly of me.</p><p>In the past I've had a hard time communicating exactly what's on my mind. Example, I've tried to be nice to men who've pestered me, wanted to go out with me even though I wasn't interested. I'm finding it easier to tell them I'm not interested. And if I am interested in a man, it's easier for me to tell him that, too. On e, I feel especially open and honest, though I always try to be nice (I don't just tell guys to fuck off or anything.)</p><p>For example, I had spent a really nice evening with this guy, all night in fact, and I thought we were getting on really well. I went to see his band play the next night and he was really cold to me. Made me feel like shit. In the past I may have just bitched about it to my girlfriends or something, but I wrote him a letter the next week with some pictures I'd taken of him and thanked him for the time we had spent the first night, but I also said I didn't understand why he'd been so cold to me after we'd had such a good time! He hasn't written me back or anything, but perhaps he'll think about the way he treats the next girl (I hope, anyway.)</p><p>There were some other things, like ideas for songs (I am a singer, musician and songwriter); a feeling of being looked after and cared for and a feeling of being truly 'in the moment' that accompanied my experience of e.</p><p>At the very least, when I'm on e I experience a lot of love for my friends and for the music. The only bad experience I had was when someone sold me some shit and passed it off as e!</p><p>From a 27 year old American woman</p>",
 "year": "",
 "id": "97016",
 "gender": "Female",
 "age": "27",
 "timestamp": "2012-07-23T07:00:00.000Z",
 "views": "911"
}
