{
 "title": "Helpful and Difficult",
 "author": "Respondent 10",
 "citation": " Respondent 10. \"Helpful and Difficult: experience with MDMA (Ecstasy) (ID 97018)\". Erowid.org. Jul 23, 2012. erowid.org/exp/97018",
 "substance": "MDMA (Ecstasy)",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   " ",
   "IM",
   "MDMA"
  ]
 ],
 "report": "</p>\nA doctor's wife describes her experiences with E and her relationship</p><p>[How Ecstasy both helped a relationship and made it difficult]</p><p>The first time I experienced Ecstasy I was in a small group of people. I was given an IM shot and felt as though I had become golden. As though my inner vision was enhanced I saw a friend as though she was clear crystal. Another friend had a shoulder pain and I saw a green ball of light above his shoulder. With my intention I brought the light into his shoulder and brought the loving energy into him. The feeling was one of love, closeness and gentleness.</p><p>Other times I felt both 'contact high''s and also some fear/excitement/anxiety so that my body began to shake. I learned several ways to make the experience easier on me physically. A small quantity of xanax about twenty minutes before (I never take this, valium or anything else at any other times), putting on warm socks and dressing warmly because I get very cold, setting the scene with the right music, etc.</p><p>One of the most memorable experiences with Ecstasy occurred when I was sitting outside (wrapped warmly) and feeling one with the stars and the universe. Ecstasy was both helpful and difficult for my relationship with my significant other. He is a physician (hence the mode of giving Ecstasy usually). He has also experienced many mind altering substances and I have only tried Ecstasy (and later together with ketamine). I found that we became so intimate when stoned that when we returned from the experience we often would somehow create an argument so that we would be more distant - sort of like a yo-yo effect. In the end I found it so disruptive that we stopped doing the Ecstasy. I had one experience of it orally a few months ago after many years. This experience was beautiful and I felt spiritually connected as before.</p><p>Above are briefly some of my experiences with Ecstasy. I am writing because I think that overall the substance has a spiritual benefit when used judiciously. There would be potential for its use in therapy as I know many have already demonstrated. A danger is for someone with insufficient ego structures or a tendency to merge with another spiritually to 'lose' themselves. I would be happy to share my experiences further with an intention of creating some sort of a protective protocol for those who would like to use the enhanced experience Ecstasy can provide. I hope this is useful.</p><p>Woman, US</p>",
 "year": "",
 "id": "97018",
 "gender": "Female",
 "age": "Not Given",
 "timestamp": "2012-07-23T07:00:00.000Z",
 "views": "1148"
}
