{
 "title": "E Brings Out True Emotions",
 "author": "Respondent 57",
 "citation": " Respondent 57. \"E Brings Out True Emotions: experience with MDMA (Ecstasy) (ID 97014)\". Erowid.org. Jul 23, 2012. erowid.org/exp/97014",
 "substance": "MDMA (Ecstasy)",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   " ",
   "oral",
   "MDMA"
  ]
 ],
 "report": "<p>E is definitely a drug that brings out the true emotions a person has inside of them. It has made me really bond with some people. But other times I have regretted using it.</p><p>One of the first times doing E was with a person I was already interested in. The rave that night was incredible and I spent the entire time with that one person, just bonding with her. And I really felt a true sense of pure happiness. But things didn't work out as planned as I was leaving for a long getaway. That night had been one of the most enjoyeable of my life, and the feeling had been mutual. I ended up leaving, planning to stay away from home for a year. The whole time away from this person I had ended missing them so much I decided to come back after only three months.</p><p>We both were not sure of how we wanted things to be when I came back. But we agreed to see each other still. I really looked forward to the next time I would be able to drop E with her again, but the anticipation turned out to be the only thing I enjoyed that night.</p><p>When we kissed on E our very first time the feelings were so intense, but the night of this rave our kiss was not even close to that. I wasn't even turned on by her anymore. I couldn't believe that such intense feelings could disappear just like that!</p><p>But if I couldn't even enjoy it on E then I realized that this was not going to work with her, and I know she felt the same way about things. I thank the E for really waking me up, instead of faking my emotions and lying everytime I tell her I care about her.</p><p>- From Canada</p>",
 "year": "",
 "id": "97014",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2012-07-23T07:00:00.000Z",
 "views": "1127"
}
