{
 "title": "Changing Sexual Roles",
 "author": "Respondent 61",
 "citation": " Respondent 61. \"Changing Sexual Roles: experience with MDMA (Ecstasy) (ID 97026)\". Erowid.org. Jul 23, 2012. erowid.org/exp/97026",
 "substance": "MDMA (Ecstasy)",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   "1.5 tablets",
   "oral",
   "MDMA"
  ]
 ],
 "report": "</p>\n[Experiencing your partner's feelings]</p><p>My wife & I have been occasional users of E for the past 6 months. Married for 3 years, we're both 26 years old and live in New York. We have, what we consider a completely open and caring relationship. Likewise, our sex life is healthy and exciting. What happened during this experience on E has opened up an entirely new dimension to an already full sexual understanding of one another.</p><p>We each took 1 1/2 tablets, which was an increase from always just 1 tablet each. In the beginning, we had our normal E rush. We began to talk enthusiastically about our lives and each other. As far as we know, everything was as it usually was up until the 3rd hour after taking the E.</p><p>Then, it started. We were holding each other, still talking, when the conversation abruptly changed. (We have, in the past discussed what it would be like to trade bodies for a day to experience what we can never know in reality.) We began to talk about switching bodies. The more we discussed it, the more fascinating, and real it became.</p><p>Rapidly, we advanced into touching each other in ways that represented our 'new' sexual identities. My wife soon became convinced of her loss of femininity and the rise of everything male. Likewise for myself. We both, through discussing how we felt as our new selves, and describing how each other felt we began to 'become' the opposite sex.</p><p>The next three hours were as sexually intense as any of our best experiences together. Regardless of the fact that neither of us, for a second, had real body parts even resembling what we were fantasizing, the MDMA carried us through a vivid and totally believable experience. We went through all the energies, emotions, and positions of love-making. My wife did things to me that I would do to her and vice versa. We were able to, in a way, re-enact all of our sexual habits, but from the opposite side. So, in addition to the intensity of the internal experience, we were both enthralled with watching each other 'be' the other person.</p><p>My wife had several male orgasms in her mind and matching ones in reality simultaneously. For me I experienced two significant female orgasms in my mind, however, as per most of my personal experiences on MDMA, erections are erratic and generally difficult, so this worked to our advantage since I technically wasn't supposed to possess that body part anyway.</p><p>There are two significant notes to be made. First: As a man, I was able to guide my wife through her experience of being a man. I could explain to her, (acting as a woman) how her body was feeling in me and around me. Likewise, she, as a man would describe to me how I would feel when she would put her male hands on me. This was one half of the reality. Second: By describing my femininity to her, I simultaneously re-enforced my image of being a woman, and encouraged her male interest in me. And, vice versa of course.</p><p>In the midst of this temporary, new reality we never lost sight of our true selves and occasionally would address each other as our own identities to say how great it was, etc... It was a supremely satisfying experience. We both inadvertently revealed personal fantasies about ourselves by bringing them into the situation from the opposite side. We would do things to each other that we would want done to our real selves. In addition, for example, I would do things to my wife that I love when she does to me.</p><p>When we decided to stop, we laid there for several hours talking about all that had happened. It was fascinating to hear her describe events so vividly, as if she was truly a man. The 'sex-switch' was utterly real for both of us. Each of us was caught saying, 'I now KNOW why that feels good to you, because I FELT it!' We both gained a tremendous insight into the workings of each others sexual role in our relationship. We feel that this was a wonderfully (albeit unusual) sexual therapeutic experience, not too mention quite stimulating!</p>",
 "year": "",
 "id": "97026",
 "gender": "Male",
 "age": "26",
 "timestamp": "2012-07-23T07:00:00.000Z",
 "views": "2262"
}
