{
 "title": "If You Take It They Will Come",
 "author": "Dubble",
 "citation": " Dubble. \"If You Take It They Will Come: experience with DPT (ID 97028)\". Erowid.org. Jul 10, 2013. erowid.org/exp/97028",
 "substance": "DPT",
 "bodyweight": "115 lb",
 "header": [
  [
   "DOSE:",
   "45 mg",
   "insufflated",
   "DPT",
   "(powder / crystals)"
  ]
 ],
 "report": "<p>DPT. It has been described to me in many ways. It has been compared to DMT, Mescaline, and Mushrooms. This was the most spiritual experience of my life.</p><p>(+0) Took 45mg insufflated, did not burn at all, though it was so powdered that I might have overdrawn. I solved that by damping my nose with some water before hand and railing water afterwards.</p><p>(+5) Anyways, my girlfriend was lying next to me on the bed, she was tripping pretty hard on 2C-I, but she is very spiritual and understood where I was. The body load was uncomfortable at first, it wasnt a problem after some minutes.</p><p>(+15) Visuals I have never seen before. I am used to the 2Cs and Acid visuals, but this was taking preexisting things like doorknobs and posters and shifting them to different locations around my room.</p><p>(+20) This is when They arrived. They made no sound or entrance, They were all just there. I accepted them as if we have always known each other, and they clearly knew me. Heated brushstrokes across my cheeks as the passed, hot so that I would know its them, but so very comfortable.</p><p>(+30 +++) I had some music playing on my laptop throughout the experience, and I would close my eyes. They approached my face and even though my eyes were closed, its like they were wide open. They took me to flashbacks of random events in my life as if I were watching from above, like They do every day. They kept whispering in my ears things I couldnt understand, but somehow I knew what they were saying. AND THEN IT HAPPENED. Shulgins commentary in Tikhal describes an entity, being Jesus to him, entering the body and becoming one with It. Some flowing entity just laid down and fluidly became me. His head was still next to me, but he had my body. I asked him telepathically if he was Jesus. He answered back in tongues. He left and so did the others, and I continue my night.</p><p>I would say the closest substance to DPT is Mushrooms because this is not a tripping psychedelic experience I get from the 2Cs or LSD. Rather, it is a total spirit trip, in which I interact with spirits that are somehow called to you at that moment. Or maybe they are always there.</p>",
 "year": "2012",
 "id": "97028",
 "gender": "Male",
 "age": "19",
 "timestamp": "2013-07-10T07:00:00.000Z",
 "views": "1914",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "45 mg",
   "administration": "insufflated",
   "substance": "DPT",
   "form": "(powder / crystals)"
  }
 ]
}
