{
 "title": "A Father and Daughter",
 "author": "Respondent 7",
 "citation": " Respondent 7. \"A Father and Daughter: experience with MDMA (Ecstasy) (ID 97022)\". Erowid.org. Jul 23, 2012. erowid.org/exp/97022",
 "substance": "MDMA (Ecstasy)",
 "bodyweight": "",
 "header": [
  "DOSE:",
  " ",
  "oral",
  "MDMA"
 ],
 "report": "<p>On the first occasion I took half a pill and was totally surprised at the emotional change that took place within me. The few visuals were highly amusing and my only period of doubt was when it became clear to me that my left eye wanted to look 'inwards' and my right eye 'outwards'. However, without assistance from my guide, I soon discovered my 'control centre' and immediately became confident that ultimately I could and would be able to control any trip when I wished to 'change direction'.</p><p>I truly found my feet a few months later at Glastonbury 1994. During those marvelous four days I found that I was able to trip alone and in very unusual surroundings without any paranoia. I discovered that I could 'feel' music throughout my entire body, could sense the (overpowering) heat of 2000 people in a marquee from 50 yards and could 'tune in' to the mental energy of the large mass of people on the site. Finally, I discovered 'my place' - the place where the 'collective consciousness' appears to be most focussed for me. It was there that I found that I could readily 'communicate' with people who were no longer in my life - my Grandfather, for example, who had died many years ago and my former father-in-law who had passed away a year earlier.</p><p>Since those (early) days I have had many rewarding trips - often amusing - where I have concentrated on self-assessment. I believe that in the last two years I have learnt more about myself than I suspect that I would have done, without the assistance of MDMA, in the rest of my life. Not all of the revelations have been pleasant, but I truly believe that usage has improved my personal and business relationships. In the last nine months I have tried candy popping (maximum dosage 250mg of MDMA and 300ug of LSD). On one trip, I was completely absorbed by the energy in 'Riverdance' (a friend was attempting to watch the video at the time) and subsequently experienced an out of body journey outside the galaxy, looking back at the intense whiteness of the power of the human consciousness. My final thought was how we had evolved from 'I think therefore I am' to 'WE think therefore WE ARE' - the beautiful arrogance of LSD winning the battle there I think!</p><p>As a parent, I know it is all too easy to miss those special opportunities where you can demonstrate how much you love your offspring - and perhaps more importantly, for them to be able to hold you and tell you that they love you. On the first trip with my 25 year old daughter we lost no time and we were able to FEEL the love that we have for each other. Since that night our relationship has been transformed and though we have had disagreements since, they have been quickly resolved largely because of the firm foundation we established while tripping together.</p><p>From a personal point of view, my life has changed substantially for the better since 'discovering' E. I am however, still wary of the potential to become psychologically dependant upon the drug - the urge for 'more and better' is very powerful. I consider myself fortunate that I have had the years to develop a strong sense of self identity and know that I am able to more easily cope with the come down than many people younger than myself.\rFrom a 44 year old English Chartered Accountant</p>",
 "year": "",
 "id": "97022",
 "gender": "Male",
 "age": "44",
 "timestamp": "2012-07-23T07:00:00.000Z",
 "views": "1445",
 "dose": {}
}
