{
 "title": "Insights on Ecstasy",
 "author": "Respondent 82",
 "citation": " Respondent 82. \"Insights on Ecstasy: experience with MDMA (Ecstasy) (ID 97038)\". Erowid.org. Jul 23, 2012. erowid.org/exp/97038",
 "substance": "MDMA (Ecstasy)",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   " ",
   "oral",
   "MDMA"
  ]
 ],
 "report": "</p>I am a rave promoter and a DJ in the United States who just recently tried ecstasy. I believe that the experience I had was sacred, valuable and important in the way it affected my life.</p><p>However, being a rave promoter and seeing the same kids on E all the time makes me a bit sad. My own personal experience provided me with a profound sense of well being; a feeling I can summon just by concentrating a little on the memory of my E trip.</p><p>One of the more important lessons I learned on E was that I had to try to find that same sense of well-being in my everyday interactions with people. Indeed even those interactions between the subtle thoughts and conceptions that help us create a sense of consciousness can be directed to have positive effects on one's life.</p><p>I have only taken E twice and I plan on taking it again, but at the maximum frequency of every six months. The second time I took it I was with my girlfriend and we were able to explore the depths of our relationship and become closer in the process. Ecstasy helped make our relationship more communicative. The memory and contemplation of my experience on E brings new insights several months after I have taken it.</p><p>I am glad that E is out there to provide those who open themselves to the experience with a pathway to greater self-understanding.</p><p>To all you E-heads out there, please, please, take the time to consider what you are doing to yourself, how it affects you and why you do it. E should be held as a sacred thing, not just something to do when you're bored. Get into the music, or something else, invite your passions to entrance you. Express what you've felt on E in the 'real world'. Make a difference in people's lives. Peace.</p><p>23 year old promoter in the USA</p>",
 "year": "",
 "id": "97038",
 "gender": "Male",
 "age": "23",
 "timestamp": "2012-07-23T07:00:00.000Z",
 "views": "953"
}
