{
 "title": "Good Trip Buddies Enabled First E-xperience",
 "author": "Respondent 89",
 "citation": " Respondent 89. \"Good Trip Buddies Enabled First E-xperience: experience with MDMA (Ecstasy) (ID 97044)\". Erowid.org. Jul 23, 2012. erowid.org/exp/97044",
 "substance": "MDMA (Ecstasy)",
 "bodyweight": "",
 "report": [
  "<p>I was introduced to E by a good friend, but being rather cautious about experimenting with drugs, I decided to find out about the pros and cons of E before my first experience. Your site helped immensely, with both information contained on your pages and links to other sites.",
  "Thanks to information gained mostly from reading others experiences, my first trip was unbelievable. Being a rather shy and reserved type of guy, I was amazed at how free I felt, all of the emotional walls I had built up around myself were stripped away and the real person I knew was allowed out to play. Even now, several weeks after my first trip, I am still benefiting from the effects. Having experienced the 'real me' I have no desire to shut him away again. My friends have all noticed the change in me and how at ease I seem. I still have a way to go to rid myself of all of the crap I filled my head with over the years but the E experience really opened my eyes.",
  "Although I am no expert on the subject, I would urge anyone looking to try E for the first time to only take it with a good 'trip buddie'. My first trip was with four good friends, a couple a few years younger than me, who both also took E, and with two other friends who stayed chemical-free. Between them my trip was awesome. The couple were there to show me how to enjoy the trip, what to do to fully appreciate the effects, especially the tactile aspects (at one stage a small amount of ice water dripped down my spine sent me to heaven and back...) The other two friends were there as reassurance. I know the risks of E, when used sensibly, are far less than say that of alcohol, but the fear of the unknown was in the back of my mind and having people there who I could rely on made my trip so much more relaxed. I suffered none of the side effects or panic attacks other people mentioned (except the tendency to clench my teeth a bit). Thanks to being well informed and my 'trip buddies' I will never forget my first experience with E.",
  "It is only through information and safe partying that E will shed its bad reputation and will one day take its rightful place as a safe alternative to alcohol at social gatherings.</p>"
 ],
 "year": "",
 "id": "97044",
 "gender": "Male",
 "views": "934",
 "dose": [
  {
   "time": "0",
   "administration": "oral",
   "substance": "MDMA"
  }
 ],
 "submissionDate": "2012-07-23T07:00:00.000Z"
}
