{
 "title": "Dancing with a Wand of Energy-Dust",
 "author": "Respondent 80",
 "citation": " Respondent 80. \"Dancing with a Wand of Energy-Dust: experience with MDMA (Ecstasy) (ID 97046)\". Erowid.org. Jul 23, 2012. erowid.org/exp/97046",
 "substance": "MDMA (Ecstasy)",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   " ",
   "oral",
   "MDMA"
  ]
 ],
 "report": "<p>While standing in line for what I thought was a generic dance club in Vancouver's Gas-Town area, my company kept asking how I was feeling with my first (ever) hit of E. My only response was 'good', as I had only reality to compare my thoughts and feelings to - something I've been using as a desensitized comparison my whole life.</p><p>My company consisted of my brother (whom I hadn't seen in several months because he had just moved to Vancouver), and 2 friends of his that he knew from home and who happened to be in town for the week - both of whom we had met by total coincidence the day before. Something definitely brought us together that evening in more ways than one.</p><p>The next time I heard him ask how I was, well, I know I could honestly say 'great', as the warmth of my surroundings wrapped me like a blanket on a chilly west-coast night. When we entered, I knew it was a special place - the good-vibe eye contact everyone was making with each other abounded. As I worked my way into the fierce house music that was throbbing the flesh all around me I stopped and absorbed exactly what I was feeling - connection. The wisp of another's hand, or finger by my body initiated a new bond within this mysterious culture - always followed-up by a comforting glance.</p><p>I somehow worked my way into a whole new circle of people and experiences on the floor. From the corner of my head I sensed the warmth radiating from an older (probably early 50's) woman slightly detached from the people I was currently grooving with. We caught each other's eyes for what seemed like hours as we held still and allowed the room, the lights, the people, to just orbit around our perfectly still bodies. I silently mouthed to her 'please dance with me'. She silently mouthed back to me 'I already was'.</p><p>This definitive point was the pivot-point for my evening. I truly understood at that infinitely microscopic point in time what it meant for myself (emotionally) and others to come together through such an act of raw, unplugged, uninhibited spirit.</p><p>When I met up with my brother later on, I was gleaming with joy. A grin from cheek to cheek. My own-flesh-and-blood-big-brother that I look up to so much was present to share the whole evening with me.</p><p>I lost myself in a vision of carrying a little satchel over my shoulder of the positive energy I had received from so many people that evening - and a beautiful little satchel it was. The 'wand' I was using to toss this dust-like energy over my brother was so real to me, and so in-touch with the sounds we were enjoying. In time with the approaching climax I was uncontrollably tossing my wand of energy dust over everyone around me. I found myself in the middle of a chain of beautiful beings surrounding the speaker and in a half-circle as people began rubbing this vision of energy into their own hair and bodies - sharing the vision by speading it over others around them in an almost barbaric manner. And right in the middle of them all (and caught-up 100% in the whole experience) was that brother of mine. It was the most beautiful example of community I have ever been a part of - even to this day.</p><p>If I never did E again - not to say that I wouldn't - I couldn't fathom walking away with any more 'personal growth plug-ins' than I received that evening. However, if others are as much of a reflection of ourselves as I am beginning to believe with every new person I meet in my day-to-day life, I am sure there is much growth to be had through social interaction with others who have experienced the insights (or variations thereof) that I received into my own life that wonderful evening.</p>",
 "year": "",
 "id": "97046",
 "gender": "Not Specified",
 "age": "Not Given",
 "timestamp": "2012-07-23T07:00:00.000Z",
 "views": "890",
 "dose": [
  {
   "time": "DOSE:",
   "amount": " ",
   "administration": "oral",
   "substance": "MDMA"
  }
 ]
}
