{
 "title": "Life Changing Experience",
 "author": "Respondent 3",
 "citation": " Respondent 3. \"Life Changing Experience: experience with MDMA (Ecstasy) (ID 97056)\". Erowid.org. Jul 23, 2012. erowid.org/exp/97056",
 "substance": "MDMA (Ecstasy)",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   "1 tablet",
   "oral",
   "MDMA"
  ]
 ],
 "report": "</p>\n[A shy 29 year old describes his first E trip]</p><p>I actually read Ecstasy and the Dance Culture last year, prior to trying the drug for the 1st time. In fact it was because of my stubborn refusal to try the drug which many of my friends had discovered, that I was given a copy of the book to read. You will have heard all the compliments on the book before. Suffice it to say, it was a thoroughly enlightening read, confirming much of what my friends had been insisting for months and one which resulted in me dropping my 1st pill that Saturday night.</p><p>I know that you will also receive many tales of 'My first time' but I really would like to say a few things. Throughout my life I have always been one of the quiet ones. Shy, underconfident, insecure and introverted. I have always led a safe and routined life, my only real excess being cannabis which I have smoked enthusiastically for 12 years. (Since I was 17) Guided by my 3 closest friends that night, I popped the Dove I was given and finally realised exactly who, and what I am. At the party which we then went to, I soared! I met literally dozens of like minded people, many of whom have now become very close friends and I talked and danced into the following morning, amazed that anything could feel so incredibly True. Until that night, I never knew that I could ever feel THAT good, that content, that in love with the world.</p><p>This is nothing new of course, and I read the personal accounts in your book with delight, being able to relate so well to the feelings of elation described. However, I can also say without any melodrama, that the drug changed my life. At the party that night I met a wild and crazy individual who in addition to having a deep love for E, had spent the last 3 years of his life transporting aid to the War torn former Yugoslavia. We talked and talked for hours and as a highly pressured, and disillusioned Marketing Executive, I was amazed at the passion which this man had for his work and the people who he was helping.</p><p>Some say that you should never make a serious decision under the influence of ecstasy. Well..I did. Peter was in the process of organising another aid convoy which he was due to lead in just 3 weeks. I had no experience of aid work, had never driven a 17 tonne truck, and apart from a few holidays to the Mediterranean, had hardly been outside of England. But I decided that I had to go. The feeling which I felt was indescribable. I discovered a strength and confidence in myself that I never knew existed, and if it makes any sense, suddenly felt hugely in love with life.</p><p>In the few weeks leading up to the trip I had constant anxiety attacks. What had I done!! this wasn't the sort of thing that I did! I didn't even know this guy and I'd just agreed to drive 3500 miles with him into a war zone and back. But I was committed...and I went.</p><p>The account of the trip is something which I've almost considered putting into a book and I won't bore you with the detail. Suffice it to say that it was a truly life changing experience, pushing me to new levels physically, mentally, emotionally, and spiritually. As we headed out of Sarajevo on the way back over mount Igman, I simply couldn't believe that my life could have taken such a dramatic turn. The memories will stay with me forever and my life has changed subsequently also in that I have become involved with a number of other charity organisations and have completely changed my previously chosen 'career path'.</p><p>It is absolutely impossible to explain adequately how I, and my life, have changed as a result of taking Ecstasy. I now have unshakeable belief in the existence of my Spirit, a completely different attitude to life and everyone around me, and a wonderful sense of inner calmness which I never had before. Above all...I believe.</p><p>Your book was instrumental in this and it has kept me good company ever since and I shall continue to use Ecstasy to enrich and improve my life. If only more of the world could see and understand as you, and many us now do. Please continue the cause. We all have a responsibility to educate, inform and enlighten and You have the love and support of many, many fellow spirits.</p><p>Thank You, from the heart and from the soul.</p><p>Man, UK</p>",
 "year": "1997",
 "id": "97056",
 "gender": "Male",
 "age": "29",
 "timestamp": "2012-07-23T07:00:00.000Z",
 "views": "1225"
}
