{
 "title": "Twilight Exploration",
 "author": "mrmunky",
 "citation": " mrmunky. \"Twilight Exploration: experience with Mushrooms (P. cubensis) (ID 9705)\". Erowid.org. Oct 1, 2001. erowid.org/exp/9705",
 "substance": "Mushrooms (P. cubensis)",
 "bodyweight": "145 lb",
 "report": "<p>This (was a dream, and) took place at the beginning of September, 2001. It was turning from afternoon to evening, in a residential setting with woods nearby. It was about 70F during the day, dropping to probably about 50F at night, with no rain and a partially cloudy sky.</p><p>I ingested half an eighth of mushrooms that I went in on with a friend at about 4:30 pm. There were 6 male teenagers besides me shrooming, all 16 or 17, and all good friends. They (R, J, K, B, C, & M) had just gotten into shrooms recently, and wanted to introduce me to them. This was my first trip, and I didn't really know what to expect, but I definitely wanted to try it out. I'm up for anything once, as long as it's not addictive.</p><p>When they kicked in, about 5:15, I was sitting in a lawn chair at my friend R's, staring out at a forest and looking up at the sky and generally just observing my environment and thinking how beautiful it all was. I looked around the back of R's house and noticed how much the hill (sloping down) looked like Texas hill country... I focused on that for a few minutes, then decided to climb this huge pine next to R's driveway that we always used to hang out in when we were little. I got kind of reminiscent about my youth and climbed up to our old spot, and found that the board we had nailed into a thick branch had actually grown into it. I just sat there on the board, staring out at everything and thinking about how awesome it was being a little kid and having no worries, and how I didn't even appreciate the freedoms I had as a child.</p><p>At this point, R, and 4 others (M, C, B, and K) decided to go out for some pizza. I wasn't really hungry (there were no 'munchies' like with weed), so I decided to hang around with J. After about 10 minutes of laying on R's lawn and staring at the sky, I got up and went to the foundation of a new house being built a bit down the street. It's on a lot grown wild, and is really strange...it's in-ground concrete walls forming a big room with some smaller ones off to the side. It's about 8 feet deep, flat on the bottom, and had filled with water due to there being rain the previous day. I jumped from a dirt mound across the deep ditch around the foundation, onto it. Normally I wouldn't have tried this, but I just HAD to get onto it and look around.</p><p>I was sitting on one of the walls staring down into the enclosed mini-lake when I heard someone walking near me...J decided he was gonna come over too, so he jumped onto the wall and we sat on it, talking and laughing hysterically at mundane thingsI think it was about here that the full effect really hit me. We got up to leave after while, and when I looked up at the wilderness, I just totally got lost in it, staring at the details of the trees and plants. That became the next place to explore. I took a running jump off the foundation and almost fell into the ditch (which would've sucked)after catching my breath, I went over to the forest and hurdled a stream to get into it, only to find that the dense foliage concealed a big wooden fence. I was mildly disappointed in this, and decided to go get something to drink back at R's.</p><p>On the way back, I changed my mind and just grabbed my jacket, as it was getting chilly. J did likewise, and we set off to the community center. The center is a big open field with a clubhouse and a children's play area (multi-level, with slides and monkey bars and such)..The sun was setting at this point, so we got up on the top part of the play area and stared at the sunset and the sky...</p><p>Of the entire trip, of all the things I saw and did, the sky was by far the best and most beautiful thing. The sunset was an absolutely stunning orange fireball, fading to pastel pink clouds against a deep blue sky.. I gained a new appreciation for nature that night, and I think that had alot to do with it. I sat up there with J, staring, until the rest of the group showed up.. I was extremely eager to share the sunset with them, so I invited them up, and we all just hung out, not saying a word, looking at the sunset. I had tears in my eyes, and I know a few of the others did too. After the sun had set and the colors had faded, we took a journey into the forest behind the community center, and left across streams and climbed hills and just reveled in the beauty of nature. We stayed at the center for the remainder of the trip, just hanging around and having fun.</p><p>During the entire experience, I don't remember feeling dislike towards anything, not even when some punk 8th graders on dirt bikes came by tripping on some Sudafed, which I think is totally ignorant. One of them kept getting in my face, and I didn't even realize he was being aggressive until about half an hour after they had left. By then the group (not counting the kids on bikes) had grown to about 12 (5 had no shrooms but they had smoked some pretty kind bud), and we sat around talking for a minute, and then myself, R, J, and K left and ended up sleeping at my house.</p><p>For 4 or 5 hours, I was so utterly happy and curious, it just blew my mind. While the visuals weren't particularly intense, they brought out the beauty in nature, and made me appreciate it on a whole new level. I feel I bonded with the wilderness that day, and strengthened ties between myself and J, and generally enjoyed the presence of everyone. I also made some deep realizations about life... you have to truly appreciate the good things you have, and enjoy the things you do, because if you don't, you'll just go day to day, living an unfulfilled and dreary life. Up until that point, I felt I had just been living for the next moment, constantly in anticipation of the next thing, not taking the time to take in the moment and see how great the present really is.</p><p>In retrospect, that was probably one of the most fun things I've ever done. It was better than I could've imagined, and it changed me forever (I hope). I regard mushrooms as a great ally, and I hope to try them again soon.</p><p>Live for the moment.</p><p>-I-</p>",
 "year": "2001",
 "id": "9705",
 "gender": "Male",
 "timestamp": "2001-10-01T07:00:00.000Z",
 "views": "8252",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "0.0625 oz",
   "administration": "oral",
   "substance": "Mushrooms"
  }
 ]
}
