{
 "title": "Turning Depression Into Joy",
 "author": "Respondent 72 (V & S)",
 "citation": " Respondent 72 (V & S). \"Turning Depression Into Joy: experience with MDMA (Ecstasy) (ID 97050)\". Erowid.org. Jul 23, 2012. erowid.org/exp/97050",
 "substance": "MDMA (Ecstasy)",
 "bodyweight": "",
 "header": [
  "DOSE:",
  "1 tablet",
  "oral",
  "MDMA"
 ],
 "report": "<p>S's Story</p><p>I was apprehensive at first about taking E. Previously, I had tried LSD and mushrooms, and did not enjoy the loss of control during the trip. Our group of friends had gathered at the house before we went downtown to a small Spanish club and I felt very safe and happy being around my close friends. We got some juice from a local convenience store and consumed the pills in the kitchen before heading out. One of our friends had a camcorder at the house so he decided to tape the nights events.</p><p>Before we left for the bar I checked around for V, but she had disappeared. I found her sitting in the basement on a couch with the lights down low. She said that she was feeling very bad and was worried. Concerned, I took her hand and we talked about how she was feeling. She didn't want to go out, but I convinced her that if she stayed with me and our group that everything was ok.</p><p>I drove the group down to the city and put on some relaxing music from one of V's favourite bands, Orbital. I asked her to focus on the music and to let go of her anxiety. Within a few minutes her face had lit up and she was smiling widely. From that point on her happiness did not end. I was feeling extremely relaxed as I drove, absorbing the music and enjoying every second of life.</p><p>By the time we made it to the club, everyone was in a joyous mood. Inside the club I stayed very close to V, holding onto her hand very protectively and rubbing her body. The sensation of touch was brilliant and I couldn't stop. V was glowing and we talked deeply and emotionally about love and life. My friends had scattered around the club so we were constantly on the move, going from one conversation to the next, greeting people we recognized but had never talked to before. One friend was talking to a group of people in a very comical and animated tone (which was unusual because he typically was very quiet) and I burst out in uncontrollable laughter with him.</p><p>We were liberated from the chains that bound us for that night. It was an experience of absolute freedom. We danced, talked, laughed and revelled with the world. When we arrived home at night, we gathered in the family room and spoke to the camcorder. The next day when we watched the video we could not believe how different we seemed - so relaxed, happy and natural. Why couldn't life always be like this?</p><p>It was an experience that will be cherished and remembered for a lifetime.\rV's Story:</p><p>The night that we took the E, I was feeling very stressed out and in a bad mood. I had told my older brother and wife what I was planning to do, and they had some very harsh criticisms to offer as they felt that it was dangerous. I personally did not know much about E, but I trusted my boyfriend S who had done a lot of research on the topic and was careful about what he put into our bodies.</p><p>S had previously tried LSD and mushrooms, and both times the experience turned out to be undesirable. He struggled with family issues - the death of his father and non-closeness to anyone in his family. It was very difficult to see him ride through the emotional rollercoaster.</p><p>So the night we took E, I had all these thoughts on my mind. I downed the pill in frustration and anger on a completely empty stomach. When the effect started to hit me, I felt very queasy and uncomfortable. I went down in the basement to be alone and try to sort out my feelings. Everything was going wrong at this point. As a depressive person normally, I rode out these negative feelings rather than trying to turn them around.</p><p>S came downstairs to talk to me, he was very concerned about my well being. I didn't want to go out, but he convinced me that everything would be ok, and that he would not leave my side. He talked to me a little about the chemical process that was taking place in my brain, to understand that this was a temporary state of being from which I would eventually return to normalcy.</p><p>On the car ride, I was shivering, cold and silent. I sat in the passenger seat next to S with our friends in the back. They were having a long conversation between them in the back seat, which allowed S to focus on me. He held my hand and assured me things would be ok. His smiles and confidence helped tremendously, but I still felt sick in the stomach.</p><p>That's when S pulled out some soft electronic music - Orbital. He talked to the group about the marriage between E and house music, and persuaded them to give the music a listen. The music came on strong and overwhelmed me at first. It was the most beautiful language in the world to listen to. It spoke to me in ways no words could. It touched my heart in a way that I had never experienced before. For the first time, I truly began to appreciate S's love for this type of music.</p><p>As the music played on, I found myself more relaxed than ever. I glanced over at S, who still held my hand firmly, and stared deeply into his eyes. I realized how much in love with him I was. He had saved me from the downward spiral I had been on. I began to talk at great length, expressing my gratitude. He was very happy to see me in such good spirits. He told me that I was the one who had changed myself, that all change comes from within. The music played on and I began to engage in conversation with the rest of the group. From that point on, I didn't want the night to end.</p><p>The rest of the night was glorious. I grew extremely close to S, and we are still together to this day. I learned so much from the experience about myself that I am unable to express. Whenever I feel down, I put on that Orbital track, and instantly I am transported back to that magical time. The music is therapy for my soul - the best drug I could ever take, and I never want it to end. I wonder if I would have ever figured all this out without that little pill that changed my life forever?</p><p>PS The track by Orbital was Dwr Budr - which translation is 'dirty water'</p>",
 "year": "",
 "id": "97050",
 "gender": "Female",
 "age": "Not Given",
 "timestamp": "2012-07-23T07:00:00.000Z",
 "views": "988",
 "dose": {}
}
