{
 "id": 9705,
 "title": "The Experience Was Just Okay",
 "date": {
  "submission": "2007-02-06T08:00:00.000Z",
  "experience": "2006-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Zac",
  "gender": "Male",
  "weight": 88
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "g",
    "grams": "4.0",
    "quantity": "4.0"
   },
   "administration": "oral",
   "substance": "Kratom",
   "form": "extract-10x"
  },
  {
   "time": "0",
   "amount": {
    "unit": "oz",
    "quantity": "6"
   },
   "administration": "oral",
   "substance": "Caffeine",
   "form": "liquid"
  }
 ],
 "report": [
  "Mindset:",
  "I was kind of stressed out and tired after getting in from work. I wanted to try some of my newly bought legal herbs, so, I chose the Kratom extract. I wasnt overly eager to consume it as I was unsure of its strength. In a way, I was afraid to try it due to its use to treat opium addicts (I didnt want to develop any sort of addiction to the stuff).",
  "Setting:",
  "I decided to consume the tea in my room with regular lighting, etc but after I finished I moved to my tub, where I had prepared a hot bath with magnesium sulfate (Epsom salt), candles, and incense. There I listened to Sonic Youth. After I felt I had sweated enough, I moved to my room along with the candles and incense, except there I began listening to Leonard Cohen, to Yo la Tengo,",
  "Preparation:",
  "I was unsure whether to consume a tea or to smoke it due to the fact that I hadnt read much about making a tea with the extract. I decided to make a tea because it was easier to handle for my situation and because the powder was so fine. I warmed about 6oz of water for 2 minutes (microwave) and stirred in the powder.",
  "The Kratom was extremely insoluble in water. I stirred for several minutes to see if that would change, alas, it did not. I tried a sip of the tea, which smelled decent, but to my complete dismay, it was extremely bitter and gritty. I warmed water, mixed up a cappuccino, and continually chased the tea with the sweet drink. Although this wasnt enjoyable, it made the experience a lot more enjoyable. Drinking Kratom is definitely easier than robitussin. ",
  "Experience:",
  "11:15 PM -- Ingested 4 grams of Kratom 10x extract in 6oz of warm water along with 6oz of cappuccino.",
  "11:30 PM -- became very hot (due to warm drink most likely), very awake, possible stimulating effects.",
  "11:50 PM -- sweating (a lot - hot water), very rapid heartbeat noticeable very relaxed, much attention given to movement, I had an intense floating effect, especially with water movement. It was interesting to submerge myself completely or lift up arms and legs. A heavy feeling, as if being pulled back slightly, set in.",
  "12:15 AM -- moved to my room, experienced some difficulty walking regularly (heavy and slow motion), increasingly appreciated music, the pulling feeling increased, especially in the area of my neck and head where my brain stem is located. No tiredness noticed (no yawning) but eyes became heavier.",
  "12:50 AM -- rapid heartbeat diminished, physical feeling of heaviness and slowness increased, The pulling decreased.",
  "1:15 AM -- moved to my bed where I listened to Coast to Coast with George Noory, this was a good idea as I felt physically tired but not enough to go to sleep.",
  "1:30 AM -- noticeably diminished effects",
  "2:30 AM  -- virtually no effects present, extremely tired",
  "3:30 AM -- feel asleep with very little effects",
  "11:30 AM -- woke up with no noticeable negative hangover but there was a slight sense of relaxation that was also present during the experience.",
  "Overview:",
  "Overall, the experience was just okay: there were no strong positives or negatives. As predicted, I was very stimulated for about 15 minutes and then very relaxed until I feel asleep. There was no marked euphoria though I did feel its analgesic effects fairly strongly. The only euphoria I experienced was with motion, particularly that of moving water in a bath tub or the bouncing of my bed, both of which I experimented with when I was in those places.",
  "The analgesic effects were present right after I drank the tea: my throat and mouth became very numb. Later I noticed a lot of mucus production along with a very heavy head and a diminished sense of physical pleasure or pain. Also I experienced a very rapid heart beat and, at one point, a hard time catching my breath. Im not sure if this was because of the Kratom or because of the extreme warmth I seemed to be experiencing, but Im not sure if it would be good for physical activities at this sort of dose.",
  "I appreciated music more, mostly because it was the only thing I really wanted to do. It wasnt as dreamy as I expected, and in fact, possibly wasnt at all. Creation of art appealed to me, slightly, but I felt too apathetic to do it. When I awoke, there was the slight sense of an after glow which was pleasurably sedative, but I still felt motivated enough to do things besides lie around.",
  "Its very possible that my preparation had influence on the strength of my effects since I did not boil the tea down like in normal dried leaves tea. I also consumed caffeine with it. It should also be noted that I experienced absolutely no nausea, which most people seem to experience. Im not sure why this didnt occur but I did have a small snack (a piece of cheesecake) about 10 minutes before I began drinking the tea. Sometime, hopefully, I will be able to try a different preparation. But ultimately, I think Kratom could be more beneficial to ease the ill effects of other trips or drug experiences than to experience it alone.",
  "The whole thing may be comparable to a very low plateau DXM trip without the visual distortions and confusion. I think it was an interesting experience but not so much that I would pay $9 dollars plus shipping for it.",
  "* I take an anti-histamine and multi-vitamin irregularly (2 days before the Kratom)."
 ],
 "erowid": {
  "id": "58023",
  "citation": " Zac. \"The Experience Was Just Okay: experience with Kratom (10x extract) & Caffeine (ID 58023)\". Erowid.org. Feb 6, 2007. erowid.org/exp/58023",
  "substance": "Kratom (10x extract) & Caffeine",
  "views": "36603"
 }
}
