{
 "title": "Higher States of Consciousness",
 "author": "Respondent 30",
 "citation": " Respondent 30. \"Higher States of Consciousness: experience with MDMA (Ecstasy) & Cannabis (ID 97061)\". Erowid.org. Jul 23, 2012. erowid.org/exp/97061",
 "substance": "MDMA (Ecstasy) & Cannabis",
 "bodyweight": "",
 "report": "<p>I am 18 years old and last night I tried ectasy for the first time and I would really like to share my experience so that others who are considering trying ectasy, or just want to know more about it can have a first-hand very real account.</p><p>NOTE: I researched this drug before I did it to find out as much as I could about its possible side effects, dangers, other people's experiences, good or bad, everything that I thought might help me in my decision, and made a decision to do it. I believe that knowing what I was doing and going into it with a positive outlook and in an environment that I was comfortable in helped this to be the transforming experience that it was for me. I also suggest that anyone considering trying ectasy should do the same because I truly believe that my personal mindset was the most significant factor in my dance with the magic of the drug called ECSTASY.</p><p>For me spiritual is an experience that opens you up to the flow of life. An experience that allows your natural state of oneness to be unobstructedly expressed. With all drugs that I take I search for that feeling, that amazing warmth of allowing love to flow through your body like waves. The most profound experience I have ever had has been with Ecstasy. My life is a constant journey to achieve that beautiful state without the assistance of psychoactive drugs, however, I am still young and haven't found it yet. Sharing nature with ones that I love has brought me close before though. There is definitely powerful magic in Mother Natures splendor.</p><p>I arrived at my friends house in the country at around 6:30 and immediately took my one tab of Ectasy. Making sure to drink plenty of water, i watched the gorgeous Texas sunset and enjoyed the antics of my friends many cats. In about an hour I began to feel extremely spontaneous and clear. My body felt cushioned and I had a happy feeling not unlike a nice beer buzz, and at the same time like nothing I had ever experienced before. Since I would really like for this to be a very accurate account of my experience I will say that as the drug really began to take its effect I was suddenly nauseous. I would like to note, however, that this was not a really unpleasant experience and overall made me feel alot better and did not dampen my experience at all. I was with two very close friends and two strangers, I actually would like to take that back because even though I had never met these people before, i felt equally close with them, with everyone alive to be exact. I was sharing the world with everybody and everything that was alive in that moment of that second of that minute of that hour of that day of that year of this existence. This experience lasted for roughly 4 hrs.</p><p>When I was coming off the drug at first I felt a little sad and for a brief moment extremely paranoid. Looking back now I attribute these side effects to my personal defensive characteristics which had been stripped away and forgotten in my total surrender to the ectasy. Another possibility could have been the interaction of the marijuana that i had smoked right before I began to come off the drug. At times I experience paranoid episodes while smoking pot. But overall these were brief and only lasted long enough for me to realize that I could also feel the same without the drug and it was the removal of my defensive actions that had allowed that intense feeling of love and right action to flow through me uninhibited.</p><p>I cannot stress more the importance of this experience to me. I now have a new outlook on life and feel that this has helped me in my journey to enlightenment. This morning I woke up with a smile and felt the sun streaming through the window and knew that my life was headed in a new direction. I am in love with life in a way that I never was before, and while I don't still feel that complete sense of blissful surrender to the love flow, I do know that it is attainable and that I will never forget what it feels like.</p><p>I was born on a journey to achieve this state of ectasy and now know that I am just farther along in my adventure called life. I realize that you don't need anything more than to allow love to flow through you to feel so connected to higher states of consciousness.</p><p>An 18 year old American woman</p>",
 "year": "",
 "id": "97061",
 "gender": "Female",
 "age": "18",
 "timestamp": "2012-07-23T07:00:00.000Z",
 "views": "1032",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "1 tablet",
   "administration": "oral",
   "substance": "MDMA"
  },
  "1": {
   "time": "",
   "amount": " ",
   "administration": "smoked",
   "substance": "Cannabis"
  }
 }
}
