{
 "title": "A Traveller Worships Life",
 "author": "Respondent 56",
 "citation": " Respondent 56. \"A Traveller Worships Life: experience with MDMA (Ecstasy) (ID 97063)\". Erowid.org. Jul 23, 2012. erowid.org/exp/97063",
 "substance": "MDMA (Ecstasy)",
 "bodyweight": "",
 "header": [
  "DOSE:",
  ".5 tablets",
  "oral",
  "MDMA",
  "",
  ".5 tablets",
  "oral",
  "MDMA"
 ],
 "report": "<p>I would like to tell you about my best experience of ecstacy.</p><p>It was at a free party in West Wales last year and we travelled for miles into the mountains with only vague directions. We'd dropped half a white dove as we hit the ten miles to go sign and then ended up thinking that we'd got lost. We drove up the mountains, stopping for sheep to pass, laughing with each other. As we hit another road we decided that we were lost and that we'd take another corner and go home. Sadness hit the tunes that were playing.</p><p>We turned the corner in the probably most remote part of Wales and saw a convoy of car lights. Everyone was so overjoyed that we started to hug each other and Ben, the driver was beeping his horn. The music bass was just about audible in the distance and we took our other halves.</p><p>I'd only known my friends for about a month and in that rave we became so very close. We sat by the edge of the water front in pure darkness as the lights and music from behind us bounced of the mountains. We talked about many things. One of which was how we definitely thought that there was something other than our life out in the universe. The sky was a cluster of stars, and looking back at people dancing, it seemed, as though we were there for a purpose, sort of worshipping something. Ben told me I was beautiful, something no one ever had said to me before. I told Esther that she, was indeed beautiful and I loved her smile. James then added that life was good and that we should be so thankful of being able to be here. Coming from a city, it was a rare sight. We all agreed on one thing, though, that we are worshipping something: LIFE.</p><p>Since last year, I've spent many a month on a traveller's site and one thing that sticks in my mind of that night, was seeing the sun rising this was then thought of and still is, every morning I look out of the trailers' window at the vans and other vehicles, a new beginning.</p><p>A new, much more understanding light has been cast on our generation. To see things that are right and wrong with society,to bring people together, Armani jeans, skin heads, fluffy pink housy girls and pierced dredded hippies, all together if only for a few hours, but a lifetime in unity.</p>",
 "year": "",
 "id": "97063",
 "gender": "Female",
 "age": "Not Given",
 "timestamp": "2012-07-23T07:00:00.000Z",
 "views": "780",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": ".5 tablets",
   "administration": "oral",
   "substance": "MDMA"
  },
  "1": {
   "time": "",
   "amount": ".5 tablets",
   "administration": "oral",
   "substance": "MDMA"
  }
 }
}
