{
 "title": "An Amazing Night of Exploration",
 "author": "TandGanc",
 "citation": " TandGanc. \"An Amazing Night of Exploration: experience with MDAI & 6-APB (ID 97125)\". Erowid.org. Oct 1, 2012. erowid.org/exp/97125",
 "substance": "MDAI & 6-APB",
 "bodyweight": "100 kg",
 "report": "<p>Subject bio: 2 male individuals, 27 and 34 both approximately 100kg. </p><p>18:45 - Ingested 100mg of both MDAI and 6-APB via gel caps.  We celebrated by ceremoniously feeding the other the meds followed by a unique cocktail.  We showered together and started the evening.</p><p>19:30 - Started to feel the effect of the 6-apb, our heartrates increased, tactile stimulation awareness was heightened.  We explored each others body and began talking about whatever was on our minds.  From past relations to life in the universe and everything in between.</p><p>20:30 - The euphoric effect of the MDAI kicked in.  Some visual abnormalities and color shifts were both experienced by both subjects.  A speedy feeling was verbalized by both at approximately this time.</p><p>21:45 - Both subjects redosed with 100mg of each MDAI and 6-APB after a plateau was reached.</p><p>22:00 - Conversation continued, hunger set in but neither subject felt capable of eating.  Water breaks were common to keep re-hydrated due to excessive sweating. Both ventured outdoors to experience the wind and coolness of the Alaskan Summer.  Once back indoors, subjects danced and the emotion of the adventure changed with each song.  Some songs were disturbing and quickly changed, while others were beautiful and furthered the exploration of the other. </p><p>01:00 -  Subjects continued to talk and converse, several water breaks, small excursions around the house together.  Some gastric upset felt by both subjects.  One subject did vomit but was attributed to sudden change in position.  Subject felt immediately better after and no further issues developed</p><p>03:00 - Subjects decided to turn off music and cuddle.  Tactile stimulation still heightened, warmth and euphoria still experienced by both.  Involuntary tremors noted in legs, shoulders, arms and hands by both subjects.</p><p>05:00 - effects noticed to have plateaued and started to wain.  Subjects retired to the bedroom, but continued to talk.  As the morning continued, one subject was tired and the other was not.  One subject experienced extreme restless legs.  Neither subjects were able to sleep any.</p><p>Effects continued to decline over the course of the following morning.  At approximately 17:00 the following afternoon, 24 hours after ingestion of meds, subjects still felt light effects of the MDAI.  Overall the experience was thoroughly enjoyed by both.  Subjects felt closer to each other than when the adventure started.  Subjects did not eat anything during course of experience until 20:00 the following day.</p><p>Next adventure will be just the MDAI alone, but at a higher dose with subsequent interval dosing.</p>",
 "year": "2012",
 "id": "97125",
 "gender": "Male",
 "age": "34",
 "timestamp": "2012-10-01T07:00:00.000Z",
 "views": "2745",
 "dose": [
  {
   "time": "DOSE: T+ 0:00",
   "amount": "100 mg",
   "administration": "oral",
   "substance": "MDAI",
   "form": "(powder / crystals)"
  },
  {
   "time": " T+ 0:00",
   "amount": "100 mg",
   "administration": "oral",
   "substance": "6-APB",
   "form": "(powder / crystals)"
  },
  {
   "time": " T+ 3:00",
   "amount": "100 mg",
   "administration": "oral",
   "substance": "MDAI",
   "form": "(powder / crystals)"
  },
  {
   "time": " T+ 3:00",
   "amount": "100 mg",
   "administration": "oral",
   "substance": "6-APB",
   "form": "(powder / crystals)"
  }
 ]
}
