{
 "title": "Bad Trip and an Odd Antihistaminic Effect",
 "author": "VitaminX",
 "citation": " VitaminX. \"Bad Trip and an Odd Antihistaminic Effect: experience with 5-APB (ID 97266)\". Erowid.org. Oct 7, 2012. erowid.org/exp/97266",
 "substance": "5-APB",
 "bodyweight": "130 lb",
 "report": [
  "<p>So, this time I will be reporting my experiences with the fairly new chemical 5-APB (to be clear, the IUPAC name is: 1-benzofuran-5-ylpropan-2-amine)",
  "I have quite a bit of experience with phenethylamines (2C-D, 2C-E, bk-MDMA, 4-MMC, MDMA) and since I heard very good things about 6-APB and it got to me that 5-APB may be a little bit more potent I got myself some.",
  "My initial trial was with 70mg where the effects were pleasant, noticeable but not strong enough, for me anyways. Another time I tried 100mg and had a pleasant evening and no problems sleeping afterwards. These dosages are a bit off from what other people suggested so I strongly presume that my 5-APB is not 90%+ pure.",
  "Anyhow, now I will be reporting about my last experience with this substance, we tried taking around 140mgs. Me and my girlfriend (20 years old, approx. 130lb), who I will continue to call her M during this report, decided to give this substance another try in a festival ambience. This may seem unimportant now but I have to mention it since its going to be quite interesting later on: The festival took place in June 2012 and my hayfever was very strong during these couple of days. My nose was constantly running and itching inside. I had no medication with me so I had to endure it but it was really annoying. We were a little bit hung-over because we consumed quite a bit of alcohol the night before but in the late afternoon we felt rested and ready for this, rather strange, substance.",
  "At around 10 PM we took approximately 140mg (+/- 5mg) of light brown 5-APB via two capsules. About 45 minutes later I could definitely feel that I was off baseline. I could feel a minor body load and a very calm mindset first (this is exactly as it was in the first two experiments). M said she didnt feel anything and was tired of waiting for something to happen. In the next 15-30 minutes the effects intensified for me and for her they started quite strongly with a heavy body load and feeling of being overwhelmed by what we were feeling.",
  "Now before we get into detail of what was happening psychologically I want to talk about something very odd that happened to me physiologically. May hayfever was gone. My nose was free to breathe; in fact I could breathe better than any day in the last two months. This effect started very early at about T+1:00 and lasted longer than the psychological effects of the drug. For me, this was a blissful feeling and I cant explain how something like this can happen. I remember reading something on the internet about antihistaminic properties of these benzofurans but I cant seem to find it anymore.",
  "The mental effects of this drug at such a high dosage were, for me and M, not at all enjoyable. Usually (with 70 and 100mg) the feeling of Euphoria was the most present feeling, but I also felt very relaxed, even tired (for instance I couldnt stop yawning). No psychedelic effects were noticeable. It is not possible to sleep during the full effects because my mind is not at rest. I would say this is not a typical phenethylamine because all the others I tried were, to some degree, stimulating. This one however lacks completely the effect of giving strength and power and doesnt motivate me to do something. There were also no signs of bruxism for M or me. Talking can be very fun for some time but I always need to stay quiet and still for a moment too, to concentrate on my feelings.",
  "Now with the 140mgs it was a horrible feeling of being overwhelmed, not being able to think clearly for a second and also a feeling of dizziness and total confusion. M lay down in the Chill-out-tent and I lay beside her from about T+1:30 to T+4:00. We didnt talk much we just lay there and waited for the effects to get weaker so we could stand up and do something. We were unable to concentrate on anything or to enjoy the feeling of a very light body. Everything felt relaxed but yet so tense and unsettling that we didn't know what to do. Then, after what I think was the plateau, we went to a music stage and sat on a couch for a couple of hours.",
  "M started drinking during this time and she said it helped her to ignore the negative effects and she got some nice euphoria. The effects were diminishing very slowly and we werent able or motivated to dance. It felt like dancing was too difficult at the time, that we wouldnt be able to pull it off properly although we wanted to. From T+7:00 to T+9:30 the effects were wearing off completely and I felt much better, my nose was still clear and didnt itch and I was still awake but I felt like it would be no problem to lie down and sleep. Since it was the last day of the festival we still danced until noon. No other after-effects could be noticed. The nose began itching and running at around T+10:30.</p>"
 ],
 "year": "2012",
 "id": "97266",
 "gender": "Male",
 "age": "21",
 "views": "6140",
 "dose": [
  {
   "time": "0",
   "amount": "140 mg",
   "administration": "oral",
   "substance": "5-APB"
  }
 ],
 "submissionDate": "2012-10-07T07:00:00.000Z"
}
