{
 "title": "Repairing My Soul After the WTC Attacks",
 "author": "Canyon Tripper",
 "citation": " Canyon Tripper. \"Repairing My Soul After the WTC Attacks: experience with Mushrooms (ID 9727)\". Erowid.org. Jul 8, 2005. erowid.org/exp/9727",
 "substance": "Mushrooms",
 "bodyweight": "190 lb",
 "report": [
  "<p>I spent a week in a Canyon in Utah with some friends. Three of us get together in the Southwest every few years and clear our souls with a nice shroom trip",
  "My friend grows them in his house in Phoenix just for these trips.",
  "We consumed right as the hot sun went down over the canyon walls - just around 6PM.  As relaxed as I felt - I still had some anxiety relating the attacks on New York on 9/11/01. I live near the disaster site and lived with the foul stench until I left for this trip.",
  "The shrooms kicked in at about 20 minutes. Amazing swirling visuals in the rocks and some rock faces with vertical lines appeared to be dancing.  As I entered deeper into the experience, I began to distrust the place we were in. It seemed almost TOO trippy - the walls were sculpted by ancient waters and had looked like wailing souls - the heat still penetrated form these rocks even though the temperature was cool. I climbed out of this evil canyon and found a rock that overlooked the entire site.  As my friends explored and tripped, I watched and danced. I danced for my friends still in New York and I danced to protect myself from evil. I kept repeating 'one two three' over and over again while I danced. The visuals still strong after a hour and a half.",
  "My tension grew and my friends noticed it. As far gone as we were - they were able to talk to me - even though I could not communicate what I was exactly feeling. I wasn't feeling bad - as long as I stayed on my rock. I was worried - I saw planes in the sky and began to worry for the passengers. I started to think that when I smelled the World Trade Center smoke at home, I was actually inhaling burnt remains of humans!",
  "Then a huge shooting star streaked across the sky and for a second I though it was a plane crashing. I was terrified - and then I though to myself - 'Sometimes a shooting star is just a shooting star'.  Then all of the sudden I noticed a few bats flying over head - they calmed me down as they flew around catching bugs. They made me feel safe. I was convinced they were guiding me. My friends came back to the rock I was on and we talked and smoked while we were coming down. I felt like I went through a year of therapy that night. I love my friends",
  "It was a great night!</p>"
 ],
 "year": "2001",
 "id": "9727",
 "gender": "Male",
 "views": "3000",
 "dose": [
  {
   "time": "0",
   "amount": "2.0 g",
   "administration": "oral",
   "substance": "Mushrooms",
   "form": "(fresh)"
  }
 ],
 "submissionDate": "2005-07-08T07:00:00.000Z"
}
