{
 "id": 9727,
 "title": "Opiate Tide",
 "date": {
  "submission": "2008-05-23T07:00:00.000Z",
  "experience": "2006"
 },
 "author": {
  "name": "Hawkwind",
  "gender": "Male",
  "weight": "270 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "20 mg",
   "administration": "insufflated",
   "substance": "Pharms - Oxycodone",
   "form": "(ground / crushed)"
  },
  {
   "time": " T+ 0:20",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  },
  {
   "time": " T+ 1:00",
   "amount": "20 mg",
   "administration": "oral",
   "substance": "Pharms - Oxycodone",
   "form": "(ground / crushed)"
  }
 ],
 "report": [
  "<p>This was my first oxycotin insulfation experience. 40mg oxycotin prepared for insulfation and later parachuting. I am with several friends, upstairs in one of their homes. Lets call them the M and R.   M (about 120lbs) takes 20mg orally at the time of my insulfation. It feels like I'm snorting nothing, the pill is ground up into a fine powder. I stand up after I finish the line...I begin to feel the effects within a few minutes. Having smoked opium before it felt somewhat similar, a 'cool' sensation...my face slowly slipping into a smile as the rush intensified I sat down on M's bed, wall supporting my back. Feelings of euphoria are intense and flow across my body- i notice my heartrate and breathing are much slower than normal. Nothing to worry about, I don't find myself nodding off.",
  "+0:20 min",
  "M is playing assorted songs. Jefferson airplane brings another smile to my face, I still feel very relaxed and euphoric and can only agree when M suggests walking outside to smoke. We smoke a fair amount of cannabis and I enjoy the synergy. The body high combined with the weed is a great combination. It's around 40 degrees outside but I don't feel cold at all. Nausea not present at all. After we're done we head inside and I parachute the remaining 20mg. Upstairs again M and I enjoy more music and a few computer games.",
  "+4:00",
  "A bodyhigh remains, all though most of the feelings of euphoria have ended. I feel a bit itchy, and scratching my scalp seems to make it stop for a while. The insulfation comedown was not too noticeable, and I plan to repeat the combination again. I wait about 30 days between opiate useages, and I have found that this makes experience safe and extremely enjoyable each time. The power of this drug is very appealing, but I we all know where that road eventually leads.</p>"
 ],
 "erowid": {
  "id": "58111",
  "citation": " Hawkwind. \"Opiate Tide: experience with Oxycodone (Oxycontin) (ID 58111)\". Erowid.org. May 23, 2008. erowid.org/exp/58111",
  "substance": "Oxycodone (Oxycontin)",
  "views": "37424"
 }
}
