{
 "id": 9735,
 "title": "Uncharted Territory",
 "date": {
  "submission": "2001-03-22T08:00:00.000Z",
  "experience": "1996-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "J",
  "gender": "Male",
  "weight": 68
 },
 "dose": [
  {
   "time": "0",
   "amount": "12 mg",
   "administration": "oral",
   "substance": "DOET",
   "form": "powder / crystals"
  }
 ],
 "report": [
  "Even Shulgin's notes on DOET surprise me, because based on my experiences, I believe the potential of this chemical has been regrettably overlooked.",
  "I should note that I will not address how I received the drug--I do, however, know for a fact that it was pure and positively identified as DOET. ",
  "My first experience was without a doubt the most terrifying night of my life and certainly a night to which I can trace several key changes in my world. ",
  "I took between 12 and 15 mg, and tripped from about 9 pm on Saturday until 11 pm on Sunday, when I finally drank several beers and some rum, threw up, and went to sleep.",
  "The experience was incredibly intense, with hardcore visuals including prolonged episodes of what I can only describe as departures from the real world into brief (in real time) yet vivid and lucid fictional interludes, many of which were grotesque and painful.",
  "I did, said, and saw things that simply were not there, and moments later woke up in the same place having usually just stared off into space.  At one point, this kind of episode overcame me while (I was told later) I stared into a mirror and emitted a high-pitched and remarkably non-human sounding scream.",
  "I conceived of ideas, images, words, and relationships that I never would have been capable of in any other condition.  I feared for my life at many points, and could not be convinced that I would 'return to normal.'",
  "In fact, I'm not sure if I have.  I tried it several times since, ranging doses from 3 mg to 15 mg.  Nothing has been as intense as that first night, though I would often go to parties and surround myself with sober people, especially those I knew would be a challenge to associate with (parents, ex-girlfriends, etc.)  I had some unbelievably twisted and complex experiences. ",
  "I know of three others who have tried DOET.  One felt practically nothing, and merely reported 'not being able to get to sleep.'  Two others, however, experienced effects much like mine.  One tripped for two days and tells me that his life has changed in a multitude of ways for the better.  It seems to have simply expanded his world in a tremendous way. ",
  "I have told many of my experience but have met no one who has tried the substance.  I even wrote to Shulgin but received no response.  I'd love to be able to talk to someone about this or get some more information, since none seems to be available."
 ],
 "erowid": {
  "id": "5815",
  "citation": " J. \"Uncharted Territory: experience with DOET (ID 5815)\". Erowid.org. Mar 22, 2001. erowid.org/exp/5815",
  "substance": "DOET",
  "views": "13001"
 }
}
