{
 "title": "Can Be Used Responsibly or Dangerously",
 "author": "neuro",
 "citation": " neuro. \"Can Be Used Responsibly or Dangerously: experience with Methamphetamine (ID 9746)\". Erowid.org. Oct 1, 2001. erowid.org/exp/9746",
 "substance": "Methamphetamine",
 "bodyweight": "185 lb",
 "report": "<p>I had snorted dextroamphetamine and amphetamine before.  Meth is most definitely a more full experience.  After snorting an insanely painful line, I waited 10 minutes or so with my eyes tearing anticipating the effects.  What I got could best be described as a mix between cocaine and ecstasy (which, incidentally, should NEVER be mixed or else after youre chest cavity explodes, the city of New York will be powered for two weeks off the energy of you're still continuously beating heart!). One of the problems with cocaine is the short duration of its desirable effects, which leads to a truly unhealthy frequency of administration. In contrast, meth makes its presence known, keeping me content, for at least 4 hours from a single snorting session.  The speediness of coke, that go-go-go no apprehension feeling and a sort of feeling of power and potency (of character, not cock) meet the kind of warm tingly skin feeling and feeling of connection with people that is characteristic of E.  That's my best description of methamphetamine. </p><p>I felt the usual effects of the sympathetic response in the body (NO hunger, elevated heartbeat and blood pressure, etc.) as found with most if not all stimulants. A very prominent characteristic was the stimulation of conversation (social steroids).  A friend of mine took the same dose at the same time, about 5:00.  Basically we talked and talked and talked, sometimes deep issues, some life experiences, movies, people, everything. A few times we spoke of completely insignificant things and didnt really pay much attention to what they were as they flowed out of our mouths.  Sans the idle chatter, I find this communication enhancement a valuable property. At 10:30 I attacked my nasal mucosa with another line which shot me up a decent bit above the first peak.  My scalp tingled for 2 hours, just part of the MDMA-like (but weaker) body high.  We changed scenery a few times; friends house, diner (I drank water), and my house, with all my faculties and ability to function. WIDE AWAKE!</p><p>Conversation began to slow at about 6am, We smoked a few bowls of herb and took 2mg of clonapin each and pseudo-slept from 7am to 10:30am waking up a little weak, sensitive to temperature and tired, otherwise fine.  There was no real drastic comedown unlike coke and unlike many reports Ive heard about meth.  My assumption is that this problem is dose dependent as well as dependant on how many concurrent administrations.  It was both useful and enjoyable but make sure you have a benzodiazapine on hand or 18 hours later you're eyes are still wide as floodlights.  An amazingly long half-life.  I know people who went through near suicidal depression after stopping a month of excessive meth injection (bad Idea!) and I know a few others that have had some tough times, hallucinations and paranoia from extended binges (a week or more) so I give a huge, (no, that wasnt big enough) HUGE warning to those not versed in the use of addictive stimulants: YOU WILL WANT TO DO MORE AS SOON AS THE EFFECTS START TO FADE, DO NOT TAKE THIS DECISION LIGHTLY AND I URGE YOU TO BE RESPONSIBLY, FOR THE SAKE OF ALL OF OUR FREEDOMS. We dont need any more crackheads or speedfreaks in this world and the difference between them and you (hopefully) is the self-responsibility to resist the biologically mechanical craving with a strong mindset and will so you can be a productive and happy person and not a pleasure center whore. </p><p>Use drugs like Methamphetamine and cocaine with extreme care because addicts never thought that it would have happened to them.  Also remember sleep is necessary not optional, and meth and sleep don't get along.  Remember how I mentioned that it makes you talk and talk?  Well I'm two hours into a trip right now! sorry.  Be Safe</p>",
 "year": "2001",
 "id": "9746",
 "gender": "Male",
 "timestamp": "2001-10-01T07:00:00.000Z",
 "views": "26987",
 "dose": {
  "0": {
   "time": "DOSE: T+ 0:00",
   "amount": "1 line",
   "administration": "insufflated",
   "substance": "Methamphetamine",
   "form": "(powder / crystals)"
  },
  "1": {
   "time": " T+ 5:00",
   "amount": "1 line",
   "administration": "insufflated",
   "substance": "Methamphetamine",
   "form": "(powder / crystals)"
  }
 }
}
