{
 "title": "What to Expect After a Month of Daily Use",
 "author": "neuro",
 "citation": " neuro. \"What to Expect After a Month of Daily Use: experience with Cocaine (ID 9759)\". Erowid.org. Jul 9, 2005. erowid.org/exp/9759",
 "substance": "Cocaine",
 "bodyweight": "185 lb",
 "report": "<p>During a foggy summer of irresponsibility, I found a coke connection; good quality, great bags. It started with use but quickly turned to abuse (as seems to happen almost invariably with cocaine)$40 - $140 a night between 2 or 3 people.</p><p>Within a week and half I began to notice general patterns in my behavior that were parallel to the compulsive, short increment, repeat cocaine dosing habits (a line or two every 15-25 minutes) that I kept. I was more compulsive and by the end of every night I was slave to the anxious, shaky, agitated, insomnia that was the inevitable comedown.  Never the less, the high, the pro-social/conversational effects, and the situation at the time kept me going back to my old dealer.  Finally, one day (I write like a childrens novel author, Ill work on fixing that) the level of my self disgust, which had been rapidly rising by the day, reached an unacceptable level.  So I just stopped. incidentally, my dealer got busted 3 days later anyway.  THE TWO MOST IMPORTANT POINTS I WILL TRY TO MAKE HERE could very well save you alot of pain and personal distress!  I speak through experience here</p><p>#1 If you buy cocaine in a bag of nearly any denomination, chances are about 95% that it will be empty by the end of the night and you will be anywhere from irritated and bummed to blue and frothing. It is ADDICTIVE, by activating the dopamine pleasure center in the brain to a tremendous degree, cocaine becomes far more important to you biologically than food or sex.  You will have a tremendous motivation to break out that next line at the first hint of a fading high. By the end of the night you're broke, uncomfortable, and jaded holding an empty bag and thinking about how you have to be at work in two hours.  Do not do this, but everybodys gonna live their own lives: only the dumb die young.</p><p>#2 After you stop using, the ride isn't over.  For the next month, I had short (hour or so) periods of depression; especially in the morning.  I had periods of rising anxiety and uncomfortableness, but not full blown panic.  And I ate like a big something that eats alot.  I guess I must have temporarily damaged dopamine drug-receptor complexes resulting in the compulsion to eat. this would cause compensatory stimulation in the rewards center, which also helps curb the depression, but only nominally.</p><p>I never had any actual withdrawal other than the above symptoms which were just part of my medicine. They also serve as effective deterrents from ever repeating such a foolish, sleepless, long binge. I haven't desired coke since.  I think the most effective tools for quitting for me, that still stands strong today, were the associations that I had purposefully built between the thought, the smell, and the word cocaine and the horrible comedown/crash feelings that live so vividly in my mind.  It worked for me, but my best advice is DONT EVEN GET STARTED WITH COCAINE.  ITS TOO FUCKING GOOD AND ITS TOO FUCKING BAD! I don't have too many regrets but this ones a sadistic bitch! She's got the upper third of the rim of her powdery pink nipple rising towards the sky from her tight leather corset but concealed just behind her back is a 36 hardwood baseball bat with a rusty nail carelessly speared through the shaft.  She waitsTHWAK!</p>",
 "year": "2001",
 "id": "9759",
 "gender": "Male",
 "timestamp": "2005-07-09T07:00:00.000Z",
 "views": "9915",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": " repeated",
   "administration": "insufflated",
   "substance": "Cocaine",
   "form": "(powder / crystals)"
  }
 }
}
