{
 "title": "Blackout/Rebirth",
 "author": "Common Sense",
 "citation": " Common Sense. \"Blackout/Rebirth: experience with Cannabis (ID 976)\". Erowid.org. Nov 14, 2000. erowid.org/exp/976",
 "substance": "Cannabis",
 "bodyweight": "170 lb",
 "report": "<p>I have developed a high tolerance for marijuana over the last three years. I commonly roll the herb in emptied cigar leaves. I was preparing to attend a concert later on one day when a group of friends and I began smoking.  My anticipation of the events were focused, and resulted in the following experience....</p><p>The day began around 11a.m. when I woke up, and immediately thought about the concert I was to attend that evening. It was at a club downtown and the doors were to open at six.  When I arrived at my buddy's house around 4:15, he and his two roommates were eagerly anticipating my arrival with a box of four large cigars.  I recall feeling tired all afternoon, and my only real motivation was the concert later on. As we began to smoke, my stomach began to rumble, my mouth began to salivate and my mind was still concentrating on the exciting night ahead of me. I hadn't had a bite to eat all day.</p><p>During the next hour and a half of smoking and conversation, we managed to finish off a half ounce in FOUR BLUNTS!!!  I was wearing jeans and two t-shirts on a hot and humid summer afternoon, which proved to be too much for my body to take. As we got in line outside the club I began to sweat - not just sweat, I began to drip. I was looking at all the people around me, and remember seeing everyone clearly in slow motion, very precise actions but no sound. A cold rush of air hit my body and startled me out of my current state. Just then a woman in line began wandering through the crowd. Everyone stopped and began looking at the commotion she was causing near a group of guys in the middle of the line. Someone said, 'Give me some of whatever she had,' implying she was under the influence of some sort of drug.</p><p>I continued standing in line for about five minutes before I was overcome with a numbing sensation from my head and moving down. My eyes felt confused at what was happening, I began to blink as if to clear my thoughts and realize what was occuring at the present. Then, in an attempt to establish balance, I reached out to a friend's shoulder and weakly uttered, 'man, I'm hot....' My vision was overcome with darkness and my head felt heavy, like a huge cloud of smoke was being pumped behind my eyes, burning, foggy thick clouds of smoke. As all sight dissipated, I began to sway off balance, stumbling into people all around, hearing the commotion but not knowing what was happening.  I felt the first person that I bumped into, but nothing after that.</p><p>I fell into a group of people and landed on the sidewalk.  I went into a series of seizures lasting two minutes. I could hear everyone around me panicking and calling for help. After 15 seconds my eyes opened and I could see the commotion around me on the street. Then I slipped back into a blind unaware state for another 15-20 seconds. The second time I awoke to see all of my friends with the most horrified looks on their faces, I thought I had dropped dead right then and there. I tried to tell them I was ok, but the words just wouldn't come out. I was gasping for air, unable to speak. One of my friends was on a cell phone calling 911. I wanted to tell them that I was ok, but I couldn't. Next I went back into the unconscious state for another 15 seconds. When I awoke I was surrounded by people offering me water, asking what I took, asking if I remembered my name, everyone was looking at me in disbelief. I stood up and said, 'I'm all right, I'm OK, I don't need an ambulance, I'm fine.'</p><p>What I experienced next felt like a rebirth. I was so disoriented by the events of the past few minutes that my mind was in a state of shock. I looked around at the commotion in long sweeping glances, trying to make some sense of it all. I felt weak. I felt a sense of a new beginning, a second chance, a resurrection. I was pulled inside the club, where I began to recuperate and recover. I drank lots of water and had some food, and slowly, over the next six hours at the concert, I began to feel stable. However, since this experience, I've felt a strange sense of re-orientation to this world. I learned to never smoke on an empty stomach. And my only logical explanation for the incident would be a weakening in my nervous system due to no food, heavy amounts of marijuana, and inappropriate clothes causing my body to overheat and shut down. I'm a lot more aware of my health and eating patterns and my smoking, so as to eliminate the chances of this happening again.</p>",
 "year": "2000",
 "id": "976",
 "timestamp": "2000-11-14T08:00:00.000Z",
 "views": "13633",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": " ",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  }
 }
}
