{
 "id": 977,
 "title": "Rather Foxy In Fact",
 "date": {
  "submission": "2002-02-24T08:00:00.000Z",
  "experience": "2002-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Dangerous Mind",
  "gender": "Male",
  "weight": 64
 },
 "dose": [
  {
   "time": "0",
   "amount": "8.0 mg",
   "administration": "oral",
   "substance": "5-MeO-DiPT",
   "form": "(capsule)"
  },
  {
   "time": "3:30",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  }
 ],
 "report": [
  "t+0:00: Swallowed 8mg 5-MeO-DIPT ('Foxy') in a gelcap",
  "t+0:07: My stomach feels like a cross between a rock and a hunger pang.",
  "t+0:15: Arrive at supermarket to purchase immodium",
  "t+0:20: Colors seem brighter, and I had trouble counting out change for my purchase. My head buzzes in unison with the refridgerator next to me.",
  "t+0:33: Walking home, I notice how nice my jeans feel against my legs. Rather Foxy in fact.",
  "t+0:35: I arrive back at the dorm, and I feel a little bit naseuous. I take 2 mg loperdamide (generic for Immodium) to combat the potentially nasty side effects of the Foxy.",
  "t+0:40: I've sitten down to write, and the naseua has subsided somewhat. Decide to take a shower.",
  "t+0:46: Naseua is back, along with a headache. Going to take an advil and try to ignore them both.",
  "t+1:15: The shower felt nice, I massaged my shoulders to relieve some muscle tension. My world became trippy as the water droplets ran down the tile. I felt/(still feel) lightheaded.  My orgasm was incredible, I had some intense Closed Eye Visual imagrey and flashes of light at the peak. I can see where Foxy gets its nickname!  On the physical side, an additional side effect of jaw tension was noted. Headache has left (probably due to the ibuprofen) but the naseua is still there. I think part of it is that i'm getting kinda hungry, I haven't eaten for the past 5 hours.",
  "t+1:22: When deoderants say 'Goes on Clear!' they're lying.",
  "t+2:15: Got some food. pasta and tator tots, then more pasta. I feel much better, because the food killed the naseua. I was getting trails in the dining hall. While eating, I listened to a group of skaters sitting next to me discuss Indiana Jones movies. As they described various scenes, I got very vivid imagry in my minds eye. As they talked, their words directly effected images in my mind. Very cool. On the way back to the dorm, a greyhound bus passed and made a loud startling noise; I didn't just hear it, I could actually -feel- the noise. This effect was definitely synthesia.  Foxy reminds me alot of LSD, in a number of different ways, expecially synthesia and the way it alters time perception. Foxy gives me 'time stamps,' which essentially mean that in my subjective world, time ceases to have a linear progression, and instead is a succession of discreet and seperate events. However, Foxy is more sensous than LSD, and I also find Foxy more psychologically agreeable. The downside is that Foxy seems to have a higher body load.",
  "t+2:25: Consumed an addition 2mg 5-MeO-DIPT. Oh as a side note: on the way back from eating, I picked up a leaf off the ground and put it behind my ear. When D asked me, 'What's with the leaf behind your ear?', I pointed to it and replied, 'This is nature.'",
  "t+2:30: I've sorted some things out, mainly regarding a summer job. Hrm. I'm still body tripping, and I see mostly light trails and colors. Going to head over to S's and play some guitar, and smoke some doobie. It will be interesting to see how cannabis affects Foxy. I have heard it strenthens the trip and intensifies visuals, so we will see. No physical side effects noted at this point other than jaw-clenching. My headache and naseua are gone.",
  "t+3:30: Went over to S's: smoked some cannabis and played guitar. Cannabis is definitely synergistic with Foxy. It essentially doubled the strength of the trip, at the expense of some clarity. Music was great, I was unusually creative and came up with some new licks. Going to get food.",
  "t+4:00: I then left S's to go get some food. Pizza tasted wonderful, in all of it's greasy glory. I'm about to watch American History X instead of going out and getting drunk. I am no longer getting trails, but I can still feel the Foxy, ie lightheadedness.",
  "t+5:45: American History X was fucking incredible, today was the second time I saw it. 'Hate is baggage.' So who needs it? Anyway my assessment of Foxy is that it is an excellent tool for both sex and introspection. Just don't go off the deep end with the dose, this shit is especially powerful when combined with cannabis."
 ],
 "erowid": {
  "id": "12825",
  "citation": " Dangerous Mind. \"Rather Foxy In Fact: experience with 5-MeO-DiPT (ID 12825)\". Erowid.org. Feb 24, 2002. erowid.org/exp/12825",
  "substance": "5-MeO-DiPT",
  "views": "7246"
 }
}
