{
 "title": "Step For Step With Comments",
 "author": "The Zegh",
 "citation": " The Zegh. \"Step For Step With Comments: experience with Diethyl Ether (ID 9771)\". Erowid.org. Feb 11, 2004. erowid.org/exp/9771",
 "substance": "Diethyl Ether",
 "bodyweight": "",
 "report": "<p>For or against, deadly or harmless, that's the responsability of the private user. In any case, I've tried to give a step by step description of what to expect.</p><p>1. Getting the stuff. pharmacies sell it. I dress up like a respectable person, and claim that I'm gonna sedate insects like bees. TIP: Before you start, open all windows possible, take off your sweaters and put them in a closet along with other clothing that you can be without. Cover yourself up with a blanket. All this is for avoiding the extreme smell afterwards!</p><p>2. First sniffs. Pour a little bit on a rag, and sniff it very carefully, or you will 'burn' your nostrils - the smell is extremely intense, and you can feel the smell of a closed botthe inside a plastic bag, inside a backpack! After a while you get locally sedated around your nostrils, and sniffing gets more easy.</p><p>3. Sedative pt 1. You feel like dizzy, and you can't stop sniffing and sniffing, and poring on more when the rag feels dry (it's not dry, but it feels like it), a background sound introduces, and is probably surrounding sounds from outside which get's washed together. Everything around you is in a bit of slo motion, and nothing that is told you is understandable.</p><p>4. Sedative pt 2. After 7-8 times of pouring on and sniffing, the background sounds get more into focus, and if you're not carefull you might let them take over and give you a panic attack. You might feel close to blacking out! Remember that this was used to sedate people during operations! You get extremely dozed out, and turn unable to raise up and walk - not because you can't, but because you don't want to - you can't. Motions around you get's like a crappy animation, and people trying to communicate with you doesn't make any sense at all (probably because they're on ether too)</p><p>5. Putting away the cursed rag. This part is like waking up after a knee operation at the hospital. You're very, very slowly getting out of the effect, and your head is clearing up, the only thing that seems to stay the same are your muscles - still dozed out - you may as well rest for a while.</p><p>6. Aftermath. If you followed the tip in pt 1, you shouldn't have any problem with smell, unless that was your home! Keep the windows open, and get out for some hours. When you get back to your home, you have got your smelling senses back, and can decide wether it still stinks, if so, you might consider washing up!</p><p>If you did not follow the tip, you must change clothing and wash everything possible to avoid the smell.</p><p>7. Xtra info. It's very important when it comes to the smell, because you won't notice it, but other people might even get an effect only by being close to you, besides the smell is terrible, and follows you like a cloud.</p><p>Smoking, and flames close to the ether = suicide, it's extremely flammable.</p><p>Although the information on the bottle says anything but 'sniff this' you should read it, just in case you want to make second thought about this.</p>",
 "year": "2001",
 "id": "9771",
 "timestamp": "2004-02-11T08:00:00.000Z",
 "views": "28273",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "500 ml",
   "administration": "inhaled",
   "substance": "Ether",
   "form": "(gas)"
  }
 ]
}
