{
 "id": 9775,
 "title": "Enhanced Psychedelic Effects",
 "date": {
  "submission": "2007-02-05T08:00:00.000Z",
  "experience": "2006"
 },
 "author": {
  "name": "willywonka",
  "gender": "Male",
  "weight": "89 kg"
 },
 "dose": [
  {
   "time": "0",
   "amount": "0.5 g",
   "administration": "oral",
   "substance": "Mushrooms",
   "form": "(dried)"
  },
  {
   "time": " T+ 24:00",
   "amount": "0.5 g",
   "administration": "oral",
   "substance": "Mushrooms",
   "form": "(dried)"
  },
  {
   "time": " T+ 24:00",
   "amount": "200 mg",
   "administration": "oral",
   "substance": "Modafinil",
   "form": "(pill / tablet)"
  }
 ],
 "report": [
  "I have had a suspicion for a while now that modafinil might be an interesting substance to take alongside hallucinogens, as shrooms tend to make me sleepy and modafinil is designed to enhance wakefulness. So I decided to try an experiment: on day one I would take took mushrooms alone, and the next day I would take exactly the same dose of mushrooms but with modafinil as well.",
  "Starting mid morning on day one, I ate 0.5g of dried cubensis shrooms. This is usually enough to give me a threshold experience with effects including brighter colours, increased concentration and a subtle feeling of optimism about the world. Today was no exception. A couple of hours later I took another 0.5g, and a further 0.5g one hour after that. By this point I was made up for the afternoon and I had a very pleasant time gazing out of the window and contemplating our (i.e. the human race) influence on this delicate planet. I devoted some time to thinking about what I could do to abate my personal contribution to this madness, and then got on with some housework. A fresh mind AND a clean home! As its peak, I reached a good level 2, but no more.",
  "Day 2: Same set up as before, but this time I took 200mg modafinil along with the 0.5g shrooms. I was not prepared for the intensity of what followed. As I began to come up I found myself unable to contribute to the conversation and I quickly realised that I wasn't going to want to take any more shrooms. The feeling was similar to a mushroom trip in that my thoughts were slightly fragmented, but the visuals were very different. I saw none of the usual shimmering and geometry, instead everything appeared quite normal, but with the most intense and syrupy colours. I felt extremely comfortable - similar to being stoned - and for a while I wondered whether I was going to lose myself entirely. There was certainly no way I was going to take any more shrooms. The most intense part of the trip lasted about an hour and was a high level 2. Its difficult to describe in what ways it was different from shrooms alone, but I was certainly more aware of the outside world and less introspective. All in all I thought it was a pretty impressive response from 0.5g of shrooms!",
  "In retrospect I can say that the modafinil definitely increased the intensity of the trip. It cannot be due to any dosing discrepancy as I homogenized all the shrooms before the experiment and I measured them out very carefully.  The two substances, in my opinion, go very well together and I definitely intend to try this combo again sometime."
 ],
 "erowid": {
  "id": "58332",
  "citation": " willywonka. \"Enhanced Psychedelic Effects: experience with Modafinil & Mushrooms (ID 58332)\". Erowid.org. Feb 5, 2007. erowid.org/exp/58332",
  "substance": "Modafinil & Mushrooms",
  "views": "12230"
 }
}
