{
 "title": "TCB-2 Overview",
 "author": "BilZ0r",
 "citation": " BilZ0r. \"TCB-2 Overview: experience with TCB-2 (ID 97779)\". Erowid.org. Sep 30, 2012. erowid.org/exp/97779",
 "substance": "TCB-2",
 "bodyweight": "80 kg",
 "header": [
  "DOSE:",
  " ",
  "",
  "TCB-2",
  "(powder / crystals)"
 ],
 "report": "<p>Experiments with TCB-2 (hydrobromide salt)</p><p>4:35pm 250ug ingested.</p><p>6:30pm possible alert. Unsure.</p><p>Nothing else to report. Slept well.</p><p>Following day</p><p>4:30pm 750 ug ingested</p><p>5:45 clear alert. I feel the classical body signals I feel when I take hallucingens, an uncomfortability in my neck.</p><p>6:45, there has been no progression. No visual or thought disturbances.</p><p>7:45, body signals dissipate.</p><p>Following day</p><p>5:26pm 3mg insuflatted. As expected, this is quite painful. The pain continues in my sinus for 15 minutes while I resist sneezing or blowing my nose.</p><p>7:30pm first alert.</p><p>8:30pm nothing greater to report. Wondering if the previous days effect was imagined.</p><p>Settle in to watch a movie.</p><p>9:00pm. I smoke a small amount of marijuana (quarter of a bowl). Feel very very stoned. Having difficulty expressing  myself. Realize I am having subtle visual hallucinations when looking at faces. Oddly, no CEVs.</p><p>10:30pm. Still having subtle hallucinations and still having difficulty expressing my thoughts when speaking. This is definitely a mild psychedelic experience.</p><p>11:00pm take 3.5mg of Zopiclone to sleep. I wake the next day feeling fine.</p><p>One week later.</p><p>2:17pm ingest 5mg with S (a 110lb female). Being to make a stew, assuming it would take several hours to kick in as it did previously.</p><p>2:30pm, first alert. This is not going to take hours to kick in.</p><p>2:45pm, the classic body sensations I get are kicking in. The continue to mount for half an hour. No visuals to report, however I am having significant difficulties in expressing myself succinctly. S reports that she felt it kick in within 15 minutes, but didn't want to say anything after I had claimed 'it will take several hours to have an effect'. I took the 5mg dose assuming it would take several hours to kick in, and so I began to make dinner, however, I am already significantly disorientated as I make the bean stew, thankfully it just get it done before I start to experience co-ordination difficulties. I sit down to watch The Fantastic Mister Fox.</p><p>2:50pm Open eye Visuals are beginning to start (interestingly, no CEVs) Not currently what I would call classical psychedelic effects, but effects like that TV screen seems further from me than I know it is, or other size and scale distortions.</p><p>3:00pm, Full psychedelic state. ++/+++. Large degree of visual hallucinations, fractals patterns, apparent movement of details, etc etc etc.</p><p>---</p><p>3:00am, The ++/+++ state continued for the last 12 hours. I was without anxiety, depression or nausea. S reports similarly. She has had potentially a slightly higher degree of visual hallucinations. Insignificant side effects are very shaky hands. S is very stimulated and declares she will not be able to sleep. I am unsure if I will be able to. We both ingest approximately 10mg of zopiclone to sleep.</p><p>---</p><p>1:00pm the next day. There are still subtle visual effects, like visual snow. We are both tired and groggy. I develop a rather bad headache. S does not. I attribute the headache to dehydration due to general partying over the preceding days. The next day the headache is gone, and I feel fine.</p><p>Conclusions. TCB-2 does not appear to be the ultra potent hallucinogen some of it's pharmacological properties suggest it should be. It appears to be somewhat less potent than DOI.</p>",
 "year": "2012",
 "id": "97779",
 "gender": "Male",
 "age": "30",
 "timestamp": "2012-09-30T07:00:00.000Z",
 "views": "3758",
 "dose": {}
}
