{
 "title": "I Thought I Was Dying",
 "author": "anonymous",
 "citation": " anonymous. \"I Thought I Was Dying: experience with DXM (with CPM) (ID 9782)\". Erowid.org. Jul 27, 2004. erowid.org/exp/9782",
 "substance": "DXM (with CPM)",
 "bodyweight": "100 lb",
 "report": "<p>[Erowid Warning: Most Coricidin contains CPM (Chlorpheniramine Maleate) which can be dangerous in high doses. See DXM Brand Warnings for more info.]</p><p>My friends and I decided to skip school. We ended up going to my friend's Apt. After an hour or so we were bored and considered going to school but my buddy 'Nick' suggested that we take coricidin and 'trip our faces off.' I had never done it before and was told that it's great. Like any person would I trusted my friend and took 10 and thought... WTF i'll pop 6 more.</p><p>My body felt really loose and I was fine for maybe 20 min until I got nausous. I laid down on the kitchen floor because it was cool ( i felt like I was burning up) to try and feel better but that was no help. I couldn't even get up to get to the bathroom, I crawled to the bathroom and dry-heaved... I couldn't breathe and I was shaking like crazy. I closed the door so I couldn't hear everyone talking because I couldn't understand them and it scared the hell out of me b/c I was tripping out. I went in and out of consciousness and once in a while my friend would open the door and check on me and I couldn't even mumble words to her. Remember that I'm in a bathroom... I hallucinated that I was driving my car, talking to people... doing REAL things - I saw some wicked colors too and then i'd snap back into reality long enough to realize where I was and puke - not to mention I was struggling to breathe. At that point I thought I had overdosed and was dying.</p><p>Eventually the nausousness went away and I made my way into a bed. Even then I couldn't respond to people. After god knows how long, I wasn't sick...I wasn't even tripping but I had began to roll. I was incredibly happy and turned on some music and danced my ass off. Never again will I do that sh*t. It was SO scary.</p>",
 "year": "2001",
 "id": "9782",
 "gender": "Female",
 "timestamp": "2004-07-27T07:00:00.000Z",
 "views": "13380",
 "dose": [
  {
   "time": "0",
   "amount": "16 tablets",
   "administration": "oral",
   "substance": "DXM",
   "form": "(pill / tablet)"
  },
  {
   "time": "0",
   "administration": "oral",
   "substance": "Chlorpheniramine Maleate",
   "form": "(pill / tablet)"
  }
 ]
}
