{
 "id": 9786,
 "title": "Blue Sally",
 "date": {
  "submission": "2002-02-05T08:00:00.000Z",
  "experience": "2001-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Godbear",
  "gender": "Male",
  "weight": 77
 },
 "dose": [
  {
   "time": "0",
   "amount": "3 hits",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "extract-5x"
  }
 ],
 "report": [
  "I just got the Salvia extract(5x)I ordered.  I shall report the three attempts I've made using it thus far.",
  "1. I put a small amount of extract into my bong.  I drew as deeply as I could (I'm still recovering from a bout with bronchitis, so I had to take relatively small hits) and held it for about 30 seconds.  I took one more which cleared the bowl, but for some reason I exhaled after only 10 seconds at most.  My body started to feel somewhat weird and I began sweating profusely.  This peaked as I exhaled and gradually faded away in less than a minute.  It should be noted however that it was daytime and that the room wasn't very quiet.",
  "2. I put a little more than last time in the bowl.  By this time a friend and his girlfriend were over, it still wasn't dark and she was making a lot of noise.  I hit it again, this time getting two good hits and a paltry third.  I felt the telltale weirdness in my body, particularly in my elbows and knees.  I put more into the bowl.  As I did this I started to laugh hysterically.  I stopped laughing and started again, I continued to laugh between taking hits.  I closed my eyes, hoping for some visuals, but none came.  The body feel faded in about a minute, as before.",
  "3. This time I intended to enter Salvia-space.  I walked to 7-11 and got a blue flame lighter.  I decided to use my pipe this time, packing a full bowl.  I sat down in a very comfortable chair in a dark room, leaving the blue video screen on my TV on so I could see.  I intended to turn it off as soon as it hit me.  I took 3 large hits, holding them all in for at least 20 seconds each.  Between the time I exhaled my third hit and began taking my forth hit I forgot who I was and what I was doing.  In my mind, I saw a blue woman with blond hair and wearing a fifties style dress exit a blue house.  The dress was red with white polka-dots.  But my eyes were open and I was watching the pipe.  I felt as if I had known her all my life, in fact, she was my wife.  She said 'What are you doing?'.  I think I said 'Nothing'.  But not in an accusitory manner, in fact, I had no idea what she meant.  The  vision in my mind quickly collided with what I was actually seeing and ended.  I didn't close my eyes once while this happened.  It ended before I finished my fourth hit.  It was *very* vivid and intense.  I turned off the TV and relaxed, closing my eyes, but only vague rotating shadows appeared. ",
  "This was bizarre, for a few brief seconds I was living both lives at once.  I hope to have more journeys like this in the future."
 ],
 "erowid": {
  "id": "5839",
  "citation": " Godbear. \"Blue Sally: experience with Salvia divinorum (5x extract) (ID 5839)\". Erowid.org. Feb 5, 2002. erowid.org/exp/5839",
  "substance": "Salvia divinorum (5x extract)",
  "views": "5968"
 }
}
