{
 "title": "Sadder Than I've Ever Been Before",
 "author": "ClaY",
 "citation": " ClaY. \"Sadder Than I've Ever Been Before: experience with Mushrooms & Cannabis (ID 9786)\". Erowid.org. Jul 10, 2005. erowid.org/exp/9786",
 "substance": "Mushrooms & Cannabis",
 "bodyweight": "170 lb",
 "report": [
  "<p>Well, it began as a usual summer day, some occasional hits from the Bong up here in good ol' British Columbia, where some of the finest marijuana known to man grows. Well, on this particular day me and my friends decided to buy some mushrooms. After a bit of fooling around and paging dealers, we got hooked up with around 3 grams each, which we decided to put into a tea.",
  "A little while later, we all sat on my friends porch drinking down this tea. The reason for the tea is to help eliminate the terrible taste, and get them down quicker. Soon we were finished, and we satwaiting.",
  "Now, normally shrooms take around an hour to kick in, this time it started to hit us strongly after about 20-25 minutes, (because it's in tea) as we sat in my friends house. Everything seemed to become different, colors were much more noticeable, and everything seemed to be gently swaying around. Gawd damn I am high.",
  "We decided we needed to get out of the house, and go for a nice walk outside. It was night time, and we walked up through some parks, tripped out alot, and had an excellent time. Everything seems really funny on shrooms, and we were all laughing it up having a great time. Probably the best time I've had in years.",
  "Later, we returned to my friends house, and relaxed in the 'backroom.' Played some guitar, had a good time. Our friend Tom then arrived, with a special treat. 'Hey guyswell, looks like I'll be buying some marijuana to pack this BOWL!' At that moment he pulled out a large golden bowl, and a new bong.' I fell down laughing and screaming, and there was a lot of commotion. (Remember, we were intensely high and this was shocking!)",
  "Well, soon we went outside and into a hilarious room known as the 'tool shed.' A place where we often sit down in really high, and experience some intense insanity. My friend packed the bowl with 2 grams and the four of us starting hooting the bong, at approximately the peak of our mushroom high. Here's where things get interesting",
  "For some reason all of us on mushrooms agreed we were getting MUCH, MUCH higher off the pot, and we just kept toking. Soon our friend Tom left with his bong, and it was me, and 3 other friends.",
  "Now, I talked to my friend Sol, while friends Tyler and Chris said they were going to be across the street. Sol's body was shaking and he was too high to handle the situation, so he went into sleep. I went to go look for my friends across the street, nobody's there.  ",
  "Everyone went home. Why everyone suddenly went separate ways at the most intense part of the high I don't understandit was some weird circumstances. So here I am, standing on the street looking for my friends, confused as ever. After I realized I couldn't find them, I felt an extreme sense of loss, and sadness.",
  "Here I am, all alonenobody to talk to, nowhere to go but home. So high that I could not accept reality and why things are the way they are, I wandered around insanely for an hour, then slowly went into my house to attempt to sleep.",
  "I went into my room, where my brother who had cancer sat, writing down songs he likes. I felt as if I had been in his situation before, and lived his life. And I felt more sad then I've ever felt in my entire life. Looking into his eyes I felt the pain he's felt, his sorrow, I felt empathy.",
  "I eventually tried to lay down and sleep, and after a good hour or two, I went to sleep, but not before I cried. This and many other intense experiences have really changed me, changed my personality into a more loving and caring person, and opened my eyes to the world, for what it is.</p>"
 ],
 "year": "2001",
 "id": "9786",
 "gender": "Male",
 "views": "3821",
 "dose": [
  {
   "time": "0",
   "amount": "3.0 g",
   "administration": "oral",
   "substance": "Mushrooms",
   "form": "(tea)"
  },
  {
   "time": "0",
   "amount": "2.0 g",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  }
 ],
 "submissionDate": "2005-07-10T07:00:00.000Z"
}
