{
 "title": "Fun but Confusing",
 "author": "whoknows",
 "citation": " whoknows. \"Fun but Confusing: experience with 6-APB (ID 97879)\". Erowid.org. Oct 23, 2012. erowid.org/exp/97879",
 "substance": "6-APB",
 "bodyweight": "125 lb",
 "report": "<p>This is my first report.  I feel like others can benefit from hearing my experience, as there is not much information yet regarding 6-APB. </p><p>Previous experiences: MDMA, MDA, LSD, 25i-NBOMe, mushrooms, Bk-MDMA, cocaine, Cannabis.  I smoke weed every few days; I roll and/or trip about once per month.</p><p>A few weeks ago, a reputable source received a new batch of 6-APB.  He gave me some for free to try out, explaining it was a new strain of MDMA replacement.  MDMA is my drug of choice, so I was excited to try this new substance.  My first mistake: not researching this drug any further (something I usually always do).  I had no idea that 6-APB has much more psychedelic qualities than regular MDMA, and this came back to haunt me later.</p><p>Background info: I had two friends from my hometown (M and G; male) visiting me at college for the weekend.  The three of us, and my college friend (A; female), decided to use the 6-APB and go to a dance club downtown.  We are all 21, in good health, and have previous experiences with psychoactive drugs.  All of my previous experiences with MDMA type drugs (20+ times) have been at concerts or raves.</p><p>Set: I was in a very good mood, although a little tired from a late night the previous night.  We had planned for a few weeks to roll that night, so I was mentally prepared.</p><p>11:30pm- A and I each ingest 100mg of the 6-APB powder in capsules at a bar downtown. M & G had already ingested 200mg of Mephedrone. Throughout the night from this point all of us repeatedly dipped into the 6-APB powder and ingested orally, although I do not have time stamps for these. I estimate that I took 250-300mg by the end of the night.</p><p>11:45pm- starting to feel slight tingling sensation, much more alert.</p><p>12:00am- feeling very talkative and good, ready to walk to the club.  Tingling sensation is growing stronger, but no jaw clenching yet like I usually get when rolling.  When we get to the dance club (electronic music only  built like a rave), the lights look amazing, and the music feels great. We take more of the 6-APB. </p><p>12:30-2:00am- I am rolling face.  I experience euphoria and lack of inhibitions.  Dancing feels amazing, although I dont like dancing with other people.  I have a hard time socializing because the music sounds so amazing (this is normal for me). I am grinding my jaw extremely hard at this point, but I notice the lack of body high that I typically experience when rolling. In fact, my body feels relatively normal and I am quite aware of it.  I feel elevated levels of compassion and empathy towards everyone. The DJ is my favorite, the music is my favorite, my friends are my favorite, and everything is amazing. </p><p>It is important to note that the effects hit me in very distinct waves.  I would be feeling extreme intensity for 10-15 minutes at a time, then about 10 minute increments of what felt like complete sobriety.  I would consider taking another dip, but within minutes I would begin feeling extremely hot again and start dancing too hard to remember.</p><p>2:00am- M and G want to leave the club. I am not ready yet but we decide to go anyway.  We decide to walk home instead of taking a cab (40 blocks).  When we step outside away from the lights and music, the first thing I notice is how off-balance I feel.  I have a very strange sensation that my left eye is much bigger than my right eye, and the entire world seems to be leaning and expanding toward the left.  I found this extremely odd and it was difficult to walk in a straight line, although I didnt worry too much about it.</p><p>We spend the walk talking.  We discuss our separate experiences within the club, and it is instantly clear to me that A, M, and G all had very mild rolls, with some feelings of energy and euphoria but not very pronounced. This is surprising to me since A and I took the same amount, and she is smaller than me.  I accept that I am way, way more fucked up than them and continue enjoying our conversations.  I am very clear-headed throughout this time and not thinking about much other than being happy and walking straight. </p><p>3:30am- we arrive home. We decide to go for a swim and smoke a bowl.  Immediately after smoking, I realize it probably was not the best idea.  I suddenly feel more fucked up than I have all night.  I get extremely introverted, although still feel the physical restlessness of the 6-APB.  I am still grinding really hard, and having strange visuals.  Nothing is too profound at this point like when tripping, but everything looks really weird than how it normally does and colors are really intense.</p><p>4:00am- Everyone takes some 5-HTP to ease the comedown, and we all get ready for bed.  My pupils are EXTREMELY dilated still- there is practically no iris.  All three of my friends fall asleep instantly, yet I realize I am far away from sleep. </p><p>4:30-8:00am- While laying in my pitch-dark and room, I start experiencing extremely psychedelic aspects of the drug.  Open eye visuals of fractals, faces in my tapestry, neon colors flying around the room, pink lights being projected off of the fan. It very strongly resembles LSD visuals but with a much more electric look- almost like everything is looking like and moving through a glass screen. I try to close my eyes, and see moving fractals and weird faces.  I have not noticed any visuals like this until now, and am taken extremely off guard. </p><p>It sounds like dubstep is blasting in my head, even though the room is silent.  I try to enjoy it, but at this point I just want to go to sleep.  I do not feel mentally like I am tripping, as I am still very clear-headed, but the visuals take me off guard. It is especially uncomfortable since I still feel so restless, I am unable to lay there and relax to take it all in.  I become more and more confused and upset as these strange waves continue.  I do not know what to do with myself.  I take a shower, I watch TV, I move to the couch. Nothing is calming or comfortable, and it doesnt seem to be getting any tamer.</p><p>8:00-9:00am- My pupils are finally a little less dilated and I am not grinding my teeth as badly.  I become more comfortable simply laying in bed.  Eventually around 9am I doze into an interrupted and restless sleep.</p><p>12:00am- wake up, feel slightly nauseas but otherwise ok- just tired.</p><p>Conclusions:</p><p>I do not know if it was the weed that caused the change in effects, or the change in set/setting.  I do not think I took a substantial amount more of the 6-APB than anyone else. </p><p>I think I would have enjoyed this drug much more if I knew that there were distinct psychedelic qualities associated with it.  I also wish that I spent more time at the club, in order to exert more of my energy.  The fact that none of my friends had an experience like this also made the comedown extremely difficult. However, I felt no Tuesday blues like I normally do, and other than the exhaustion I felt fine by the next night.  Even the trippy part was not bad, I was just really freaked out that it was only happening to me, and for so long. </p><p>A big reminder to myself: always research your drugs, and remember that they affect everyone differently.</p>",
 "year": "2012",
 "id": "97879",
 "gender": "Female",
 "age": "21",
 "timestamp": "2012-10-23T07:00:00.000Z",
 "views": "5844",
 "dose": {
  "0": {
   "time": "DOSE: T+ 0:00",
   "amount": "100 mg",
   "administration": "oral",
   "substance": "6-APB",
   "form": "(capsule)"
  },
  "1": {
   "time": " T+ 0:30",
   "amount": " ",
   "administration": "oral",
   "substance": "6-APB",
   "form": "(powder / crystals)"
  },
  "2": {
   "time": " T+ 1:00",
   "amount": " repeated",
   "administration": "oral",
   "substance": "6-APB",
   "form": "(powder / crystals)"
  },
  "3": {
   "time": " T+ 4:00",
   "amount": " ",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": ""
  },
  "4": {
   "time": " T+ 4:30",
   "amount": " ",
   "administration": "oral",
   "substance": "Tryptophan",
   "form": "(capsule)"
  }
 }
}
