{
 "title": "A Happy Trip Story",
 "author": "Salty Dog",
 "citation": " Salty Dog. \"A Happy Trip Story: experience with Mushrooms (P. cubensis) (ID 979)\". Erowid.org. Dec 14, 2000. erowid.org/exp/979",
 "substance": "Mushrooms (P. cubensis)",
 "bodyweight": "176 lb",
 "header": [
  "DOSE:",
  "7.0 g",
  "oral",
  "Mushrooms - P. cubensis",
  "(dried)"
 ],
 "report": "<p>It was a sunny Nantucket day when I ate psilocybin mushrooms.  It was late July, pleasant, and I felt positive and adventurous.  I was curious as to whether the fungus could produce hallucinations or psychological changes.   At 3 p.m. I ate 7 grams of psilocybin mushrooms, chewing half very thoroughly. </p><p>I washed the mushrooms down with water, which I continued to drink for the next 30 minutes.  At this time I had expected to begin to feel the oncoming effects of the mushrooms, and I decided that I was beginning to feel disoriented.  I knew the effects that alcohol had on me, and I certainly was not feeling as sloppy or incoherent as alcohol made me feel.  A friend pulled into the driveway, and I began to talk about my experience with my housemate.  This was strange to me, as I wasn't out of touch with reality.  I began to try to explain the ever-increasing visual distortions and patterns I was seeing, and I focused on the friend's car.  It was a great land rover, and I was totally drawn into it, forgeting my conversation.  At this point I knew that I was fully under the influence of the mushrooms, and I went inside to study some objects that were textured and patterned.  Looking at a persian carpet, I saw the patterns morph and vacillate.  I placed a small object on the rug as a reference point, and it moved and swirled with the patterns.  I looked at wood grain, and found it vastly entertaining.  The lines moved fluidly, and I suddenly realized the basic fact that the wood had once been alive.</p><p>I decided it was time for a change in scenery and I headed out for a run.  My mental processes were fucked by this point, and if there were other factors motivating my run, they escape me.  I took a route out by a lighthouse, and that proved to be a valuable landmark.  I felt like I was running well and my body was feeling quite normal.  At this point my hallucinations were still based on the real visual stimuli surrounding me, such as waving grasses, trees, cars, etc.</p><p>Upon returning, I showered in the outdoor shower.  This proved to be quite an ordeal, as I was hallucinating vividly. It was almost frightening, but enjoyable.  I went inside and talked to my housemate and a few other friends that had come to the house.  I found this to be the most intense part of my experience.  My hallucinations now included geometric patterns, and I could not distinguish shadows and rays of light very well.  The room seemed to be backlit, when in fact the lights were in front of me. Social interaction was trying.  I felt awkward, and my verbal skills (which I am flagrantly overusing now) were diminished.  I could not carry on a normal converstation or finish a train of thought.  Someone briefly turned on the television, and the lit screen didn't seem to be attached to its surroundings.  I was also sweating profusely, which added to my agitation.  An old chair in the room seemed to take on a life of its own, developing humanoid features.  I found this very comical, but kept it to myself as best I could, because I was already uptight.</p><p>I left the room and people that, through no fault of their own, were making me self-conscious, and I took one friend with me.  We went to a small cottage on the property and smoked some excellent cannabis.  This increased the intensity of my hallucinations, boosting the colors and shapes to a more abstract level.  The time was now about 7 p.m.</p><p>We soon left for the beach, where I was antisocial, being focused inwards.  I had a moment of sober thinking, and introduced myself to a girl who was nearby.  We made small talk for a few minutes until I was flooded with the effects of the psilocybin.  I immediately broke off the conversation, and I cannot recall how.  I retreated to a dune and was soothed by the sound of waves crashing. </p><p>Upon returning home, I smoked some cannabis that I was particularly fond of with a small group of friends, and I again experienced a boost in my hallucinations.</p><p>The following morning I felt quite normal.</p><p>I had a positive experience with psilocybin mushrooms, and although the effects were sometimes confusing, overwhelming or mildly frightening, I would recommend the mushrooms to anyone who feels self-confident, strong and mentally postive.  I believe that I will repeat the experience again in my life.</p><p>This experience was totally rectreational, and I have since become intrigued with the spiritual aspect of mushroom use.  On my next trip I will try to be more focused and make more sense of the hallucinations if possible.</p>",
 "year": "2000",
 "id": "979",
 "gender": "Not Specified",
 "age": "Not Given",
 "timestamp": "2000-12-14T08:00:00.000Z",
 "views": "7517",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "7.0 g",
   "administration": "oral",
   "substance": "Mushrooms - P. cubensis",
   "form": "(dried)"
  }
 }
}
