{
 "id": 9795,
 "title": "Undocumented Phenomenon",
 "date": {
  "submission": "2010-03-10T08:00:00.000Z",
  "experience": "2006-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "k10",
  "gender": "Female",
  "weight": 61
 },
 "dose": [
  {
   "time": "0",
   "amount": "2 carts.",
   "administration": "inhaled",
   "substance": "Nitrous Oxide",
   "form": "gas"
  },
  {
   "time": "0:00",
   "administration": "oral",
   "substance": "Alcohol - Beer/Wine",
   "form": "liquid"
  },
  {
   "time": "3:00",
   "administration": "oral",
   "substance": "MDMA",
   "form": "powder/crystals"
  },
  {
   "time": "5:00",
   "amount": "2 carts.",
   "administration": "inhaled",
   "substance": "Nitrous Oxide",
   "form": "gas"
  },
  {
   "time": "5:00",
   "administration": "oral",
   "substance": "MDMA",
   "form": "powder/crystals"
  },
  {
   "time": "0:00",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "plant material"
  },
  {
   "time": "12:00",
   "amount": "1 cart.",
   "administration": "inhaled",
   "substance": "Nitrous Oxide",
   "form": "gas"
  }
 ],
 "report": [
  "I want to publish this report because there is scarily little information online regarding the particular state I found myself in, and beyond berating my substance abuse the people in the hospital werent able to help me either. Straight after a nitrous hit I generally experience a tingliness coupled with a dumbing down of my ability to distinguish between types of stimuli. Whats so strange about this experience of nitrous was that after I experienced these symptoms long after the trip, and from such a after a small dose of nitrous.",
  "It was my long awaited last night of term, and we had some nitrous in the house. Id had some at a party a week before  literally one balloon, as I was pretty ill (exhausted). Then I maybe had another 3 balloons over the week. Before that week I hadnt had any nitrous since a couple of particularly bingey session back in the summer, but even they were only about 6 doubles. This particular night, I had my first balloon at 8pm. Then, we started drinking, and at about 11 we had a dab of MDMA and got ready to go outthe mdma glimmered slightly, but I take such miniscule doses now, just a few of the tiniest grains, that I didnt really come up. More beer, another balloon at 1.00am, just cos we had some time to kill. Another dab of the mdma, beer, beer, spliffs, beer as we went from house party to house party, and then the sun came up and it was time to go home. So, I had a bedtime balloon at 8am, or rather, I just shared one.",
  "I think that maybe all the nitrous Id had that night had been more physically affecting than it usually is, but this wasnt something I noticed til afterwards, so it might be my imagination. All the other times Id used nitrous, it was the trip that stood out, rather than the sensation in my fingers, but almost all the other times I'd used nitrous I'd been tripping anyway.",
  "I did all the usual things  touched my hair and it felt static, ran my fingers about and everything felt kindof bumpy and curled up  I suppose that only a few of the signals from my nerves were getting to my brain. Time dilated, and as I often do, I started to look for the signs of the nitrous receding. After a few minutes, I told my boyfriend, I still cant feel my legs. Within five minutes I was walking round, thinking that I needed to encourage my circulation, and I did this for about 20 minutes, a bit bemused but the alcohol and sleepiness took the edge off my panic. Bf urged me to come back to bed, and I fell asleep immediately.",
  "Now, earlier in the night, after my first balloon, I was so overcome with tiredness immediately after that I just fell asleep and microslept for about 3 minutes  but this was the end of a busy term. When I woke up, at midday, the first thing I noticed with sheer panic was that I still could not feel my legs, face, arms and my fingertips were buzzing with confused nerves, but couldnt tell what anything was. For example, if I put my hand into my bag I couldnt tell what anything was, my nerves just couldnt work out what was going on (kinda like an anasthetic in that respect).",
  "I decided that I would go to A&E  nitrous is legal, and I was getting quite anxious. Anyway, there was a lot of explaining that Id taken the nitrous recreationally, and why Id done so, but the nurse briskly concluded that I still had my reflexes, fortunately I could still coordinate my limbs, (although I kept on stepping on things and not really feeling the impact until quite bruised) and so I could go home.",
  "Horrible horrible long walk home, I couldnt believe I wasnt dreaming. That night when I tried to eat something I realised to my horror that I couldnt feel my tongue either  I couldnt really tell where the food was in my mouth, so gave up. The following morning I was due to go to Paris  I couldnt sleep that night, but we decided to go ahead with Paris. Id been told to come back to hospital if the sensation hadnt returned in a day, but the nurses all thought this wouldnt prove to be necessary. While in Paris we got some b12 pills in a pharmacy  they contained 1,000,000% rda, and about 1,000 times the amount in most multivitamins. They were to be taken by strict vegans once every 10days, or daily for 10 days by people experiencing an attack. So I took some daily, for 3 days, and then exactly 6 days after it had started the tingliness went away. It faded, retreating down my legs, until it was just my fingertips.",
  "I stopped taking the b12, and annoyingly but not terrifyingly so, around a fortnight later it came back. When a bit drunk I noticed the static hair feeling again, and it all followed from that. Once again I chased it off with the pills, and now its basically gone. Id like a medical opinion, but the nurses I spoke to and the NHS direct lady didnt think b12 levels would cause the problem unless it had been ongoing for years. Im off nitrous for good now  such a great drug, hugely intense and with potential to be far more outside than anything else I know, but always with the safety net of coming back in a few minutes."
 ],
 "erowid": {
  "id": "58431",
  "citation": " k10. \"Undocumented Phenomenon: experience with Nitrous Oxide, MDMA (Ecstasy), Alcohol & Cannabis (ID 58431)\". Erowid.org. Mar 10, 2010. erowid.org/exp/58431",
  "substance": "Nitrous Oxide, MDMA (Ecstasy), Alcohol & Cannabis",
  "views": "5625"
 }
}
