{
 "title": "Memorably Amazing Night",
 "author": "ilove2cs",
 "citation": " ilove2cs. \"Memorably Amazing Night: experience with 25C-NBOMe (ID 98049)\". Erowid.org. Sep 12, 2012. erowid.org/exp/98049",
 "substance": "25C-NBOMe",
 "bodyweight": "170 lb",
 "report": "<p>I had some 2C-C-NBOMe (25C-NBOMe) on blotter and thought I'd try a moderate dose. I hadn't smoked weed in three months leading up to the experience. I used DXM two times previously, both Second Plateau doses.</p><p>T+0:00 Put the blotter in place at 8:55pm</p><p>T+0:10 Felt minor alerts, slight nausea, and put on music which sounds nice. Could be placebo effects. Have not swallowed saliva since I put the blotter in place.</p><p>T+00:11 Just noticed a strange, metallic taste in my mouth and a numbness in my right upper lip, where the blotter is. Reminds me of getting novacaine at the dentists office...</p><p>T+00:15 The blotter slipped from its place and I had to push it back up with my finger...very chemical taste that isn't necessarily unpleasant. Still haven't swallowed the saliva, and it's really starting to bother me.</p><p>T+00:25 I feel anxious, my heartrate has picked up and I felt what seemed to be an adrenaline rush. I felt my first 'alerts', and nausea is coming in waves. I still havent swallowed my spit and it's super aggitating! I think I'm going to swallow at +00:30. The nausea is quite heavy right now, its really bothersome. Nausea is worse when I'm sitting up than laying down.</p><p>T+00:30 There was a flash of light in the room after I turned on my lamp to check for visuals and turned it off again...scared the shit out of me and I jumped. I'm getting strange imagery in my mind from music, can't tell if it's placebo or not. Saliva isn't even bothering me anymore.</p><p>T+00:35 Feels as if I've just run around after eating, but lots of energy. No noticed visuals yet but I feel alert...it's hard to describe. Nausea comes in waves still, sometimes feeling as if vomit is actually at the back of my throat (nasty).</p><p>T+00:40 Swallowed all of my pent up saliva. Felt awfully nasty going down. Definitely feeling different but nausea freaking sucks...okay yeah my lamps shadow just turned into a Darth Vader helmet haha. There seems to be a hue coming off of everything. My body feels extremely strange? Like I'm somehow disconnected. I'm constantly reminding myself to breath. I can hear distortion in music that's freaking me out. Definitely an almost euphoric feel to this. Visuals have yet to become terrible evident.</p><p>T+00:43 Just started grinning for no reason... CEVs are like multiple gridded tv screens, showing cheshire cat smiling with his mouth rotating. Typing is extremely hard.</p><p>T+00:45 Visuals are evident, my blankets are warping and breathing. Excited feeling...</p><p>T+00:48 Big flash of light in the room randomly</p><p>T+00:51 CEVs are awesome, and so is music...seeing tons of strange things, one was a neon green snake.</p><p>T+00:53 Listening to Mercy... Visuals are crazy and I'm getting waves of euphoria like body orgasms running through me. The letters look all rainbowy as I type them</p><p>T+00:55 Fed a triceratops in my mind...it exploded into rainbows. CEVs are so much fun to toy with. Still waiting for the peak.</p><p>T+1:00 Chewed up and swallowed the remainder or the blotter. Difficult to type. Everything is warping and bending, but the headspace is clear enough to think and type. Tracers are making me laugh out loud...I wish I could record this. I'm shaking my head and as I do, the lights in the room repeat the shaking (slightly delayed) and then align back up, like they're trying to catch up. My fingers are a blur when typing.</p><p>T+1:05 The visuals on such a low dose so soon are incredible. I feel so unaware f my body. Im playing with my iPhone, waving it around the air and watching THE amazing tracers that follow from it.</p><p>T+1:10 Everything turned into psychedelic eyes...scared me for a sec lol. I turned on the lamp for a second and the room became an incredibly beautiful place. I tool out my earphones and I know what it means to exist, infinite, in a moment. I hear so many things... My senses are definitely enhanced.</p><p>T+1:20 Went to go pee to test how I would act in a social situation. I was strangely aware of my body and the walking sensation. The visuals are definite now, I just wish I could see them in the light. Energy is abundant. I thought I lost my iPhone but found it right where I was looking...herp derp; I was trippin so hard I saw it as having a personality. I can't say why but I feel like I'm attached to my iPhone. Like I was saying, I saw it as a person rather than an object so ignored it in my search for an object. This was incredibly entertaining yet tedious to type...three minutes have passed</p><p>T+1:25 Listening to 'Hey Ho' and thoroughly enjoying this. I'm aware of a restless amount of energy in my legs. Everything is hilarious and euphoric.</p><p>T+1:30 I feel a little lonely and wish I could talk to my girlfriend. Each breath is like new life. Everything is full of tracers and everything is so euphoric and sensual. You're missing out on this amazing world.</p><p>T+1:40 It makes me sad to think that no one I know had experienced this yet. Time distortion is crazy...I think I can hear a song coming from headphones on level three volume. The carpet is the trippiest thing I have ever seen in my entire life.</p><p>T+1:45 extreme tracers, patterns in carpet, warping, breathing, rainbow colored auras, breathtaking CEVs, and flanging are the visual effects.</p><p>Extreme Euphoria, energy and deep breaths feeling like new life are the physical.</p><p>My headspace is pretty clear, I'm just seeing things from a different perspective. Most amazing thing I've ever done.</p><p>T+1:55 My hallucinations all agreed that I should take out my retainer...I laughed out loud at how absurd this was getting. It's amazing all the same. Something I'm noticing is definite trismus, or whatever that jaw tension thing is. I'm doing it unnoticeable, clenching my jaw and grinding my teeth.</p><p>I wish people were more open to this kind of thing. It's truly phenomenal and amazing.</p><p>If my girlfriend knew what I was experiencing, she'd want to experience it too. I'm gonna tell her every last detail down to the smiley faces coming out of the screen while I type this.</p><p>T+1:55 I can't believe it's almost already been 2 hours. Fighting against jaw clenching to reduce pain in the morning.</p><p>T+2:03 two hours came and went and I was too busy listening to music to notice...I wish there were someone here to experience this took</p><p>Just got CEVs of these little things smiling crazily and wheeling around high fiving each other and everyone was high fiving each other with huge smiles...'Lover of the Light' by MaS</p><p>T+2:08 'Lovers Eyes' by MaS...thoroughly enjoying the song. Time distortion is terrible but everything is so enjoyable.</p><p>Music is amazing and I'm tripping very enjoyably. I might try to think about philosophy like this.</p><p>My CEVs have taken a definite aquatic/sea theme to them</p><p>I can hear so much more to music. It's phenomenal. I feel like I can play better too</p><p>T+2:30 I just went to the bathroom again, and stared at the carpet for quite a while. 'My Hearts a Stereo'</p><p>T+2:35 I've lost all sense of time...I just turned on my lamp and the carpet is amazing. I've been personifying non human objects cuz I'm lonely during this trip. 'Mercy' again and 'I Love You'.</p><p>T+2:45 I just turned off the music, sat on the ground, and watched the carpet form into tons of patterns and little mini people. The ships in the painting above my head are cycling through all of the colors which is really cool to see.</p><p>I noticed that the lights on the fan form a strange face, which is moving around and stuff.</p><p>Wood grains look amazing. I'm now regretting taking it this late, however, as I need to sleep.</p><p>T+2:55 I just went around my room, taking my time, and appreciated each and every object in it. That sounded high...I think I need to take more time to appreciate everything. I think I'm going to put music back on.</p><p>T+2:55 'Somebody That I Used To Know' by Gotye. The OEVs are clear. The legs of the table by my desk are growing and shrinking, yet what amazes me is that I'm still able to type this. I'm guessing the trip will be over soon, but well see...</p><p>T+3:00 Things started cool off on the visual field with the lights on, so I'm chilling in the dark listening to Dani California and feeling almost connected to the past people who listened to the same music on the same drug I am.</p><p>Slight stomach cramps.</p><p>Our generation can't learn to sit down and just enjoy a moment. It's always waiting for that next thing. Instead, we need to sit with music in our ears enjoying every minute in our lives.</p><p>T+3:05 My older brother just got home and came in my room to check on me. I told him I was trying it tonight, and he was curious. He asked about it so I told him it was awesome and he agreed to do it with me sometime.</p><p>T+3:15 CEVs are still going strong but I feel more tired and contemplative than I did before. I took this trip just because I could, just because I was excited to have the drugs and I was excited for Friday. I'm still excited. It's just that I need to learn self control and enjoyment in the moment because I'm always moving or thinking or documenting and I've almost pulled the mystical nature out of this trip. I need to learn to sit and enjoy moments in their beauty, with or without drugs.</p><p>Sound distortion is really cool, if I whisper it echoes in a really neat way.</p><p>T+3:25 'Hopeless Wanderer' by MaS still sounds amazing.</p><p>T+3:30 Time is going by extremely slow and I feel guilty about staying up this late. Im about to use the restroom for the third time tonight and will report on visuals after.</p><p>T+3:40 Realized mid-pee that my dad was sleeping on the couch when he stirred...I froze on the toilet, just sitting there as I heard him move on the couch a few times. I then realized he didn't have super hearing and figured he couldn't hear me if I went back to my room and silently closed the door so I did and here I am. Time is still moving ridiculously slow.</p><p>T+3:55 I can definitely feel it coming down now, and I'm glad because I'm tired. I can hear things in amazing detail still.</p><p>T+4:00:</p><p>I laid down in my bed and tried to go to sleep at T+4:00. I knew I had to get up at 8 for work in the morning, and it's a physical labor job, so I didn't want to be tired. I distinctly remember saying out loud to my hallucinations, 'alright guys, time to cool it down.' I laid on my stomach and drifted off into a light sleep, only to be awoken ten minutes later by an audio hallucination. I found I could only sleep on my stomach, and I kept getting woken up by random things, which I don't remember terribly well. Eventually I got to a solid state of sleep (around T+6:00), and woke up fairly tired but extremely happy the next day.</p><p>Everything between T+4:00 and T+6:00 is a blur honestly. I was trying to sleep and couldn't get there, yet I wasnt annoyed by it at all. I got into some pretty deep thoughts, none of which I remember. All in all, I'd give the drug a 5/5. It was enjoyable, euphoric, and even somewhat enlightening. I'm going to try a higher dosage next time for sure, and next time I'll be in a much better setting.</p>",
 "year": "2012",
 "id": "98049",
 "gender": "Male",
 "age": "16",
 "timestamp": "2012-09-12T07:00:00.000Z",
 "views": "5625",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "350 ug",
   "administration": "sublingual",
   "substance": "2C-B-NBOMe",
   "form": "(blotter / tab)"
  }
 }
}
