{
 "title": "Hit Hard by 1,4-B",
 "author": "Eric 'Ethno'",
 "citation": " Eric 'Ethno'. \"Hit Hard by 1,4-B: experience with 1,4-Butanediol (ID 9805)\". Erowid.org. Nov 1, 2004. erowid.org/exp/9805",
 "substance": "1,4-Butanediol",
 "bodyweight": "125 lb",
 "report": "<p>The experiment began when I came across  a bottle of 1,4 butanediol that had actually belonged to my friends mother. I had remembered reading about the psychoactive potential of the substance and I decided to start with a moderate sized dose. The butanediol came in this container with a measured dropper top, I measured out 1ml at a time and took 7ml in total. I held the total amount under my tongue in hopes of speeding up absorption. The substance tasted much like a solvent would be expected to taste, very strong and bitter, but not intolerable by any means. Ten to fifteen minutes later, I felt a mild intoxication and slight loss of coordination, with effects similar to the consumption of a moderate amount of alcohol. I presumed that the effects would stop at that point, but I was very mistaken.</p><p>About half an hour to 45 minutes after the initial administration, the effects increased with surpassing severity. I felt more drunk than I had ever felt in my life, I could barely walk and had to lie down. It felt as though everything was spinning around me, but I also experienced some feelings that are not generally associated with alcohol intoxication, such as a euphoria and relaxation that felt more like I had taken perhaps  4 or 5 Vicodin or 40mg of sublingual morphine. I felt some pronounced nausea, but like many opiates, the feelings of sickness dissipated when lying down. Nevertheless, I was completely incapacitated and was unable to get up for the remainder of the evening.</p><p>In retrospect, I believe I consumed a bit too much of the 1,4 butanediol for a pleasant experience, for in my trials after the initial dose I used a lower dosage, such as 2-3ml to achieve a more desirable and tolerable effect. From my experience, butanediol lasts about 5-6 hours and should thus be administered with great care. Also, be aware that 1,4 butanediol may potentiate the effects of other substances, particularly alcohol and other barbiturate like substances. I found my experiences pleasurable enough to order another bottle. It is likely that 1,4 butanediol will become increasing more difficult to obtain. Though it is a legal compound it is not approved for consumption, and as such is illegal to sell for its psychoactive purposes.</p>",
 "year": "2001",
 "id": "9805",
 "gender": "Male",
 "timestamp": "2004-11-01T08:00:00.000Z",
 "views": "13277",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "7.0 ml",
   "administration": "oral",
   "substance": "1,4-Butanediol",
   "form": "(liquid)"
  }
 ]
}
