{
 "title": "The Drunken DJs",
 "author": "feedmesauce",
 "citation": " feedmesauce. \"The Drunken DJs: experience with 2C-B (ID 98123)\". Erowid.org. Dec 26, 2012. erowid.org/exp/98123",
 "substance": "2C-B",
 "bodyweight": "175 lb",
 "header": [
  "DOSE:",
  "28 mg",
  "oral",
  "2C-B",
  "(capsule)"
 ],
 "report": "<p>Drug/Dose: 28 mg lab-tested 2C-B</p><p>Setting: Halloween themed concert/rave</p><p>Previous experience: Taken 15mg of 2C-B about 3 months ago</p><p>Time: 8:30 pm - 3:30 am</p><p>So me and some friends obtained 175mg of 2C-B powder a few weeks ago and have been waiting for the right chance to take it. 4 of my friends and I have taken this substance before but in much lower doses and in a controlled setting. The other 3 people have never tripped before but I felt like they could handle themselves considering the reputation of this drug being somewhat more social than traditional psychedelics. They all took about 25 mg some took slightly more some took slightly less depending on the person so we put the powder in some capsules and headed off to the show.</p><p>I knew about the long come up of 2C-B so my friends took it about 30 minutes before we arrived at the venue. For me, psychedelics usually hit me much quicker and because I was driving did not take it until we arrived in the parking lot. As we entered the show we realized it was a lot less people than at other shows but still a decent sized crowd.</p><p>After about 30 minutes after ingestion at about 9pm I began to feel a body load and felt a kind of opiate or a body like high that I could feel in my legs one of my friends also began to feel it. After another 15 minutes all of us began to feel that stomach feeling that I would say is a nervous feeling in the gut. 15 minutes later (about an hour since ingestion) we all began to experience visuals with the light show and also felt really good and could dance fine. Closed eye visuals came in the forms of triangles and tracers of light. Everything seemed hilarious and we all laughed and smiled.</p><p>I didn't begin to peak until about 11:00. At this point I felt like I was in a sea of people. I had almost no awareness of my body at all and it became extremely hard to dance unless I was paying attention to my movements. It was also very hard to see because of the distortion and everyone bumping into me and moving. We were all tripping hard, probably too hard for a show like this which seemed to be getting worse. The DJs, many which we've seen previously, got extremely smashed, and we couldn't help but to laugh at them more than dance. Many of the people around us were drunk and wearing costumes which was extremely trippy. The visuals were amazing and the CEVs were awesome, I wouldn't say the music was better but it seemed much different.</p><p>Once the headliner came on at around 12pm we were ready for a good show. But soon we realized that they were also very drunk and began to put on almost a mockery of this what was supposed to be a great show. All of our bodies were very sore but we continued to dance, to the same song that played 5 times during his set. We all wanted the show just to end, and most of our visuals were tapering off and I knew that I could drive again. Finally the concert was over and although my vision was fine my peripherals were still trippy and it was hard to see in the dark. I wasn't really hungry but we stopped at McDonalds to eat and the food didn't taste much different except it was weird to chew. We arrived back home at 3:30 am and instead of having an after party like we normally do just headed off home because we were extremely tired.</p><p>In conclusion we were all happy that we tripped 2C-B at this concert. If we would have rolled it would have been a waste of a roll, and any other drug didn't seem to be appealing. The visuals weren't the most intense I have experienced by far, but the light show and the costumes made it probably the best visuals I've ever had on any drug ever. The concert on the other hand could have been awesome if it weren't for the DJs getting too drunk and barely being able to play the set. Near the end of the show we found it extremely funny to make fun of them and when the drunk people in the crowd yelled encore we just yelled go home. It was a very good decision taking this at the show, maybe at a little lower dose because we did get a little anti-social. 2C-B is an amazing drug and I'd would take it at another show or just for fun for sure, the only downsides were that I didn't feel much spiritual insight and the body load.</p>",
 "year": "2012",
 "id": "98123",
 "gender": "Male",
 "age": "18",
 "timestamp": "2012-12-26T08:00:00.000Z",
 "views": "872",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "28 mg",
   "administration": "oral",
   "substance": "2C-B",
   "form": "(capsule)"
  }
 }
}
