{
 "id": 9812,
 "title": "Drunk for Hours",
 "date": {
  "submission": "2012-02-25T08:00:00.000Z",
  "experience": "2006"
 },
 "author": {
  "name": "jim hogshire II",
  "gender": "Male",
  "weight": "150 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "3 g",
   "administration": "oral",
   "substance": "Smarts - Phenibut",
   "form": "(powder / crystals)"
  },
  {
   "time": " T+ 1:00",
   "amount": "100 mg",
   "administration": "insufflated",
   "substance": "Smarts - Phenibut",
   "form": "(powder / crystals)"
  },
  {
   "time": " T+ 3:00",
   "amount": "1 g",
   "administration": "oral",
   "substance": "Smarts - Phenibut",
   "form": "(powder / crystals)"
  },
  {
   "time": " T+ 4:00",
   "amount": "100 mg",
   "administration": "insufflated",
   "substance": "Smarts - Phenibut",
   "form": "(powder / crystals)"
  },
  {
   "time": " T+ 5:00",
   "amount": "1 g",
   "administration": "oral",
   "substance": "Smarts - Phenibut",
   "form": "(powder / crystals)"
  }
 ],
 "report": [
  "<p>After mixing 3g into a drink, I quickly drank the bitter solution.  I would give the taste of phenibut as a comparison to very salty citric acid.  So, add lots of sweetener to your drink.  I found that saccharin was a good match.  I began to notice effects about an hour later.  I felt a feeling of stimulation first (increased heart rate).  This was followed by a feeling of extreme relaxation.  A few people I was taking this with experienced a slight headache in the form of pressure in the sinus cavities (the difference is that I HAVE been taking GABA as a supplement the past week, this may have affect my experience).  ",
  "I soon began to feel as if I were drunk.  The only difference was the ability to comprehend things.  I did not feel a loss of cognition.  After another hour, I decided to rail a small line.  WARNING THIS BURNS LIKE HELL.  I felt more intoxicated, but I do not recommend this.  After  another hour, I felt very very intoxicated.  This feeling increased until about 3 hours where it leveled off.  I was highly off base of sobriety by now and I would say my cognitive skills had decreased.  Because of this, I decided to eat 1g more of powder.  It tasted very badly, but more easily ingested than the drink mixture as I could chase it and dissipate the taste readily.",
  "I decided to rail another small line as well as ingest another gram of the stuff.  However, by now this dosage did nothing to my peak intoxication.  In fact I would strongly recommend not to increase the dosage after initial dosing due to the long half-life and nature of the substance. ",
  "Throughout the night I felt very intoxicated and even began to develop a slurred speech.  Upon recieving a ride home, I promptly went to bed.  I was typing this report on my computer when I passed out completely and awoke about 5 hours later, much like blacking out on alcohol.  I then went back to sleep and awoke 8 hours later still feeling slightly intoxicated.  I do remember have a deep sleep with very vivid dreams. ",
  "I still feel intoxicated way past waking up, and in conclusion believe I ingested way too much phenibut.  Please use caution with this substance and do not exceed 3g on your first use.  Believe me, this is enough.",
  "I'm rather excited about this substance as an anxiety reducer and an occasional recreational drug.</p>"
 ],
 "erowid": {
  "id": "58463",
  "citation": " jim hogshire II. \"Drunk for Hours: experience with Phenibut (ID 58463)\". Erowid.org. Feb 25, 2012. erowid.org/exp/58463",
  "substance": "Phenibut",
  "views": "14676"
 }
}
