{
 "id": 9816,
 "title": "Retrospective of My Life",
 "date": {
  "submission": "2010-01-20T08:00:00.000Z",
  "experience": "2007-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "AnX",
  "gender": "Male",
  "weight": 65
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "seeds",
    "quantity": "4"
   },
   "administration": "oral",
   "substance": "H.B. Woodrose",
   "form": "seeds"
  }
 ],
 "report": [
  "I'm a 20 year old student. I am not a regular drug user. I do love to take psychedelic drugs whenever I have an option to get them. I did shrooms a couple of times, tried Salvia which didn't work for me. So I wouldn't consider myself an expert in the field of psychedelic drugs.",
  "New years eve... Me and my friend, we've been planning to do something for a month. In the end both previous plans failed, in the end we settled on some Hawaiian Baby Woodrose seeds I ordered awhile ago from a headshop. I did it once before, but I was alone, it was a bit overwhelming. So I knew what to expect. We took the seeds around 22.30. I ate some food earlier, because I expected to throw up and I'd rather see that I have something in my stomach to throw up, because the last time it was a bit annoying. So I took 4 seeds, she took 3.",
  "Started out pretty normal, it was as I hoped to be. The stuff kicked in after awhile, but really kicked in around midnight. The nausea was present, at some points it was more powerful, on other points a bit less, well I just got really busy so I was able to ignore it is my best guess. We were making jokes, laughing. I was bursting with energy. It was what I expected. Everything felt really nice, physical touches were just divine, not in a sexual way or anything. But just felt really good. We were holding each other in embrace and laughing and having fun. Even though I had a lot of energy, I was incredibly lazy. It does that to me, makes movement impossible. After awhile we moved to my room, the bed was much more comfortable. Music choices were pretty interesting I'd like to add, first we began with some Pavement. It felt really good, we were joking about the fact that who actually signed those guys up. Don't get me wrong, Pavement rocks, it was just a friendly joke.",
  "It was funny, we joked about everything I recall myself actually mentioning the fact, that I have no idea how could this state be philosophical, introspective or anything. Speaking of the devil... Suddenly all changed, the initial rush of laughter and jokes stopped and that's where the most amazing new year's eve in my life actually began. She's a good friend of mine and I trust her, we've been really good friends, and at that point I've decided something changing. I said : Hey I want to talk to about myself. How egocentric eh? But that's when the flow of thoughts was released. My life, me in a nutshell. I started just talking about everything, my feelings, my character, how I perceive myself, what I did, what I thought about my friends, family and everyone around me. In that moment I was able to clearly formulate my thoughts in my mind. I was aware of all those things, but I never could actually express them. It was great she was there, because I realised she's one of the few people in my life that would be able to follow me.",
  "So I talked and talked and talked and every story I told just forked, split on several times. Threads were opening, I was jumping up and down throughout my life and thoughts. Opening every aspect, for the first time I was able to talk openly about some things that were just hidden in my mind. It felt great. It was amazing. At that point I figured out this was the best new year's eve I could ever imagine. The music changed here we put on mostly different electronic ambient artists, calm things. Antimatter's Planetary Confinement was great not electronic though, Monolake's Honk Kong also felt nice etc. I was really enthusiastic about music, I really felt connected to it. Loved to talk about it.",
  "After I was done talking about myself, my friend began to get sleepy, she took a bit less than me, so I was still feeling the effects. But my energy was dying out as well. At this point the closed-eye visuals were a lot more intense, or I just began to notice them, they were mushroom-like, but more chaotic, they were there, but it was hard to actually put them into patterns. I couldn't make myself comfortable, the nausea was kicking in again, stronger than ever. Annoying, on the other hand my back ached a bit more than usual, I'm not getting enough exercise, so that's the main reason, but the drug felt like it enhanced it, made it more uncomfortable.",
  "At one point the nausea became unbearable. I ran to the bathroom where I threw up. Looking at the toilet, I thought to myself that hey, I don't want this to spoil it. If shamans think that when taking Ayahuasca throwing up can be looked as purging your body and mind. I said I'll take it like this, it's my closure, the end of the trip and what a trip it was. I smiled, cleaned myself, went back to bed, it was all over, I had some problems sleeping. But after awhile I made it.",
  "In the time I'm writing my report it's about 24 hours since I ingested the seeds. I'm getting back to normal, throughout the day I was pretty much unresponsive and still now I'm thinking about this experience and how it was. It was a wonderful experience. Gave me a lot to think about come to think of it. Also very exhausting, I probably won't do Hawaiian Baby Woodrose seeds for quite awhile, I don't think my mind could actually handle it. At least half a year. Or even more. But this changed my opinion on LSA completely, it has to be treated with respect and it can be your best friend otherwise it can be a nightmare."
 ],
 "erowid": {
  "id": "58477",
  "citation": " AnX. \"Retrospective of My Life: experience with H.B. Woodrose (ID 58477)\". Erowid.org. Jan 20, 2010. erowid.org/exp/58477",
  "substance": "H.B. Woodrose",
  "views": "2158"
 }
}
