{
 "title": "A Dance With NBOMe",
 "author": "airwolf420",
 "citation": " airwolf420. \"A Dance With NBOMe: experience with 25I-NBOMe (ID 98169)\". Erowid.org. Dec 11, 2012. erowid.org/exp/98169",
 "substance": "25I-NBOMe",
 "bodyweight": "158 lb",
 "header": [
  [
   "DOSE:",
   "300 ug",
   "insufflated",
   "2C-I-NBOMe"
  ]
 ],
 "report": "<p>Setting: The plan for the night was to experience a completely new drug, as well as a type of music I had never heard of before (Industrial). I was nervous and before now I have only had experience with MDMA. I had a couple of beers and a few joints with a friend and some people I had just met that night. My friend, M, has had experience with psychedelics and so I was eager to dose at the same time as him. We relaxed with some music and then it was time to dose up.</p><p>Mindset: I was fairly nervous about the whole thing, especially in relation to the hallucinations and vasoconstriction I had read so much about. However my desire to try something new overpowered this, and I am so glad I went through with it. I guess the most preparation I did was to have a solid meal before I went out, along with reading up on the substance beforehand.</p><p>Dose: We were offered a 600 microgram capsule each, but since it was my first time with any sort of serious psychedelic, M and I decided to split it between us. The RoA was insufflation, and looking back on it it seems like the best form of dosing.</p><p>And so T0:00, the insufflation was painless, unlike anything I've snorted before. Pleasantly surprised.</p><p>At T+0:05 we decide to head off into the night towards the club that is putting on an industrial music night. M and I both agreed we were feeling a little amped, but I'm fairly certain it was a placebo.</p><p>At T+0:20 we got to the club, still feeling nothing in particular. We paid in and I put my jacket away and got myself a drink. The music was very loud, and the night seemed to be in full swing.</p><p>Around T+0:30 I start getting these little rushes of.. I don't know what it was. I think I can compare it to MDMA when you first start to feel a shift in perception. I was happily enjoying the music and all it had to offer, I love discovering new forms of music. I like my house, psy-trance and really anything electronic, so this was a nice amalgamation of my tastes.</p><p>T+0:40, M and I discuss the music, but then at the same time there was a swell in the music which made us go into a massive euphoric rush. I find it funny now to type it out, as we both experienced it at exactly the same moment. It was truly a great moment, and we both let the music consume us.</p><p>After this point it becomes hard to keep track of time. The music only lasted 3 hours, but that was plenty of time to experience the magic of this drug. The nightclub pumped out massive amounts of dry ice, which made it impossible to see anyone around, and it really helped the drug take hold. I started noticing these green slivers of light on people's back and shoulders, and I knew I was well and truly on my way. And then I closed my eyes. Wow, it was amazing the visuals I had, almost like these specks of green and red like christmas tree lights, all whilst rotating in a swirling pattern. Absolutely stunning. I had my eyes closed on the dancefloor whilst dancing, and I had to reopen them every so often to make sure I wasn't dancing away from my spot.</p><p>I went out for a cigarette, and it was probably the slowest smoke I've ever had. I kept staring at the streetlights and the aura around them. It was truly beautiful.</p><p>Eventually the night ended, and we began a walk back to a friend's place to smoke some joints and chill out. The effects were definitely diminished, but I couldn't help but notice the ease of conversation and the laughter that the group was going through. I can only assume that this was due to the 5-HT2 antagonist in the drug, but I loved the moment and it was great to just talk without any inhibition it seemed.</p><p>I walked home that night, it was a long walk of about 45 minutes, and I could definitely still feel the headspace of the drug. I looked at streetlights and car headlights all the way home, being completely entranced by them.</p><p>All in all, if you're wondering about trying this drug... I definitely recommend it. It's very gentle, although I only took 300 micrograms I was definitely intoxicated enough to take a lot away from the experience. I have yet to decide whether I will do it again, perhaps in the future but not so soon.</p><p>Stay safe, thanks for reading.</p>",
 "year": "2012",
 "id": "98169",
 "gender": "Male",
 "age": "21",
 "timestamp": "2012-12-11T08:00:00.000Z",
 "views": "1394"
}
