{
 "title": "First Tramadol Dose",
 "author": "Tramadol Dose",
 "citation": " Tramadol Dose. \"First Tramadol Dose: experience with Tramadol (ID 98230)\". Erowid.org. Nov 11, 2012. erowid.org/exp/98230",
 "substance": "Tramadol",
 "bodyweight": "225 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "100 mg",
   "oral",
   "Pharms - Tramadol",
   "(pill / tablet)",
   " T+ 1:30",
   "50 mg",
   "oral",
   "Pharms - Tramadol",
   "(pill / tablet)"
  ]
 ],
 "report": "<p>I was prescribed Tramadol this past week for back pain by my neurological doctor. I have been prescribed Tramadol in the past for back pain but I never used it because I had a large bottle of Vicodin on hand and I really had no idea what Tramadol even was, I thought it was just some weak codeine like medication.</p><p>My opiate history: I have used Vicodin, Oxycontin, Morphine and Dilaudid many times in the past. I built up a large tolerance to Vicodin about 3 years ago (up to 9000 mg daily), but since than I haven't really used any Opiates besides Norco and Dilaudid, which I only used for a couple of weeks.</p><p>Mindset before taking: I was in a fairly good mood and somewhat excited about the fact that I was about to use a new drug, even more so considering it was a synthetic Opiate.</p><p>Setting: Typical Midwest Fall day. It had been raining all day but the rain subsided and there was a cool breeze. I had just gotten out of the shower after picking up my prescription before deciding to take the pills.</p><p>4:00 PM  Just finished my shower and took 2 50mg pills.</p><p>4:30 PM  Started to feel a slight numbness in my legs. Weightless is a better way to describe how my legs felt. The feeling was intensified when walking or moving around.</p><p>5:00 PM  Feelings of happiness and relaxation took over. My entire body started to feel numb. I really started to enjoy the feeling I was having. I cannot exactly compare the one hour time lapse to that of Hyrdocodone or other painkillers, the whole rush feeling was nonexistent.</p><p>5:30 PM  Took a ride with my family to pick up my sister. Took another 50mg pill while waiting for her. Body high was really starting to set in. Entire body started to feel numb. Slight dizziness and body started to feel heavy at this point.</p><p>6:00 PM  Two hours after initial dose of 100 mg and a half hour after taking additional 50mg dose. Walked into restaurant to eat dinner. At this point I started to feel sluggish and I was not as hungry as normal, but I could still eat and eat I did. I started to feel like I had the urge to get up and walk around. Took a walk to the bathroom 15 minutes after arriving at restaurant and walking was not exactly the easiest thing to do at this point, I felt very sluggish.</p><p>6:45 PM  Left restaurant. As I was walking to the car my entire body felt very, very numb. Almost weightless, but heavy at the same time if that makes any sense.</p><p>7:30 PM  arrived at the Red Mango (yogurt shop). Sluggish feeling started to take over. Walking became difficult but I was feeling very relaxed. Communicating became difficult but still feasible. Mild euphoria started to set in and I just felt good all over.</p><p>8:30 PM  I believe at this point I hit the peak of my dose, and tiredness started to set in but at the same time I wanted to walk around more just to feel the effects. I felt more relaxed than I have felt in a long time at this point. Almost similar to the relaxation I would feel on a regular dose of Xanax.</p><p>9:30 PM  I started to feel slightly itchy. Somewhat wanted to take another 50mg pill but decided against that as I also started to feel even more euphoric as time went on. Still felt sluggish and dizzy. Body high was slowly rescinding.</p><p>10:30 PM  At this point the effects were starting to wear off. Euphoria was still there but itchiness increased and restlessness was getting worse. Not the most pleasant comedown.</p><p>12:00 AM  Effects were gone for the most part and the only lasting effect was sluggishness. Still relaxed but body high was gone and eurphia was hardly existent.</p><p>Conclusion: Tramadol is a unique drug. Its effects were almost similar to Dilaudid, or a low dose of heroin. I was really expecting a rush, but it just didnt happen. Would make the high 10 times more enjoyable.</p><p>This drug is just plain hard to explain. The high was really different. With more experience I may write another review but at this point I just dont know what to say about it. My best advise would be to start small, maybe 100mg and go up from there if you enjoy the feeling.</p>",
 "year": "2012",
 "id": "98230",
 "gender": "Male",
 "age": "23",
 "timestamp": "2012-11-11T08:00:00.000Z",
 "views": "12934",
 "dose": [
  {
   "time": "DOSE: T+ 0:00",
   "amount": "100 mg",
   "administration": "oral",
   "substance": "Pharms - Tramadol",
   "form": "(pill / tablet)"
  }
 ]
}
