{
 "id": 9826,
 "title": "Can Cause Significant BP Increase",
 "date": {
  "submission": "2007-01-08T08:00:00.000Z",
  "experience": "2006-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "phanerothyme",
  "gender": "Male",
  "weight": 70
 },
 "dose": [
  {
   "time": "0",
   "amount": "250 mg",
   "administration": "oral",
   "substance": "Propylhexedrine",
   "form": "capsule"
  },
  {
   "time": "3:00",
   "amount": "4.0 mg",
   "administration": "oral",
   "substance": "Pharmaceuticals",
   "form": ""
  }
 ],
 "report": [
  "After first reading about propylhexedrine, I was curious, but also somewhat hesitant. From what I had read, it definitely seemed to have potential as a stimulant, yet there are many reports of people experiencing moderate peripheral stimulation. It seems increased blood pressure leading to throbbing headaches isnt all that rare and certainly an unpleasant side effect. However, curiosity eventually got the best of me and I gave it a try. I bought an inhaler at a local pharmacy. I pulled off the top and took out the cotton. Dividing it into two, I stuffed it into two gelcaps. The following was written as throughout the experience.",
  "4:17 Took half the cotton in a gelcap. Feel normal, relaxed, its been a laid back day. Blood pressure (Bp) 125/71 pulse 74. Normally it would probably be lower, but Im slightly anxious just having swallowed something Ive never tried before. Just a regular Saturday. I intend to write a final paper for one of my classes. My stomach is empty.",
  "4:30 Slight stimulation seems to be noticed. Could be placebo. Feeling slightly more focused and  motivated.",
  "4:48 Definitely stimulated. Mild going towards moderate it seems. Second half swallowed. Feel energetic, want to get things done.",
  "5:00 Bp 132/64 pulse 64. I feel clearheaded, but not as focused as I wish I was. Full of energy.",
  "5:15 A general sense of well being is felt, but not much euphoria. Hopefully its still yet to have peeked. Feel clear and stimulated though.",
  "5:35 Mostly the same, slightly more effects. Mild euphoria",
  "5:47 Warm buzzing in the back of my neck. More euphoria, feels easier to get into things.",
  "5:57 Bp148/76 pulse 60",
  "6:17 Euphoria seems to be increasing. I feel happy to do anything I need to. Im hesitating on starting my paper cause im not sure where I want to go with it. A small shot of 25% alcohol was taken cause it seemed like a good idea. (This was not enough to have any significant effect) Tingles being felt throughout my body, my hair tingles when touched. Seems to come in waves a little bit.",
  "6:48 Very sped up. Very pleasant attitude, been working on my paper some as well as sipping some tea. An increase in libido is noticed. 178/83 pulse 60. Hope the blood pressure rise will chill itself out a little.",
  "7:02 Bp 170/94 pulse 62. Slight headache in the back right side of my head.",
  "7:10 Went into 174/101 for a little but now back to 164/94 65. Its still high but Im glad its not going up. I do not really feel any significant negative effects from this however, I feel great. Im now going to stop worrying about blood pressure.",
  "7:15 swallow 4mg of perindopril to lower blood pressure, though its not a major concern. At the moment I think the euphoria is lessened, but maybe its a wave or Ive bee worrying about my blood pressure too much",
  "7:35 Bp170/89 pulse 59. Bp is getting better, euphoria is good but may be diminishing.",
  "7:45 Still trying to figure out if Im past the peak, tingling still there, but I think I remember more. Jaw clenching is now noticed. Feel generally happy still. Finish tea hoping to give a boost. Bp165/89 pulse 64",
  "8:08 157/87 pulse 63.",
  "8:25 Effects are lessening. Not really hungry but going to try to eat.",
  "9:28 Definitely on the downside, but no crash really. Still stimulated.",
  "10:52 Still slight buzzing in my body present, but all the really worthwhile effects went away. Dont feel a bit tired or hungry (I did eat a sandwich just to get something in my body at one point), dont think Im getting to sleep anytime soon."
 ],
 "erowid": {
  "id": "58504",
  "citation": " phanerothyme. \"Can Cause Significant BP Increase: experience with Propylhexedrine & Perindopril (ID 58504)\". Erowid.org. Jan 8, 2007. erowid.org/exp/58504",
  "substance": "Propylhexedrine & Perindopril",
  "views": "21433"
 }
}
