{
 "title": "Sparkly Heaven Underwater",
 "author": "Robocat",
 "citation": " Robocat. \"Sparkly Heaven Underwater: experience with Robitussin Cough, Robitussin Cough & Cold (ID 9828)\". Erowid.org. Jul 11, 2005. erowid.org/exp/9828",
 "substance": "Robitussin Cough, Robitussin Cough & Cold",
 "bodyweight": "120 lb",
 "report": "<p>Robitussin? Yes, I know it well. Many a trip I have taken on this confusing and incredible road to pleasure and enlightenment. I started out with DM and found out only after about 10 trips that DM was not where its at, its MAX Strength Cough formula. Now, if you take DM, which is not recommended, (because of the other ingredientsyou really only need the dextromethorphan.) you will find and feel the true meaning of the word weird. GOOD weird, but weird nevertheless. Funny, but I sense a real difference between Robitussin brand and something imitation. It feels cleaner. Happier. And no, its NOT because I have been brainwashed by Robitussins commercials, either. I recommend Robe, but dont call me Dr. Mom, or Ill frame you for public nudity.  But anyway, the cleaner buzz-thing  is only with the DM or Cough and Cold as far as I can tell you. I dont think it really matters for Max. All it has in it is dextromethorphan and a tiny smidge of alkee-hol. Dex is dex I guess.</p><p>As for my experiencesheh hehwhere do I begin? Theres so much I have to say about Robe that I just cant confine it into this story which I am trying to keep fairly short. (Probably couldnt tell) Well, first off, the things  I like the best about the high are: (not in any particular order) Music puts you in ecstasy. I get reeeally into the music when I listen to it on dex. It sort of feels like being underwater. So another thing I ultra dig about the stuff is the sensory pleasure. I guess I would describe the buzz as heaven. Its not sleepy or foggy or anything like that, sort of crisp (especially with Cough & Cold) and happy and shimmery.  Dont underestimate the power of this drug just because its an over the counter medicine, because it has the potential to get you REALLY fucked up for a while.</p><p>If you smoke weed with dexoh, MAN are you in for some insanity. I have always wondered what it was like to be insane, and after that combination, I have an idea. One time my friend and I drank some R, but he ended up sharing his partially digested dose with the toilet, so I was on my own because he wanted to lie down for a while. But this time I drank Max and also smoked a bit of reefer and ended up shuffling around aimlessly and babbling incoherently in the empty playground across the street. You might wonder whats fun about that, but its the kind of thing where you either like it or you dont. I personally like going absolutely 500 miles into space/leaving it all behind every once and a while. Plus I was barefoot and the asphalt felt like infinite feathery oceans. (excellent sensory pleasure) To get the feeling I want, my RoboCoctail is 1 ounce or Cough&Cold and 3 oz. Max Strength Cough. The Cough and Cold makes the buzz more crisp and energetic. If I drink 4 oz. Of C & C, all the pseudoephedrine keeps me up too long and I dont get as fucked up. So thats why I add the 3 oz. Of Max, to supplement the fuck-uppedness. No, that word does not come from drinking too much Robitussin, silly Rabbit. (Trixs new slogan) And, on the other hand,  If I just drink 4 oz. Of  Max, I get so fucked up that the English language makes absolutely no sense. When someone says something to me, I have to ask them to repeat it like five times so I can recall just what these words mean.</p><p>Outside is SUPER fun on robe. Walking IS where its at on that stuff. You really have to try that. Sometimes I like to drink R, wait a  hour until it starts to kick in, and go on a walk for the next 5 hours. I have never tripped by myself, it doesnt seem like it would be as much fun. I like to trip with fun/funny impulsive people. You really have to accept the weirdness and not get freaked out by it, go with it. (These words are etched in gold into my mind (yes, literally) because it will always lead to inner peace, which is the best combination with any drug. (and not just with drugs either.) I bring this up because there was one girl that drank R with 3 friends and I, and just stayed quiet and looked freaked all the time. I guess she liked it and drank it a few times with us/ we were happier to have another person along. But she was probably too weirded out by the weirdly weirdness that dex makes you feel. (maybe I should cut down on the weird-usage. But it just describes it so well!</p><p>I suppose its about time to wrap it up before this becomes a 3-part novel. My recommendation is to try 2 oz. C&C and 2 oz. Max Strength. If you like the buzz it gives you, play around with the dosage until you get what you like the most. I am going to close with the most important part of this letter: everything is fine in moderation. Well, maybe not everything is fine, maybe not impregnating teenagers or killing at random or drinking gasoline, but mostly everyone who reads this should catch my drift. My firsthand account with too much Robitussin drinking over the span of about 8 months ended up with a bit of memory loss for about a year, (Forgetting words - Pissed me off after aum, whats that word?oh yeah, WHILE!) saying the wrong words some cakeFUCK I mean sometimes, and inserting letters where they dont belong</p><p>So be careful with it, pal.</p>",
 "year": "2001",
 "id": "9828",
 "gender": "Female",
 "timestamp": "2005-07-11T07:00:00.000Z",
 "views": "27484",
 "dose": [
  {
   "time": "0",
   "amount": "4 oz",
   "administration": "oral",
   "substance": "DXM",
   "form": "(liquid)"
  }
 ]
}
