{
 "id": 9830,
 "title": "Aura Of Light",
 "date": {
  "submission": "2007-01-03T08:00:00.000Z",
  "experience": "2004"
 },
 "author": {
  "name": "Morninggloryseed",
  "gender": "Male",
  "weight": "150 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "12 mg",
   "administration": "oral",
   "substance": "4-HO-MiPT",
   "form": "(powder / crystals)"
  },
  {
   "time": " T+ 0:30",
   "amount": "1 cart.",
   "administration": "inhaled",
   "substance": "Nitrous Oxide",
   "form": "(gas)"
  }
 ],
 "report": [
  "July 16, 2004",
  "12mg of miprocin (4-Ho-MiPT, N-isopropyl-N-methyl-4-hydroxytrypytamine hcl)",
  "Introduction:",
  "My partner Winding Vines and I had been planning a stay-at-home-and-make-love-all-night trip for some time. And finally, the plans shaped into place.  As the afternoon wound down, and daylight faded, we ruled out our original choice (2C-B) in favor of trying miprocin. We find the phenethylamines such as 2C-B are better suited for daylight, while the tryptamines (as miprocin) seem more suited for the night.  This was the first run for both of us with this particular material.",
  "Winding Vines has only three tryptamine experiences (psilocybin mushrooms.) With that in mind, plus reading about the compounds intense nature, and with the fact it was new to both of uswe decided to dose low, me with twelve-milligrams and she took thirteen.  I tend to be very sensitive to tryptamines, small dosages usually affect me quite profoundly, so I knew that twelve-milligrams would be enoughand it was.",
  "Experience:",
  "The miprocin came on very smoothly, it did not take but fifteen minutes for each of us to feel an alert. Initially, I felt a warm and cozy glow that reminded me of a glass of wine with a small dosage of MDMA. Then the colors became intensely bright and neon-like, sky-blues and aquamarines dominated the spectrum. Beautiful grid-like patterns and textures dominated with eyes closed, while the outside world churned and wavered with eyes open. Most pleasing was the complete lack of nausea and no speediness that many other synthetic psychedelics seem to produce.",
  "At the forty-five minute point, there was enormous time dilation. I remember looking at the clock and noting the timethen looking again not five minutes later thinking at least a half-hour had passed. I felt stuck in time, but the feeling was (thankfully) more interesting and amusing, as opposed to being uncomfortable. At the one-hour point the trip reminded me of psilocybin mushrooms in almost every way, the humor, color, mood, and relaxed feeling in the body were all there.",
  "While Winding Vines fiddled with our water filter in the kitchen to get us something to drink, I lay down and inhaled some nitrous oxide. The gas propelled me out of my body for what seemed like eternity, but in actuality was only about thirty seconds. Most notable from the nitrous were the strange buzzing, and harmonically-spaced noises I heard, which lingered for some time after the main effects of the gas wore off.",
  "When she came back into the room, we started kissing. As I kissed her, beautiful, sparkly, firework-like visuals were produced behind closed eye-lids. Kissing quickly led to moreand the miprocin enhanced the erotic to an incredible degree. Again, reminding me very much of mushrooms.",
  "Making love was a true sensory delight. The sensations, the smells, and the sight of my loves naked body with an aura of light around her were almost overwhelming. We made love with animal-like passion and ferocity. But we also felt intense feelings of love and empathy beyond just the simple lust. The words, I love you, must have left each-others lips a hundred times.",
  "As the peak approached, I became seized in fits of absolute of hysteria and my laughter became uncontrollable. At one point, I started laughing once while Winding Vines was initiating another round of love-making. I was not laughing at her, but still ended up having to explain myself so as not to offend her. At times I was laughing so hard, it was difficult to catch my breath. Again, all of this reminding me very much of psilocybin mushrooms which produce much of the same effect.",
  "The miprocin continued on for another couple of hours, gently tapering off into a warm after-glow around the five-hour point. The comedown was very gradual, although we both noted color enhancement for some time after the primary mental-effects died off. There was no residual stimulation or any body-load after the trip, once again reminding me of mushrooms. This was all very welcomed. We made love one more time, and then we each fell asleep around six hours after taking it. Sleep arrived easily.",
  "Conclusion:",
  "Though twelve milligrams never got me much past a plus-two, I was really very impressed with miprocin and thoroughly satisfied. At the same time, I noted that of all the 4-substituted tryptamines...this one was (for me) identical to psilocybin in nearly every way. The body feeling, the visuals, the mental effects, everything!",
  "In a sense, this is a negative. It begs the question, what is there to recommend this material over psilocybin? I am hard-pressed to answer that. The only reasoning I can come up with to recommend this over the fungi is that one does not have to eat the rank-tasting mushrooms.",
  "Barring that little detail though, I see little with miprocin that would drive me to choose it over the fungi. I do look forward to experimenting with it again, but with a larger dosage. Perhaps at higher levels, properties that are unique from psilocybin will become more apparent. Regardless though, it was a very enjoyable experience and I consider miprocin an excellent material, even if nearly identical to psilocybin itself."
 ],
 "erowid": {
  "id": "58526",
  "citation": " Morninggloryseed. \"Aura Of Light: experience with 4-Ho-MiPT (ID 58526)\". Erowid.org. Jan 3, 2007. erowid.org/exp/58526",
  "substance": "4-Ho-MiPT",
  "views": "12394"
 }
}
