{
 "title": "Possibly Just Too Intense",
 "author": "Jayce",
 "citation": " Jayce. \"Possibly Just Too Intense: experience with Smoking Blends - Cannabis-Like  (ID 98303)\". Erowid.org. Feb 26, 2013. erowid.org/exp/98303",
 "substance": "Smoking Blends - Cannabis-Like ",
 "bodyweight": "285 lb",
 "report": [
  "<p>I quit smoking cannabis quite a while back, a professional precaution.  When I did, though, I like most started with commercial brick, and worked up to 'kind' or the best local homegrown.  Lately, I've been experimenting with herbal potpourri.  I was fortunate enough to try the ol' trainwreck by haze.  Awsome 018 blend.  Last year I tried quite a few different blends.  As I travel for work, I get the chance to try alot of different brands and mixes.  I purchased a 3g package of Gorilla Dro about a month ago.  Figuring it to be nothing more than a 'weak' substitute, I made the mistake of taking a small sample puff on the drive home.  Fortunately I was only 3 blocks from my motel room.\r[Erowid Note: Driving while intoxicated or tripping is dangerous and irresponsible because it endangers other people. Don't do it!]",
  "I inhaled a small amount through a brand new unit, and then, like a ton of bricks it kicked in.  I couldn't feel my feet.  Hard to drive when you can't find your feet.  Panic onset like a real 'physical' heart attack.  It seemed to take a half hour to drive those three blocks.  When I somehow managed to park my pickup, I was stuck.  I couldn't put the vehicle in park, and my foot on the brake was all that was keeping the vehicle from moving.  I sat in my truck for what must have been 20 minutes or more, almost in a commatose state with my mind wandering different planes of existance. ",
  "Suddenly I began to realize that I was regaining my basic motor skills.  I put the vehicle in park, and stumbled to my room.  For the next 5-7 uses, the effects would be very similar.  An extremely powerful high, almost able to disconnect the brain from the physical body.  Keep in mind these effects are being reported from a completely clean individual.  I do drink every day, but nothing illegal goes into my body.  I hadn't had any other potpourris's for quite a while... perhaps 4-5 mos. ",
  "I can't imagine being an inexperienced smoker and being introduced to this product inproperly.  I have shared with others, but always let them know what they may experience, and I stick around to help guide them if they request help.  Not for the casual user, certainly not for anyone under 21.  Now that I've smoked around 6 grams over a couple months, the effects are much milder.  The tolerance took me about a month to develop, and the trippy times were intense up until then.</p>"
 ],
 "year": "2012",
 "id": "98303",
 "gender": "Male",
 "age": "40",
 "views": "1051",
 "dose": [
  {
   "time": "0",
   "amount": "0.1 g",
   "administration": "smoked",
   "substance": "Products - Smoking Blends - Cannabis-Like",
   "form": "(ground / crushed)"
  }
 ],
 "submissionDate": "2013-02-26T08:00:00.000Z"
}
