{
 "title": "Trial and Error",
 "author": "Max",
 "citation": " Max. \"Trial and Error: experience with 2C-G-NBOMe (ID 98327)\". Erowid.org. Nov 21, 2012. erowid.org/exp/98327",
 "substance": "2C-G-NBOMe",
 "bodyweight": "68 kg",
 "header": [
  [
   "DOSE:",
   "1 hit",
   "sublingual",
   "2C-G-NBOMe",
   "(blotter / tab)"
  ]
 ],
 "report": "<p>This was our first experience with a new supplier so we were all a bit apprehensive as to the quality of the tabs. We were told that they contained around 700g of 25G-NBOMe.  What with the drug supply in New Zealand being something of a lemons market, we are always highly suspicious of anything offered at such a reasonable price (I.e. Under $40 per tab). On top of this the internet seemed completely devoid of any information about this particular chemical, let alone any reliable trip reports. So being the first of us to try one of these tabs I decided to err on the side of caution, and take it in a relatively relaxed environment. This ended up being at a small house party with a group of close friends. The tabs were average size (at least from experience), but quite thick and with an unidentifiable pattern on one side.</p><p>21:05  - I place the tab under my tongue. I was careful not to drink any alcohol for about 30 minutes beforehand, as I hear this can affect the potency of some hallucinogens. The tab tasted odd; kind of bitter-sweet, with a strong numbing effect similar to coke.</p><p>21:25 - I believed I was starting to feel something subtle. I would describe it as a sort of lightness and a slight lack of coordination. However this may well have been nothing more than a placebo effect. By this time the inside of my mouth was numb all over, leading me to accidently swallow my tab without realising it at some point shortly after taking it.</p><p>21:55  A sudden and unquestionable come-up. Its very hard to describe how it felt initially, but I would definitely use the term weird. The effects were both physical and mental</p><p>I noticed it first in my jaw. Couldnt help biting and grinding my teeth, similar to that feeling I get with amphetamine but without the same satisfaction. There was also a distinct loss of some coordination and motor function, but this was not entirely unpleasant. Overall, a fairly strong body-high.</p><p>This was accompanied by increased energy and talkativeness, but again, these felt very different to the effects given by amphetamines. I didnt notice any paranoia, which is unusual for me, although everything felt somewhat unfamiliar. I was also smoking and drinking like a fiend by this point.</p><p>The visual effects seemed limited to patterns. These were pretty vivid, but I didnt notice any wall breathing, tracers or other typical effects. I would be interested to experiment with a higher dose, but as I can find so little information about this drug I dont plan to try it just yet.</p><p>23:00  By this time the gathering has moved to the local pub. Ill admit that at first this did not seem like a good idea to me, as I found the physical effects a little disorientating and would have been happier to continue chatting within the safety of the flat. However once we got going my concerns faded away, and I thoroughly enjoyed the short walk. The patterns appeared strongest on the asphalt of the road. By 11pm I noticed that the physical effects had largely worn off, which I didnt really mind, but the mental effects and visuals were still going strong. This was by far the best part of the night. I was still extremely talkative and getting steadily more drunk. I enjoyed this combination.</p><p>02:00  Back at the flat and still seeing patterns, but they were not as distinct and it was clear that the drug had nearly worn off.  I wasnt sure, however, if it would affect my ability to get to sleep. I felt as though I was tired and drunk enough to lose consciousness as soon as I put my head down, but just to be sure I decided to dope myself up with some prescription painkillers. This was undoubtedly a very dumb idea, but I certainly wasnt sober enough to make any responsible decisions at that point. </p><p>Overall I found these tabs to be very reminiscent of the typical $40-$50 tabs Ive had over the last couple years (in NZ LSD is very rare, so research chemicals have become the norm). It is not a substitute for acid or amphetamine, but the effects were enjoyable nonetheless. It is also worth noting that I took a second tab two nights later and found that it was substantially weaker than the first time, so I presume it does build up quite a quick tolerance. On the second occasion I took it while at a club in town, and thought that this hectic environment was much more suited to the drug than the quiet gathering of my first experience.</p>",
 "year": "2012",
 "id": "98327",
 "gender": "Male",
 "age": "20",
 "timestamp": "2012-11-21T08:00:00.000Z",
 "views": "3260",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "1 hit",
   "administration": "sublingual",
   "substance": "2C-G-NBOMe",
   "form": "(blotter / tab)"
  }
 ]
}
