{
 "id": 9837,
 "title": "Benzo Increase Effects?",
 "date": {
  "submission": "2001-03-24T08:00:00.000Z",
  "experience": "1996"
 },
 "author": {
  "name": "Anubis",
  "gender": "Male",
  "weight": ""
 },
 "dose": [
  {
   "time": "0",
   "amount": "2.0 mg",
   "administration": "oral",
   "substance": "Pharms - Diazepam",
   "form": "(pill / tablet)"
  },
  {
   "time": "0",
   "amount": "15 mg",
   "administration": "oral",
   "substance": "Pharms - Diazepam",
   "form": "(pill / tablet)"
  }
 ],
 "report": [
  "<p>Here's a 2C-B trip tip that I thought I'd pass on to devotees of this substance: when you take 2C-B, also try taking single tab of a benzodiazepine tranquilliser (such as Valium, Ativan or Urbanol), or alternatively a couple of tabs of a natural over-the-counter herbal tranquilliser, such as valerian.",
  "One would have thought that by taking a central nervous system relaxant as well, the effect of the 2C-B would be diminished - but quite the contrary. My experience is that by relaxing the mind and body, the trank allows the 2C-B experience to flow in with much greater ease and far greater effect. In fact, I find that by using this combo I need far less 2C-B to reach the same space. (Using 2mg of Valium and 15mg of 2C-B gets me to the same level as 25-30mg of 2C-B taken on its own.)",
  "Another plus to this combo is that it takes away the slightly speedy, restless amphetamine edge that is often part and parcel of a 2C-B trip. When taking 2C-B on its own, I usually find myself compelled to be busy up and doing something. With the trank combo, however, I am quite happy to lie back in a blissful, introspective state of reverie.",
  "We are all tense to varying degrees and possibly the more tense one is, the more rigid one's mental and physical defences are to the stimulatory effect of a phenethylamine substance such as 2C-B. So, fairly highly-wired people might like benzo combos better.  I was sure amazed that a mild trank can make such a profound difference to the experience.</p>"
 ],
 "erowid": {
  "id": "5854",
  "citation": " Anubis. \"Benzo Increase Effects?: experience with 2C-B & Diazepam (Valium) (ID 5854)\". Erowid.org. Mar 24, 2001. erowid.org/exp/5854",
  "substance": "2C-B & Diazepam (Valium)",
  "views": "19556"
 }
}
