{
 "id": 9846,
 "title": "Disaster: Way Too Much",
 "date": {
  "submission": "2007-04-28T07:00:00.000Z",
  "experience": "2006-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "McTavish",
  "gender": "Male",
  "weight": 57
 },
 "dose": [
  {
   "time": "0",
   "amount": "1 glass",
   "administration": "oral",
   "substance": "Alcohol",
   "specific": "Beer/Wine"
  },
  {
   "time": "0",
   "amount": "500 ml",
   "administration": "oral",
   "substance": "Alcohol",
   "specific": "Beer/Wine"
  },
  {
   "time": "0",
   "amount": "750 ml",
   "administration": "oral",
   "substance": "Alcohol",
   "specific": "Beer/Wine"
  },
  {
   "time": "0",
   "amount": "1 glass",
   "administration": "oral",
   "substance": "Alcohol",
   "specific": "Beer/Wine"
  },
  {
   "time": "0",
   "amount": "5 tablets",
   "administration": "oral",
   "substance": "MDMA"
  }
 ],
 "report": [
  "Well the day started out, was christmas, after opening presants and such we went out for dinner with my family(3pm). On arival we were told the resteraunt was not ready to seat people yet, so were asked to wait at the bar, so I had a pint of Guinness. We then were seated, me and my grandmother (I'm 17 years old in case anyone's wondering) had a litre of red wine between us. They took a hell of a long time serving us, during this I was getting stuck into the red wine. The portions we got were pretty small. About during the main course I ordered another pint of Guinness.",
  "After that we went home. I was feeling fairly tipsy, but clearly wanted to get more drunk. So I went round to my friends house with a bottle of mulled wine, how festive! But before I went I thought it would be a laugh to put on this tiger skin furry thong my mother got as a gag anyways. I went round to my friend's house and finished that while my friend had vodka if I remember right. I was fairly drunk by this point.",
  "I got a text from another friend who said he had gotten some pills. I was quite glad, since I do quite enjoy them. I bought five of them. I've taken pills before, as many as 9 in one night (of course through the night not all at once). I thought to myself that to get a good effect I should take all 5 at once, especially since last time I got some and they turned out to be fake. I took all of the pills at once and waited for the effects.",
  "For some reason I decided I should go home, and headed home at 8pm. From this point on I have no recollection, but I was informed by my parents. I came in, went up to my room, and sat on my laptop for a while. Apparently I was saying things like 'I CANT SEE!!!! THIS IS AMAIZING!!!! COULD DO WITH MORE!!!!' although I can't remember. My mother who was going to bed came in to my room at 11pm and found me rolling around the floor, she panicked and phoned my friend demanding to know what I had taken, and he told her to phone my dealer. My dealer told her that I had 5 tablets so she phoned for an ambulance.",
  "The ambulance came and they managed to get me downstairs into the hallway. The ambulance man tried to help me to the ambulance but I pushed him out the front door. The police then came and told me to come with them to the ambulance, I agreed and went with them. Outside my front door, with many on lookers my jeans fell to my knee's exposing the furry thong, the policeman let out a laugh and asked my parents for a belt.",
  "En route to the hospital I apparently asked the ambulance man what was wrong with the man lying down, and wether he was taking a heart attack or not. The ambulance man responded by saying that there was no one there. In the hospital I asked a few of the nurses if they wanted to have sex, needless to say none wanted to! I was asked to take my clothes off and put on a gown. I managed to get my clothes off and ended up running about naked, apparently shaking my penis at the staff and a female patient (who was apparently also under the effect of E).",
  "After another attempt at getting my gown the doctor attempted to put in an I.V drip of saline solution to rehydrate me, which I repetedly ripped out of my hand (this is my earliest memory of the events). I remember seeing the blood pouring out my hand and the saline squirting out the needle. Since I was being dificult to work with they gave me a diazepam to calm me down. Can't say I remember any diference.",
  "Apparently after the syringe was in I gave the doctor a huge lecture on the pharmacology of MDMA and telling him I was ok. On the contrary I had a resting pulse of 190 bpm (tachyarythmia), and the doctor repetedly was asking if I was having chest pain, convinced that if my pulse remained at that rate I would take a heart attack. Later on at about 3am I was becoming more consious of what I was doing. I remember walking out and asking the nurses if I could go home and they said 'no' because I still had a pulse of 190 bpm and had some sort of remote ECG connected up to me which they were closely monitoring.",
  "The next morning I was let home at 10am since my pulse had lowered to 100 bpm. Well it's been a couple of weeks since then and i've not taken ecstasy since. I must say I'm quite tempted to but I don't want to risk anything like this happening again, I was lucky not to damage my heart and I was very lucky I never got charged by the police."
 ],
 "erowid": {
  "id": "58575",
  "citation": " McTavish. \"Disaster: Way Too Much: experience with MDMA(Ecstasy) & Alcohol (ID 58575)\". Erowid.org. Apr 28, 2007. erowid.org/exp/58575",
  "substance": "MDMA(Ecstasy) & Alcohol",
  "views": "19318"
 }
}
