{
 "title": "Nightmares and Headaches",
 "author": "Salendo",
 "citation": " Salendo. \"Nightmares and Headaches: experience with Trazodone (ID 98464)\". Erowid.org. Dec 4, 2012. erowid.org/exp/98464",
 "substance": "Trazodone",
 "bodyweight": "135 lb",
 "report": "<p>I've been battling depression and anxiety for years, but this month was especially terrible. After losing my job, ending a serious relationship, and dropping all of my college classes, I was finding it nearly impossible to fall asleep.</p><p>The past few night Ive been up until 6am crying. Last night, not wanting to go through that again, I asked my neighbor if he had Xanax, or anything, to help me fall asleep. He told me he had some antidepressants that he was prescribed to help him sleep. I looked up the medication, Trazodone, and figured that would be perfect. He gave me about 8 100mg pills and advised me to take two of them. I went home and took the two 100mg pills right away with some water. I immediately crawled into bed, turned off all the lights, and put on a TV show. It was almost midnight.</p><p>After ten or fifteen minutes, my crying stopped. I felt my limbs getting heavier, and it felt like I was a stuffed animal. Fuzzy, motionless, heavy. I was very prepared to fall asleep. This was the only enjoyable part of my experience, and after this I lost track of how time was passing.</p><p>About twenty minutes in, I was starting to see things out of the corner of my eye. It looked like things were moving behind my curtains but when I turned to check, they disappeared. I tried to focus on the TV instead but found that the main character looked exactly like my recent ex. It was like watching him on the screen.</p><p>It was freaking me out so I turned off the TV and put on my favorite audiobook. At this point I closed my eyes and found that I was having insane visuals of what was happening in the story. Its unusual for me to picture scenes and characters so well in my minds eye, so I let it happen. At first, I was just watching the characters as if it were a movie, very realistic. But at one point the characters began to warp, from balloon-like cartoons, back to realistic, and then these dark, willowy figures. Id never envisioned this book as dark but suddenly it was terrifying. The characters would be talking to each other and then suddenly look directly at me. I knew I was only picturing them in my mind, but it felt like they were standing directly in front of me, turning to stare me in the eyes. I had to turn the audiobook off.</p><p>Now, I was sitting in my bed, in complete darkness and silence. I was suddenly aware of how fast my heart was beating and how incredibly thirsty I was. All I wanted was water. It seemed like it took me half an hour to pick myself up out of bed, and stumble down the stairs to my kitchen. I drank some water, didnt feel much better, and went back upstairs to my bed.</p><p>The darkness of my room seemed evil to me. If I kept my eyes open, I would see dark shadows darting across my walls. If I closed them, the visions would be worse: skulls flying in front of my face, an alien-monster-like creature walking towards me. Eventually I found that I was able to push these thoughts away until they were static in the corner of my field of vision. It was a mental battle between evil thoughts and seeing nothing at all.</p><p>By now it was probably 1:30 am, but it felt like much longer than an hour. I was suddenly aware of noises coming from the downstairs of my house. I was paralyzed with fear; I could actually hear peoples voices below me. I wanted to get up and check but my heart was racing and my limbs were too weak. I lay there panicking for a few minutes, convinced that my house was being robbed. After a while I managed to drag myself to the window, and realized that it was only my next-door neighbors (loudly) drinking in their backyard. Overwhelmed with relief, I was finally able to start drifting off into sleep.</p><p>The sleep was unsettling. I had a very vivid, intense dream but could not remember it upon waking. I think I woke up a few times during the night, dry sobbing and feeling sick.</p><p>This morning, I woke up just in time to make my doctors appointment (10:30 am). I felt groggy, weak, nauseous, and my head was furiously pounding. I figured these symptoms would go away once I was a little more awake. When I looked at myself in the mirror, I had purple bags under my eyes, and it looked like my face was melting. I found myself crying before I left my house, a combination of feeling sick and immediately thinking about my ex.</p><p>Driving was extremely difficult. I had to use two hands just to turn the key in the ignition. My vision was blurry and I had trouble staring at the same spot for more than a few seconds. Halfway through my drive I began to regret getting into my car. It was incredibly hard to focus and my headache got worse with each passing minute.</p><p>Its now almost 2pm and Im back in bed. My headache is worse than ever, I feel sick to my stomach, and I dont even recognize myself in the mirror. Its a beautiful day but Im stuck inside trying not to cry because it makes me feel even sicker.</p><p>This experience was definitely not worth it for me.  I regret taking two of the pills, and probably should have started with half of one. Im not very experienced with psychedelics (only had one DMT trip and it was pleasant) so the hallucinations were very scary and unexpected. I believe Trazodone may be very helpful for some, but I plan on flushing the other 6 pills.</p>",
 "year": "2012",
 "id": "98464",
 "gender": "Female",
 "age": "19",
 "timestamp": "2012-12-04T08:00:00.000Z",
 "views": "5661",
 "dose": [
  {
   "time": "0",
   "amount": "200 mg",
   "administration": "oral",
   "substance": "Pharms - Trazodone",
   "form": "(pill / tablet)"
  }
 ]
}
