{
 "title": "Euphoric Productive Motivation",
 "author": "Cameron",
 "citation": " Cameron. \"Euphoric Productive Motivation: experience with Lisdexamfetamine  (ID 98473)\". Erowid.org. Dec 5, 2012. erowid.org/exp/98473",
 "substance": "Lisdexamfetamine ",
 "bodyweight": "130 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "20 mg",
   "oral",
   "Lisdexamfetamine",
   "(pill / tablet)",
   " T+ 2:45",
   "20 mg",
   "oral",
   "Lisdexamfetamine",
   "(pill / tablet)"
  ]
 ],
 "report": "<p>It was final exam week at university, so I decided to visit my old friend Vyvanse again and picked up two 20mg pills. Vyvanse is not typically my recreational drug of choice (thus, my tolerance is low), but when things simply must be accomplished and my workload feels overwhelming, there's nothing like the sustained wave of focus, motivation and productivity provided by this drug. (The euphoria and off-the-charts confidence boost is nice, too).</p><p>I take no herbal supplements/other medication</p><p>8:15am- Woke up, took the first pill (20mg) on an empty stomach, washed it down with a bottle of water. I'm feeling groggy from just waking up, but my outlook is positive and my demeanor is pleasant as I began looking forward to the effects of the drug. I stash the second pill in my pocket, knowing I'll want a boost later on in the day.</p><p>8:45am- Beginning to feel first effects; vision is 'sharper', colors just a bit brighter. I am no longer groggy. I notice that I'm in a very good mood (seemingly for no reason). I started working on an assignment that's due in an hour, and I find the task both engaging and fulfilling. I wish I could write like this all the time.</p><p>9:45am- As I finish the paper I was writing, I realize that I'm fully feeling the effects of the Vyvanse. I'm not overly excitable or 'speeding' excessively, but I notice a definite pulsation of slightly euphoric energy. Vision is noticeably sharper, and I feel on top of the world, like it had been a really good day even though all I had done was wake up and do homework.</p><p>10:30am- I go to work for my shift at a local restaurant, where I realize we are short-staffed and quickly becoming quite busy. I handle the crowd with ease, smiling all the time while I was preparing the seemingly endless pile of orders. I'm on top of the world, and my energy seems boundless.</p><p>11:00am- I decide to take the second 20mg pill. Stomach is still empty at this point, but I have no appetite. I wash the pill down with another half-bottle of water. (Vyvanse tends to make my mouth dry and make me quite thirsty).</p><p>11:30am- I look up at the clock and notice that it has been 30 minutes since I took the last pill. Time is flying by. I also realize that I'm feeling the strongest euphoria, motivation and energy thus far; the second pill has kicked in.</p><p>1:30pm- I finish my shift at work and start walking to class. I notice that I'm smoking vastly more cigarettes than usual today; I smoke 3 or 4 on my walk across campus instead of my usual 1.</p><p>2:30pm- I am in class and begin to notice a very slight drop in the euphoria that had accompanied me all day. I'm still energetic, but perhaps a little less so than before. I'm drinking lots of water, still have no appetite, and am desperately craving a cigarette.</p><p>4:45pm- I'm in my last class of the day, and am beginning to notice a definitive decline in the drug's effects as they begin to wear off. Even though I've started to 'come down' from the effects that I desired, I'm also well aware that the drugs would continue to affect me for hours to come. I'm beginning to develop an appetite, and I'm still smoking lots of cigarettes. </p><p>6:00pm- I decide to cook some dinner, as my appetite has come back with a vengeance. My thoughts are still a bit 'racy', but my body is beginning to grow tired. Even though I want to sit down and relax, I find it difficult to stay seated for very long; the Vyvanse is still giving me the urge to fidget and move, even though I'm not so sure I want to anymore.</p><p>9:00pm- Resting is a easier now, especially if I keep my mind occupied. I'm watching TV intently, and feel the first tendrils of actual sleepiness come creeping in.</p><p>11:00pm- I'm definitely tired now, and take a very refreshing shower. My thoughts are no longer racing, and I'm feeling generally at peace. However, I'm a bit frustrated because although I feel the urge to sleep, my body just won't let me yet. I put on some music and start reading a book, hoping sleep will come soon.</p><p>12:30pm- I fall asleep after taking 3mg of melatonin sleep aid, and sleep soundly through the night.</p><p>Next morning: No noticeable 'hangover', everything is back to normal.</p><p>All in all, it was another pleasant day of happiness, talkative, productive energy, and motivation provided by Vyvanse.</p>",
 "year": "2012",
 "id": "98473",
 "gender": "Male",
 "age": "19",
 "timestamp": "2012-12-05T08:00:00.000Z",
 "views": "2680",
 "dose": [
  {
   "time": "DOSE: T+ 0:00",
   "amount": "20 mg",
   "administration": "oral",
   "substance": "Lisdexamfetamine",
   "form": "(pill / tablet)"
  }
 ]
}
