{
 "title": "Wildest Hallucinations Ever",
 "author": "Truth",
 "citation": " Truth. \"Wildest Hallucinations Ever: experience with 25I-NBOMe & 25C-NBOMe (ID 98633)\". Erowid.org. Feb 20, 2013. erowid.org/exp/98633",
 "substance": "25I-NBOMe & 25C-NBOMe",
 "bodyweight": "70 kg",
 "report": "<p>This won't be the best report, as I can't really remember much of what happened.</p><p>Although, I would have to say this has been one of the most visually fulfilling trips I've ever had. It was absolutely insane. I looked like a zombie. And felt like one too. A giggling one, that is.</p><p>It was Sunday morning and I had nothing planned for the day, so I decided to take some 25i and 25c. I had taken 800ug of 25i and 400ug of 25c on Friday afternoon (40 hours earlier), so, being a bit more tolerant than usual, I went ahead and double dosed (1600ug of 25i & 800ug of 25c) at about 9am. I also had about half a gram of cannabis, which I smoked throughout the day, up until 4:20. Like usual, I started feeling different around the half an hour mark and the visuals were starting around the hour mark.</p><p>There were many aspects to the visuals. As always, everything was bending, morphing, moving, crawling and brightly coloured swirling, geometric patterns completely engulfed my field of vision. Like a kaleidoscope, or multiple. However, they were much more intense than usual.</p><p>I could also see what seemed to be an animated, electrical circuit, suspended in space, running through things.</p><p>Http://I.istockimg.com/file_thumbview_approve/4938924/2/stock-illustration-4938924-circuit-board.jpg</p><p>It looked like this, only it moved (not it's shape, just it's 'current' .. Like electricity pulsating through). In one instance, this circuit was running through the computer, going in one side and out the other, forming boxes around programs, words, buttons, etc on the screen. In another instance, I was sitting down, patting my cat and I could see a circuit running through her that looked like her bone structure or nerves or veins or something (it was still bright green and moving like an animated, cartoon electricity circuit though).</p><p>As I pat my cat, she seemed to like it a lot more than usual. A bit too much. She absolutely loved it when I was touching the very top of her head. I could see what looked like an electric current flowing through the circuit in my body, through my fingers, into her circuit, in her head and throughout her body. I could actually see the current, and her reaction to it. I then notice, as she lies down, her paws are bend inwards at 90 degree angles (well, that's what it looked like to me anyway).</p><p>I thought to myself. Shit, I hope I didn't just sweat this chemical into my cat!!</p><p>(Not sure if that's possible though)</p><p>I didn't think she looked normal, so I stopped patting her. She rolled around a bit and then got up and stumbled away (flickering with electricity). I still don't know if my cat was really tripping or not, as I was way too intoxicated to tell and she came back in the afternoon for food, safe and sound.</p><p>I remember closing my eyes and seeing shapes, patterns and geometric objects.</p><p>Also I looked really closely at a piece of white paper and could see these patterns in great detail. The type of complexed imagery that my mind was creating was almost beyond belief. Vividly coloured structures formed with such mind boggling intricacy.</p><p>Ideas of all shaped and sizes pouring in and out of my mind. I have a completely different perception of time and space while on 25i, I must say I learn a lot from it.</p><p>I also had a heightened sense of sound, if I chose to listen. With music, I could heard every instrument of the beat and sound effect in the track. And outside, I could hear things that I usually wouldn't. Things all around me, near and far.. It just depends what I was focused on.</p><p>All in all, it was an absolutely amazing experience. Very digital.</p>",
 "year": "2012",
 "id": "98633",
 "gender": "Male",
 "timestamp": "2013-02-20T08:00:00.000Z",
 "views": "5788",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "1600 ug",
   "administration": "oral",
   "substance": "2C-I-NBOMe"
  },
  "1": {
   "time": "",
   "amount": "800 ug",
   "administration": "oral",
   "substance": "2C-C-NBOMe"
  },
  "2": {
   "time": "",
   "amount": " repeated",
   "administration": "smoked",
   "substance": "Cannabis"
  }
 }
}
