{
 "title": "A Lack of Discipline",
 "author": "Scientist",
 "citation": " Scientist. \"A Lack of Discipline: experience with Ethylphenidate (ID 98692)\". Erowid.org. Dec 31, 2012. erowid.org/exp/98692",
 "substance": "Ethylphenidate",
 "bodyweight": "170 lb",
 "header": [
  "DOSE:",
  " repeated",
  "insufflated",
  "Ethylphenidate",
  "(powder / crystals)"
 ],
 "report": "<p>A latecomer to the RC scene but with a period of 3 years of semi regular use of pills, speed and cocaine, in addition to periodic uses of mushrooms, ketamine and some herbals such as salvia and kratom. I wouldn't consider myself a lightweight, nor a hardened pro.</p><p>After looking over the contents of a well known UK RC website and researching the compunds available I decided to purchase some ethylphenidate. What I read indicated potent but short lasting effects, exactly what I wanted as the longer duration and after effects of some of the other compounds listed were not practical for me.</p><p>The 0.5 grams I ordered duly arrived on a Thursday. Due to work constraints I tried a small line, eyeballed. I estimate less than 0.05g but obviously I cannot be sure. The form was translucent crystals, some of which were quite large. I crushed them down to a fine powder, this required more pressure than would be required for a pill and made lots of satisfying crunching noises. The line was insufflated. Immediate reaction was a pain in the nose and tears to my eyes. I had been warned this was the case but still, worse even than snorting pills, something I never thought to be worth the pain.</p><p>The full effects were felt within 5 minutes, increase in heartrate and mild euphoria. Thoughts racing slightly but fairly lucid. I was impressed. I let the effects show themselves and after two hours they had subsided to the point where I felt confident I could have a top up without being unable to sleep. And I wanted to reclaim the very cheeky kick I had from such a small amount :)</p><p>I had a smaller line, again eyeballed. I was being cautious at this point, simply experimenting to determine the effects and duration before pushing on at the weekend when I wouldn't suffer from a lack of sleep. That was ironic given what happened the next day.</p><p>I didn't get to sleep easily but felt fine the next day. After work I decided to go for maximum effect and eyeballed a dose approximating 0.1g. The burn was intense, but so was the euphoria, Its not got the energy of coke but certainly the intense pleasure. Apparently the chemical is a dopamine and norepinephrine reuptake inhibitor with no effect on serotonin. This would explain the lovely feeling and elevated heartrate. The euphoria produced much chatting rubbish to people on skype, made difficult by my lack of of coherent thoughts.</p><p>As the intense feeling faded I felt rather hollow and very much wanted to reclaim the original rush. Herein is the 1st problem with ethylphenidate. The high is great, but it wears off quickly leaving me wanting a redose. As the evening progressed I repeatedly said to myself, one last little one, else I'll never get to sleep. This was a lie. By 3 am I had finished the bag, approx 400mg. The original high from sober was never reclaimed, indeed I felt hollow and spaced out indeed. Each redose lasted for less and less time.</p><p>Paranoia crept in and I found the use of headphones made me uneasy about being isolated from any noises going on. No that there were any, its was quiet. I began to limit the noise I was making so as not to miss anything. I knew this was the effect of the drug, but yet I couldn't suppress the urge to just sit, muscles tensed, and listen. Just listen. Didn't want music, films computer games or convo.</p><p>At this point I tried to get some sleep. Not going to happen. The high was fading but the body stim was in full swing. I was lying in bed with pulse around 100 and bp so high I could feel my heartbeat shaking me. This didn't help the paranoia. The high had lapsed and I just wanted to sleep. No. My extremities were cold and I was finding breathing laboured, rapid shallow breaths were all that I could muster. This was extremely unpleasant. And lasted till 2pm. 2pm! I kept thinking 'What if this doesn't get better? Why was I so stupid!' I could imagine the shame of having to go to A and E for sedation. I felt so tired and stressed, I just wanted it to end.</p><p>By the time my heartrate began to noticibly drop I knew it was over, and that fact alone let me fall asleep. I awoke at 6pm. Pulse and bp still elevated, I felt relieved but not fatigued. My nose was exuding some rose coloured crystals, mucus and blood no doubt. I washed my nose out with water repeatedly during the experience but that was not enough to prevent some damage. Sense of smell was affected and it took a week for signs of blood to subside.</p><p>Basically, when used in excess, this stuff is:</p><p>A) corrosive</p><p>B) Powerful</p><p>C) Short lasting, and very moreish</p><p>D) Very harsh on the cardiovascular system, and this effect builds and lasts for a long time</p><p>High stimulation and dopamine depletion is not fun.</p><p>I would recommend this substance, but with these important caveats. Go slow! Snorting was painful because it's causing damage in excess of coke or meph. Without a way to bring me down (which in itself may be harmful) the experience continued once the high had expired. Discipline is required! The next weekend I reordered with the intention of taking it much, much easier. The conclusions were supported. So hard to take it easy. The best way to avoid the extent of stimulation is to take a high dose initially and then leave it. But this also gives me a massive rush, and it doesn't last. Best of luck finding the sweet spot :)</p>",
 "year": "2012",
 "id": "98692",
 "gender": "Male",
 "age": "26",
 "timestamp": "2012-12-31T08:00:00.000Z",
 "views": "3760",
 "dose": {}
}
