{
 "id": 987,
 "title": "Smells Like Strange Lemons",
 "date": {
  "submission": "2004-08-24T07:00:00.000Z",
  "experience": "2002-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "the purple mage",
  "gender": "Male",
  "weight": 82
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "g",
    "grams": "2.5",
    "quantity": "2.5"
   },
   "administration": "oral",
   "substance": "Syrian Rue",
   "form": "extract"
  }
 ],
 "report": [
  "180 lbs male, 21 yrs",
  "--my bank account made me do it.--",
  "Being a ( poor ) student, I deposited a cheque in my bank account, which was of course frozen for 5 business days ( I hate banks ). So what do you do when you have no food and no money ? You don't eat, that's what. So after 24 hours of forced fasting, I decided to take advantage of the situation, and try maoi's - namely peganum harmala seeds, of which I made an extract:",
  "Thursday night",
  "------------------",
  "2.5g peganum harmala seeds were ground in a mortar, Mixed in 500 ml water, with lemon juice to ph 4-5. The mixture was brought to a boil, decanted, and the remaining water was boiled off. Recuperated 3.75g gooey brown resin, filling about 3 oo caps. The extra weight is due to water still present. I can't believe the consistency of this thing! I'm used with dealing with weird goo in the bottom of round bottomed flasks, but this one is quite disgusting indeed. I read the trip reports, but people seem to have forgotten to mention this texture... Smells like strange lemons... The extract does glow green/yellow under u.v. light.",
  "I was working in the lab the next day, doing inventory of a pharmacy research and synthesis lab. Since the inhibitory effect of p.h. seeds lasts 24 hours, and I was going to be in contact with god knows how many hundreds of chemicals, I thought it wise to wait until the next night to eat the capsules. The human body didn't create these mono amine oxydase enzymes for nothing, and I was probably going to need them in the next 24 hours... When in doubt, don't. ",
  "Friday night",
  "----------------",
  "Oh, man, was I right to wait !!! What did I inventory today ? Atropine, l-tryptophan, d-tryptophan, a few benzodiazepines, papaverine, and what was that folded bag in the dessicator? Tyramine, and 5-oh tyramine (dopamine, apparently). These guys in pharmacology research sure know how to fill their shelves... Plus a few hundred pharms more that I didn't know... So the lesson is, when in doubt, don't. I'll wait a few days to try the extract.",
  "Sunday 15:40",
  "------------------",
  "Well, the canada/usa gold medal hockey game is on ( it's 2-1 canada :-), I'm still not eating much, so I decided to try it. The 7 ( far from full, the stuff being so thick and gooey ) capsules were swallowed with lots of water, the only taste being weird lemons.",
  "16:10 ( t+30m )---it's now 3-2 canada, and the only effects of the extract are cold feet and hands, and a few fuzzy lemon burps. So far, so good.",
  "16:45 ( t+ 65m )---beginning to feel light headed",
  "17:15 ( t+ 1h 35m )---peak---movement seems distorted, walking isn't straight, and I experience some closed-eye visuals of turquoise rotating patterns, which seem to disappear after a few seconds, and I can see them faintly with my eyes open. Canada won 5-2 ( man, can we play hockey ! ), and it seems this is the perfect dosage for me. Not too strong, a bit of nausea, but tolerable. Still cold.",
  "17:25 ( t+ 1h 45 m )---nausea forced me to try to vomit, which is the best cure for that ill, but I wasn't able to. The effort itself seems to have done the job. My bare feet are sweating, my hands cold. Weird. Nausea seems less when lying down. Mental processes are untouched, even enhanced a bit, but wander from thought to thought without stopping for long.",
  "20:00 ( t+4h20m )---I'm watching monty python and the holy grail, which is even more hilarious than usual, and the effects have lessened to the point of being nearly over. Movement is still accompanied by vertigo and nausea, but lying down and watching the movie takes care of that. Definately a lazy day drug. I didn't expect the effects to be so pronounced, from the trip reports I'd read, and I had planned on ingesting 0.300 g ( that's not a dose, that's where I've gotten -without effect- in my experiments with yopo ) of groung anadenanthera peregrina seeds, and try to see if bufotenin was indeed psychoactive after all, but I'll wait for another day, and enjoy the remainder of this one while it lasts. Ni !",
  "20:45 ( t+5h05m )---tried to eat some spaghetti ( no sauce ), but nausea came back, and I had to stop. Plan to have some bud to smoke when using this extract, you won't regret it.",
  "22:00 ( t+6h20m )---back to baseline.",
  "All in all an interesting day. While passing in the corridor, every time I passed a couple of doors on either side, there were pale blue lines that appeared to follow me on the doors, which were dark blue. Strange visuals, no auditories, thoughts racing. I plan to do more research with this one.",
  "The purple mage",
  "-mind chemist-"
 ],
 "erowid": {
  "id": "12864",
  "citation": " the purple mage. \"Smells Like Strange Lemons: experience with Syrian Rue (seed extract) (ID 12864)\". Erowid.org. Aug 24, 2004. erowid.org/exp/12864",
  "substance": "Syrian Rue (seed extract)",
  "views": "9609"
 }
}
