{
 "id": 9870,
 "title": "The Fear  [Summary]",
 "date": {
  "submission": "2002-02-05T08:00:00.000Z",
  "experience": "1999"
 },
 "author": {
  "name": "Anonymous",
  "weight": ""
 },
 "dose": [
  {
   "time": "0",
   "administration": "oral",
   "substance": "DXM"
  }
 ],
 "report": [
  "It would take about ten pages to describe all (or each one) of the individual experiences I've had with DXM and all that I saw. So I'll just generalize what I felt and learned.",
  "When I get to certain level on DXM, third or fourth plateau (I still don't think I've reached the fourth but I've come close), everything that I see and feel is a reflection of my deepest thoughts and fears. Some people see beauty, some people see god, some travel to space and other worlds or dimensions, some (me for one) see death. Everytime I do DXM, the thought that consumes me is the thought that I'm going to die or that I've already died. One time I drove to a cemetary and lay on top of a grave for like two hours because I thought I was dead. Just imagine that. The fear is more than I could mentally handle. After that night I went into a deep depression and became extremely suicidal.",
  "The scariest part of DXM is that whatever happens to me, whatever I see, is who I really am. The deepest, darkest recesses of our inner souls am brought to the surface right in front of our very own eyes. I can see all the thoughts that I try to hide, all the faults that I have are blindingly clear. A friend of mine and I had two similar experiences in that we both saw death. We've discussed how scary it is that that is what we really am. Death is what's inside us. This drug opens my mind and rips it away from my body so that the two are no longer a part of one another. I felt every emotion that I'd ever repressed. All sadness, anger, remorse, everything that I'd hidden deep inside myself so that I wouldn't have to deal with it I felt time two hundred thousand while on the drug. I was on an emotional rollercoaster. I would be screaming and crying for something that happened to me years ago, then I would yell at everyone around me and tell them I hated them. I've also felt extreme paranoia and anxiety.",
  "I have social anxiety disorder anyways and this increased it as well. I would wring my hands until they were raw. I paced back and forth for over an hour, waiting for nothing. I had so many thoughts and visions racing through my head that I couldn't contain it. I felt like my mind was simply going to explode from a sensory overload. My pupils were so wide that I couldn't even see the whites of my eyes. I would shake uncontrollably and the worst part which I've actually only heard very few people say they've felt this, was the coldness. Sometimes it could have been the middle of a hot summer day and I would feel this cold creeping over me. This uncontrollable chill that ran deep inside of me and scared me like I've never been scared in my entire life. I knew that it was the hand of death coming for me. There are so many things that can go wrong with DXM, but there are also many mind blowing experiences that I can have as well. Just be careful, and realize that you may not be mentally and/or emotionally stable enough to go as far as other people do. There are places I haven't been because I know that I'm still not ready to go there. I've seen what can happen when a person is not prepared for the experiences possible on this drug. Depression, suicide, anxiety attacks, and just overall fear."
 ],
 "erowid": {
  "id": "5867",
  "citation": " Anonymous. \"The Fear  [Summary]: experience with DXM (with CPM) (ID 5867)\". Erowid.org. Feb 5, 2002. erowid.org/exp/5867",
  "substance": "DXM (with CPM)",
  "views": "19933"
 }
}
