{
 "title": "Empathy and Love Like No Other",
 "author": "Space Cadet",
 "citation": " Space Cadet. \"Empathy and Love Like No Other: experience with MDMA (Ecstasy) (ID 9874)\". Erowid.org. Aug 4, 2004. erowid.org/exp/9874",
 "substance": "MDMA (Ecstasy)",
 "bodyweight": "112 lb",
 "report": "<p>I was never so excited before in my entire life. It was my second experience with E and I heard that the second time was the best. I had it all planned out, me and about six other friends left for a rave that started at 10:00 that night. We took our 'beans' at about 11:00. As we walked into the rave we saw lights, heard music, and felt kind of unsure of what was to become of us. At about 11:45 I began to roll... VERY HARD.. I just looked at my friend Lindsey and said, 'Oh my God, how is it possible to feel this way?' Then I pulled her out onto the dance floor. I never felt so incredible in my ENTIRE life. I felt like there was a blanket of warmth and love rapped around me, I felt unbelievable. The lights were so incredible, and the music was orgasmic. I had found my heaven, and I felt as if I was being changed. I danced and danced and danced. It never felt so right to move my body. I was one with the music. Nothing else mattered.. Everything disappeared.. I was part of the music, I was the pulsating bass and I was floating through the sound waves.</p><p>After snapping back into reality, Lindsey offered me some water. Naturally I excepted. It was important to remember to stay hydrated. Then, another friend came up to me and offered me a cigarette. Not being a smoker I said hell no, but took a drag anyways. AHHHHHHHHHHHHHH OHHHHH SHIITTTT what a head rush... WOOOOSHHHHH I fell thru the floor and couldn't get up... It was such an incredible feeling, and at this point I reached my peak. I just lay there on the dance floor screaming, 'OOHHH MY GODDD!!' I must have sounded like I was in pain, but in fact I was in the most subliminal happiness I ever experienced. After peeling myself from the floor, I went over to the speaker where a candy flipper offered to put me thru it. I agreed. Putting my back against it with my arms outstretched, he told my to no matter what not put my arms down. I agreed once again. I closed my eyes, I took a deep breath. He pushed up my arms while I inhaled slowly, then, he drug his arms down them fast while I exhaled. BOOM I was gone. Out of my mind, out of my body. I saw myself in the speaker, it was the highlight of my night.</p><p>About twenty minutes later I went to eat the rest of my rolls. I experienced so much more thru out the night. I expressed to my friends how I never felt so close to them, and how I felt like I understood everything that was going on in the world. Nothing was harmful, nothing was ugly. Everything was so real and so beautiful. Everything had a purpose and we all belonged. I was spiritually liberated and my soul was set free.</p><p>I have never been the same since this experience and have rolled many times since. I love raves, I love being with people who are rolling, and I think everyone should try it at least one time in their life. Be careful, be smart. Ecstasy is beautiful.</p>",
 "year": "2001",
 "id": "9874",
 "gender": "Female",
 "timestamp": "2004-08-04T07:00:00.000Z",
 "views": "7605",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "2.5 tablets",
   "administration": "oral",
   "substance": "MDMA",
   "form": "(pill / tablet)"
  }
 }
}
