{
 "title": "Possible Memory issues",
 "author": "Fluorite",
 "citation": " Fluorite. \"Possible Memory issues: experience with 25I-NBOMe  (ID 98746)\". Erowid.org. Feb 20, 2013. erowid.org/exp/98746",
 "substance": "25I-NBOMe ",
 "bodyweight": "",
 "report": "<p>I am the author of 'One Bad Trip from an Experienced User' about 2C-I-NBOME or 25-I.  In this record, I mention that I had been using 25-i heavily and recreationally for several months.  I would like to call attention to an issue that I believe can be contributed to my usage of 25-i that deserves more research and consideration before using this substance.</p><p>Now during my heavy use of this substance and for a few months after, I found that I was having more and more difficulty with memory.  Not in the usual sense of memory where you forget something from childhood or what you ate last week.  I would find myself forgetting my sentences in mid-sentence. </p><p>I can recall one particularly notable instance where I experienced memory shortcomings. I was having this strange neck spasms and seizes on occasion.  I was getting a little concerned by it and went to go mention it to my fiance when I realized I had no clue what I was concerned about.  It was only a month later that I could recall that information.  I had no idea what part my body was hurting, only that something was and I was concerned for it. </p><p>I was having a hard time holding thoughts in my head, remembering things people told me, etc.  I admit I am an alcohol and cannabis user put prior to my experience with 25I, I never had memory issues, let alone with the use of cannabis nor alcohol.  In fact, I was often known among family and friends for my exceptional ability to remember.</p><p>Now, I believed this all to be anecdotal until I met an individual at a festival a few months later.   For identity protection, I will give him the false name Mark.  Mark and his colleagues had apparently also been heavy users of 25-I-NBOME.  I asked what made them discontinue their use of the drug, after explaining what happened to me.  Mark responded that the tolerance for the drug grows rapidly but also that his friend could not keep a thought for two years after his extreme usage of the drug.  I asked him to explain what he meant by not being able to keep a thought.  As it turns out, his friend was experiencing very similar memory loss issues as I was.  He has been able to slowly regain that ability, as have I, but that it is a slow process.  The memory loss is extremely debilitating at times and frustrating, similar to what I imagine Alzheimer's feels like.</p><p>I believe users of this chemical should be VERY cautious and understand the possible consequences of using Research Chemicals with no study to short term or long term effects.  I understand that my testimony here is only anecdotal data based on personal experience, but when considering Research Chemicals, I believe ANY and all information and experience should be made available to past, present and future users of the chemical.</p>",
 "year": "2012",
 "id": "98746",
 "age": "23",
 "timestamp": "2013-02-20T08:00:00.000Z",
 "views": "11726",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": " ",
   "administration": "",
   "substance": "2C-I-NBOMe"
  }
 }
}
