{
 "title": "Major Laser Bunning",
 "author": "Gonzo-Media",
 "citation": " Gonzo-Media. \"Major Laser Bunning: experience with MDMA, MDA, 25B-NBOMe, Piracetam, Fluoxetine & Salvia divinorum (ID 98783)\". Erowid.org. Apr 9, 2013. erowid.org/exp/98783",
 "substance": "MDMA, MDA, 25B-NBOMe, Piracetam, Fluoxetine & Salvia divinorum",
 "bodyweight": "70 kg",
 "report": "<p>Without going into too much detail, I take a lot of drugs. I tend to focus my interest on tryptamine and phenethylamine hallucinogenic derivatives and have been fielding an interest in this area of consciousness experimentation for a while.</p><p>While doing this I also attempt to fine tune the pharmacology of each drug if I am to include possibly neurotoxic methylenedioxy-substituted amphetamines. I put this into practice by initiating a piracetam attack dosage regimen a day prior to the main dosage experience. This on the one hand potentiates the amphetamine effect of the drug, extends the peak rush attained by 2-3 hours but also renders my thoughts more clear with higher clarity, more edginess, compared to the usual somewhat deep stoning effect of MDxx's probably due to a high rate of 5HT2c receptor activation. The comedown is also vastly lessened (with the addition of lipid-soluble vitamins and fluoxetine), and the dosage-response curve to the ecstasy is much more consistent tending to follow a Fast come-up - straight into the main rush/peak affect that then lasts solidly for 3-4 hours, and then a gradual lessening of the hazy peripheral serotonin activation but a persistence of the core amphetamine/dopamine 'push'.</p><p>One last, there is never that 'aw the rush is over' disappointed feeling that accompanies a typical MD comedown, this is due to I think a rapid lessening of dopamine levels during the comedown which probably underlies the main euphoric/hedonistic effects of the drug, which when I add piracetam, persists. A more recent and novel addition to this regimen has been the addition of Salvia divinorum enhanced extract.</p><p>My discovery of this herb's putative rejuvenating effect on post-MD states occurred mostly by accident. One comedown long ago after 500 mg of potent MDMA + piracetam I was feeling quite lost and spaced. It so happened that I had acquired some salvia 50x prior to this and intended on smoking it on the comedown. Most consider salvia to be a dysphoric hallucinogen, me included. However after the initial effects wore off and the stoning effect of the salvia faded, I noticed that I had markedly increased focus, and felt a lot more 'centred', prior to this having felt a bit 'lost', Ha.</p><p>Basically, salvia is a dysphoric drug, but its potent kappa-opioid receptor activation presents a novel mechanism for Up-regulating dopamine receptors, which after an intense MD experience, are likely vastly desensitised. This has been exposed in a number of addiction-studies involving rats whereby introduction of salvinorin A interrupted the chronic dosage/ self-administration regimen of cocaine addicted rats, which hints at an endogenous addiction control mechanism via downstream effects of Kappa-opioid on Dopamine receptors, possible up-regulating them after desensitisation.</p><p>I divulge:</p><p>The Night happened to occur on a New years eve, 2012-2013. I was attending a squat rave with two of my friends, J.B and J.D. We learned that a popular rave we was going to had been shutdown on the way up there, so we happened upon some other ravers and followed them to the next best squat event.</p><p>The illegal nature of these raves presented a prime opportunity to test a potent mind bending cocktail of euphoric MDxx's and the potent hallucinogenic phenethylamine derivative 2C-BNbome, alongside my usual practice of Psilocybe consumption. I had tested a cocktail of psilocybin and 2C-BNbome 2 months prior to this and found it to be very mind-expanding, mixing the 'aeronautic' chemical effect of the 25B with the hazy dreamy effect of the psilocybe, which produced a 'flowery' jungle vibe which began to creep toward ego loss toward the end of the experience.</p><p>I initiated my usual piracetam attack dosage a day prior and noticed the usual 'clear' piracetam response the next day. Also included was Omega 3 DHA & EPA and fat soluble vitamins-ALA, Vitamin E and Coenzyme Q10. We arrived at the rave and it was already past the midnight countdown, but that was fine. It was quite a violent struggle to get into the rave amidst a set of MDMA intoxicated youths, some younger than us that were determined to get into the rave no matter the cost. Upon entering the large warehouse I noticed not a lot of sitting down that accompanied a typical squat rave, with most people raving together in a large misty hall, with 3 rigs, many lasers and light effects, MC's, and somehow not much sound convergence between the rigs despite it being one large hall. They were playing mainly drum and bass/dubstep/jungle and had multiple upstairs rooms as well.</p><p>2:15 AM: Upon entering I acquired a bottle of water and proceeded to consume my 190 mg of MDA + 250 mg of MDMA dosage. Soon I was feeling an intense euphoric rush familiar of MDMA, and then the more amphetamine stimulative push of the MDA introduced itself and shook hands with the MDMA and synergised to produce the most potent Methylenedioxy effect I have yet experienced. My mind was appeased on all fronts. There was the trippyness of the MDA along with the amphetamine euphoria/push, alongside the strong serotonin rushy-calming euphoria of the MDMA. It was intense.</p><p>This proceeded promptly into a peak that lasted 3-4 hours +. Soon after the MDxx cocktail had pushed up to a highly intense level, I gathered in the upper rooms with my mates to skank and crack open the Atlantis truffles. At some point before this I popped 2 blotters of 25B in-between my upper lip and gum, and forgot about it. I also intended to take 2C-CNbome that night as well for the maximum visionary effect of the chlorine substituent on the N-benzyl-2,5-dimethoxy-phenethylamine skeleton. I failed to do this but was quite glad afterwards that I didn't.</p><p>In the strong amphetamine-MDMA haze of the rave I popped on my tall Dr. seuss Cat-in-the-Hat hat and whipped on my purple Mardie-gras spiral goggles. I was ready for some jungle fever. At some point while raving beneath a spinning laser light I began to notice a mushroom-like haze creeping over my consciousness. I immediately noticed dreamy visual effects in the anterior part of my mind. I began receiving little snippets of information from the mushroom god, and each insight and gift of knowledge span into multiple colours intensified and dominated by the MDMA/MDA synergy. Not wanting to go too lightly, I decided that a couple of Double-filled nitrous oxide balloons would do the trick.</p><p>I just had to get away from the shenanigans upstairs, the groove was flowing and I couldn't keep away from the dance floor. I swiftly gathered my drive and signalled my friends to come down stairs for some inhalants.</p><p>Cccchhhh goes the sweet gas into the dispenser, And soon im toking.</p><p>My Mind was blown away into a colourful euphoric hyperspace bubble, the entire room being engulfed in a wave of shifting rainbow patterns. Soon after this I noticed the 25B rearing its head, with spacial scientific reality shifting/warping effects. Lasers soon began to predominate through my mind, and I scouted through the rave, in a haze of trippy euphoria, grooving as I went. I lost my friends many times but spontaneously ran in to them again, with much loud jeering. I proceeded to the mast head of the skank-trip battle ship and danced amidst the lasers. I ran into many girls during who seemed intrigued by my hat and goggles attire and I responded with a laser skank serenade amidst the laser lights.</p><p>At some point there was planned some DMT consumption, but we never got round to this. My friend J.D had ingested as far as I'm aware upwards of 250 mg of 80% pure reagent tested MDMA, having abstained prior to this for 5 months+, he was similarly buzzing. J.B, my other mate had also consumed 250 mg of mdma via capsule, and at some point afterwards proceeded to sniff some MDA. We encountered many people of similar age who were also tripping and chilled. At some point while on the top level of the warehouse I prepared to smoke up some salvia with another mate, and a 60x salvia zoot was skinned. I'm not sure if anyone else attained the usual salvia experience, but for me it seemed barely existent, however having consumed via bong after we got back to a friends house, I attained the usual salvia visionary 'geometric' structural shifting, re-arranging effect, accompanied by the salvia 'stone' which at first was actually strangely deeply euphoric and amusing, it seemed to bring me back down to earth and had a consciousness clearing/mind expanding effect which I haven't quite noticed before. Without going into it, it's a different way to trip compared to serotonergic psychedelics. It feels quite shamanic and has a deep trancing strobing/zoning effect.</p><p>I was intensely tranced during the duration of this trip, but the Fighter-jet fuel of the MDMA+Piracetam+MDA just kept on going. I'm not sure if I experienced any form of ego loss during the night, but the MDA+MDMA had me battle-skanking like a Warlord. At some point I remember approaching the speakers and being blown away by the vibrations.</p><p>At around 7:30 AM we left the rave, and promptly called a cab home, having been surfing the trip waves for 5+ hours. Immediately after we left I popped open my baggy of SSRIs and consumed 40 mg of fluoxetine. I noticed it brought me down quite quickly, and I had none of the feeling of lingering MDA/MDMA metabolites in my system. It may also be noted that fluoxetine antagonizes 5HT2c quite strongly as well, which leads to dis-inhibition of dopamine release in the prefrontal regions, so this may have cleared my head up abit. We got home, and I went on to smoke a small amount of 60x salvia out of a bong. This, as I previously noted, had a grounding, focusing effect which I feel may be due to the up-regulation of dopamine receptors in response to Kappa-opioid receptor activation, which promptly reversed the typical blunted affect that occurs the day following MDMA administration, let alone with MDA. We then barely rolled 2 zoots and collapsed fast asleep. Upon awakening in an uncomfortable position, I noticed that my heart rate was quite high, and this had persisted for some time. I was worried but not surprised considering the combination of 3 phenethylamine derivatives with multiple mechanisms of action. However I have noticed before that having taken Prozac by itself causes me to have a high heart rate and blood pressure, so anybody conducting a neuroprotection strategy may take note that generally a lower dosage of SSRIs is appropriate.</p><p>Following further salvia smoking and both lipid and water soluble vitamins, and 800 mg of Piracetam to clear my head, I noticed a return of a clean post-tryptamine euphoria that was probably the best ive ever felt on a comedown, as well as experiencing long lasting enjoyable visual effects that involved humorous colourful animations of sequences behind the eyes. Im feeling quite normal considering the combination, and have an overlying sense of mind-expansion and satisfaction that I would recommend to anyone versed in psychedelic adventures.</p><p>We are the Consciousness engineers, Viva la Revolution!</p>",
 "year": "2013",
 "id": "98783",
 "gender": "Male",
 "age": "19",
 "timestamp": "2013-04-09T07:00:00.000Z",
 "views": "2436",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": " ",
   "administration": "",
   "substance": "Various"
  },
  "1": {
   "time": "",
   "amount": "",
   "administration": " ",
   "substance": ""
  },
  "2": {
   "time": "Piracetam",
   "amount": "",
   "administration": " T+ 0:00",
   "substance": "190 mg"
  },
  "3": {
   "time": "oral",
   "amount": "MDA",
   "administration": "",
   "substance": " T+ 0:00"
  },
  "4": {
   "time": "250 mg",
   "amount": "oral",
   "administration": "MDMA",
   "substance": ""
  },
  "5": {
   "time": " T+ 0:00",
   "amount": "2 hits",
   "administration": "",
   "substance": "2C-B-NBOMe"
  },
  "6": {
   "time": "(blotter / tab)",
   "amount": " T+ 3:00",
   "administration": "15 g",
   "substance": ""
  },
  "7": {
   "time": "Mushrooms",
   "amount": "",
   "administration": " T+ 0:00",
   "substance": " "
  },
  "8": {
   "time": "",
   "amount": "Nitrous Oxide",
   "administration": "",
   "substance": " T+ 5:15"
  },
  "9": {
   "time": "40 mg",
   "amount": "oral",
   "administration": "Pharms - Fluoxetine",
   "substance": "(pill / tablet)"
  },
  "10": {
   "time": " T+ 0:00",
   "amount": " repeated",
   "administration": "smoked",
   "substance": "Salvia divinorum"
  }
 }
}
