{
 "title": "Nightmare to Shroomland",
 "author": "anonymous",
 "citation": " anonymous. \"Nightmare to Shroomland: experience with Mushrooms (ID 9878)\". Erowid.org. Aug 5, 2004. erowid.org/exp/9878",
 "substance": "Mushrooms",
 "bodyweight": "135 lb",
 "header": [
  [
   "DOSE:",
   "1.0 g",
   "oral",
   "Mushrooms",
   "(dried)"
  ]
 ],
 "report": "<p>I had been wanting to do shrooms again for some time, so my friends and I got some.  We took a lot more then we were supposed to (which sucks cause they were pretty expensive-2grams/$20.)  We each took about 2 grams.  Anyways, the beginning of my trip was pretty fun.  I was fucked up big time.  Later on in the night I was talking to some people that knew I was on shrooms and they were fucking with me pretty badly.  On shrooms, I couldn't tell what was real or not.  If I went to my room or down the hall, I didn't remember what I had just done.  I knew I had done something from the memory that I had, but I couldn't tell if the memory was real or not.  I also felt insane.  I felt like I would never come off that trip.  I had to tell my sober friend to tell me that how I was feeling was normal.  I was so scared about what I had just done.  I couldn't figure out why anyone would ever want to trip like I did.  All of my angles and dimensions were messed up. </p><p>I was lying in my bed and I couldn't get the blanket straight on top of me.  90 degree angles were all acute.  I would try to speak to my sober friends and I would just forget what I was talking about.  I couldn't find the words to describe how I felt.  I kept thinking to myself that everything was soooooooo surreal.  Towards the end of my trip I started to enjoy it because I was feeling a lot more sober.  I was feeling happy cause I actually was feeling normal.  When you do mushrooms control your environment.  Make sure you have an idea what tripping is going to be like and that if you get scared about the trip remeber it will be over soon enough.  Enjoy the visual and auditory perceptions and have fun.  If the first trip isn't fun, then maybe the next one will be.</p>",
 "year": "2001",
 "id": "9878",
 "gender": "Female",
 "age": "Not Given",
 "timestamp": "2004-08-05T07:00:00.000Z",
 "views": "5152",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "1.0 g",
   "administration": "oral",
   "substance": "Mushrooms",
   "form": "(dried)"
  }
 ]
}
