{
 "title": "Intense Visuals",
 "author": "Fuzz",
 "citation": " Fuzz. \"Intense Visuals: experience with 2CB & Mefloquine (ID 98806)\". Erowid.org. Apr 10, 2013. erowid.org/exp/98806",
 "substance": "2CB & Mefloquine",
 "bodyweight": "130 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   " ",
   "",
   "Pharms - Mefloquine",
   "(daily)",
   " T+ 0:00",
   "13.5 mg",
   "oral",
   "2C-B",
   "(capsule)",
   " T+ 1:05",
   "13.5 mg",
   "oral",
   "2C-B",
   "(capsule)"
  ]
 ],
 "report": "<p>I'm about to travel to a malaria heavy region, so I've been taking Mefloquine. Given its reputation of inducing psychosis and suicidal thoughts, I was a bit hesitant to mix with psychedelics.</p><p>I had not had any problems with the Mefloquine, although my dreams have been very visually vivid and more memorable than usual. Given this relatively mild reaction, I decided to give 2C-B a try. I had tried 2C-B once before, but I'm not sure what the dose was. I believe it was quite a bit smaller than this time around.</p><p>It was the last night of a small 3 day outdoor trance festival. I was surrounded by familiar and friendly faces, good music, lots of pretty lights, and colorful costumes. I had had a couple of drinks and joints over the course of the day, but I was relatively sober.</p><p>I took the 2C-B in two capsules, equal doses, totalling roughly 27mg, separated by just over an hour. I began coming up about the same time I took the second capsule. There were three of us that were tripping 'together,' but we were all at different places: one was mixing MDMA with 2C-B, I was just doing 2C-B, and the third was taking the same dose of 2C-B but about an hour behind my schedule.</p><p>The overwhelming feature of this trip was the strength of my visuals, particularly when my eyes were closed. I felt mostly lucid intellectually, but I found myself not wanting to do anything aside from lie on my back and stare at the beautiful images on the insides of my eyelids. Tried to dance for a while, but quickly gave up. People tried to converse with me, but I was not particularly interested. The lasers, stars, clouds, and moon were much more compelling to me than conversation. As I stared at the sky there were multiple points where I had no idea whether I was looking at clouds or just inventing the clouds myself. When I looked at the grass I saw an elaborate Persian rug.</p><p>This tendency toward staying still and just looking at things is typical for me when it comes to psychedelics. As I came down I wandered around with my tripmates, until the urge to dance took precedence over my urge to look. I danced for a few hours until my legs were jelly, then laid down near the dance floor for another hour or so before going to bed.</p><p>By the time I went to bed I thought I was back to sobriety, but my Closed Eye Visuals continued as I fell asleep.</p><p>I would definitely repeat this experience, but I would recommend caution if you're not accustomed to strong visuals.</p><p>Also, I would have done well to remember that Smart Trippers Shit First.</p>",
 "year": "2012",
 "id": "98806",
 "gender": "Male",
 "age": "23",
 "timestamp": "2013-04-10T07:00:00.000Z",
 "views": "825"
}
