{
 "id": 9881,
 "title": "Altered Perceptions & a Little Embarrassment",
 "date": {
  "submission": "2002-01-18T08:00:00.000Z",
  "experience": "2001"
 },
 "author": {
  "name": "TH",
  "gender": "Male",
  "weight": "140 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "20 mg",
   "administration": "oral",
   "substance": "Pharms - Zolpidem"
  }
 ],
 "report": [
  "I took 20mg STILNOX (Ambien) immediately before a small, high-protein meal (if I weren't hypoglycemic, it would have been on an empty stomach).  I then wandered to a bar that was having a drum 'n' bass night, where I stood around the dance floor for two hours, admiring the lights and people.",
  "I had some minor hallucinations, mostly related to depth and spatial perceptions.  For example, there was a strange protusion from the floor, like a stalagmite, reaching from my feet up to my chin.  It didn't look QUITE real, and I couldn't grasp it, so I bent down to the floor and saw that it was simply a flat discolored spot.  The lighting and shading must have been just right to make it appear three-dimensional.",
  "Shortly after that, the entire floor seemed to be irregular, even wavelike and shifting.  This made it very difficult to walk, especially when combined with the feeling of heavy limbs.",
  "I've noticed in the past that Ambien makes me prone to seeing things out of the corner of my eye; any time I glimpse an unexpected movement or shape, I think it's a person or animal.  This time, I kept thinking that the lights reflected off a large disco ball in the center of the room were little animals, like rabbits.  Eventually I got used to this, and accepted that there were little animals running around in circles all over the place.  Actually, that's not entirely accurate... it's more like I became comfortable knowing that I was being tricked to believe there were little animals running around the room.",
  "The lights from that ball were also the cause of last night's most interesting alteration of perception.  As I stood by the back wall of the room, and the lights spun around and around, I would occasionally understand my physical position in the world to be based on the lights, not the room around me.  What I mean is that the lights would stop moving, and the room would spin instead!  Well, it wasn't perfectly spinning, it was just sort of moving around... I'm not sure what the method was, but I think the inconsistency is based upon my own unmoving position (for if the room were spinning around the lights, I would have to be spinning, too)  Regardless, I genuinely thought that the building was moving, and if the music hadn't been so loud I would have asked someone what was going on (now I'm glad I didn't get that chance to embarrass myself).",
  "One odd thing is that this was not at all discomforting, even though I am usually very susceptible to spinning-induced nausea.  Anyhow, the way I could stop this room spinning is by looking at a (non-moving) light on the floor by my feet, then looking next to it at the grain of the wood floor in relation to my feet, and realizing that the motion of the light is actually the variable.",
  "There were some other effects, but these are the most interesting, and perhaps you have enjoyed reading about them.",
  "Oh yeah, the other night I went back to that bar, where I met a fellow who I had spoken to while I was on Ambien.  He asked if I wanted to buy a CD from him, and I remember writing saying something like, 'not now, but I'll give you my e-mail address so I can get one later.'  I wrote it down on a post-it note and handed it to him... only, apparently, I wrote out my entire mailing address, phone number, and two e-mail addresses!  He said he was a little weirded out at that... Woops!"
 ],
 "erowid": {
  "id": "5871",
  "citation": " TH. \"Altered Perceptions & a Little Embarrassment: experience with Zolpidem (Ambien) (ID 5871)\". Erowid.org. Jan 18, 2002. erowid.org/exp/5871",
  "substance": "Zolpidem (Ambien)",
  "views": "18542"
 }
}
