{
 "id": 9883,
 "title": "Just Another Medicine",
 "date": {
  "submission": "2007-01-12T08:00:00.000Z",
  "experience": "2006-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Anon",
  "gender": "Male",
  "weight": 82
 },
 "dose": [
  {
   "time": "0",
   "amount": "400 mg",
   "administration": "oral",
   "substance": "Pharms - Promethazine",
   "form": "(daily)"
  }
 ],
 "report": [
  "I've used benzo's very long, and im very tolerant and addicted to them. I wanted to try stopping, but suffered extreme withdrawal syptoms and didnt sleep a couple of days when I tried not taking them, I immedietly went back on them, and my doctor gave me phenergan, or promethazine which is supposedly less addictive and will help me stop on the benzos. I started taking 2 25 mg, didnt work, so I took more, started by 100mg to try sleep, which worked.",
  "After a month of taking this, I was taking 16+ or 400mg+ a day, it doesnt even give me a buzz, or a euphoric feeling, it just helps me sleep. I tried misusing it loads, taking 30, for some reason it just doesnt work for me. I give some to my friends often, they get completely off it, especially if they try to take my dose. It gives them all a buzz and euphoria especially when blazing, but I must say compared to benzo's this medication may be less addicting, and help most people, but for me it only caused problems because I needed way too much.",
  "For people looking to use it recreationally, alcahol is a necessity, blazing is great with it, it's great for softening crashes or come downs, and for people not used to sedatives or hypnotics it gives extreme visual impairment, hallucinations. Users no matter how tolerant will have blurred vision at least.",
  "I still take phenergan, but only with benzos now.. just another medicine I'm now required to take to sleep -.-"
 ],
 "erowid": {
  "id": "58712",
  "citation": " Anon. \"Just Another Medicine: experience with Promethazine (ID 58712)\". Erowid.org. Jan 12, 2007. erowid.org/exp/58712",
  "substance": "Promethazine",
  "views": "89063"
 }
}
