{
 "id": 9894,
 "title": "chagikhat",
 "date": {
  "submission": "2007-01-13T08:00:00.000Z",
  "experience": "2007-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "amphetacheese",
  "gender": "Male",
  "weight": 68
 },
 "dose": [
  {
   "time": "0",
   "amount": "400 mg",
   "administration": "oral",
   "substance": "Cathinone",
   "form": "powder/crystals"
  }
 ],
 "report": [
  "Special kiosk's in Tel Aviv sell capsules filled with white powder, called in hebrew chagikhat a mixture of the words chagigga (party) and khat the plant.  They contain white powder but different kiosk's vary some containing a more brown looking powder .  Yesterday I purchased 5 of these red and white pills and dumped all of the  white powder into a cup of coke.  It dissolved easily and I drank it all quickly alone in my room.  My plan was to use the drug to study since after all it is a stimulant.   Instead I became very euphoric feeling excited about my future and writing a three page email to my father.  The effects lasted nearly 10 hours and the euphoria changed to a general irritability and fatigue after about 7 hours.  I took the preparation around  6 pm and went to sleep at around 7 am.  My girlfriend came over at around 11 pm angry because she could tell I was high and i had told her to stop bothering me an hour or 2 previously.  I noticed that her face looked different than usual and that my visual perceptions were definitively altered.  Sometimes she would look as though she had smooth skin other times she looked plain awful all over the course of an hour. I also had the urge to smoke cigarettes constantly as expected with most stimulants.   Today I took 2 ritalin SR, the white tabs with ciba written on them.   I barely felt any effect from these pills perhaps due to yesterday nights festivities.  In fact I've been very tired since the cathinone wore off.  I plan to purchase more tomorrow and try to study with it using small dosages.  If anything, this drug induces a state of happiness and provides great energy and enthusiasm.  I'd really like to know if there are people   that have had success in using the drug to enhance academic performance. If it is indeed similar to amphetamine it should increase concentration, I'm sure that it won't help concentrate at the high dosage i took."
 ],
 "erowid": {
  "id": "58757",
  "citation": " amphetacheese. \"chagikhat: experience with cathinone (ID 58757)\". Erowid.org. Jan 13, 2007. erowid.org/exp/58757",
  "substance": "cathinone",
  "views": "19423"
 }
}
