{
 "id": 9895,
 "title": "Help on the Way",
 "date": {
  "submission": "2007-06-16T07:00:00.000Z",
  "experience": "2007"
 },
 "author": {
  "name": "Mad Chemist",
  "gender": "Male",
  "weight": 95
 },
 "dose": [
  {
   "time": "0",
   "amount": "6.0 mg",
   "administration": "oral",
   "substance": "Pharms - Alprazolam",
   "form": "(daily)"
  },
  {
   "time": "0",
   "amount": "4.0 mg",
   "administration": "sublingual",
   "substance": "Pharms - Buprenorphine",
   "form": "(pill / tablet)"
  },
  {
   "time": "0",
   "amount": "1.0 mg",
   "administration": "sublingual",
   "substance": "Naloxone",
   "form": "(pill / tablet)"
  }
 ],
 "report": [
  "I ingested one half (4mg) of an 8mg sublingual Suboxone tablet about 20 minutes after waking up in the morning (8:30).  I allowed the tablet to dissolve beneath my tongue as directed and refrained from swallowing any of the saliva produced, keeping all of the drug/oral fluid inside my mouth for about 3 minutes before finally swallowing the solution.",
  "It has been two days since my last 'fix', as I have been addicted to a rather large array of opioids for about two years.  I am certain the entire 8mg tablet would not be a problem for me.",
  "T+1:00:",
  "I have some slight effects coming on.  No cravings for my Oxycontins, morphine, hydromorphone, hyrdrocodone. I feel nice and warm, no usual morning headache or extreme anxiety",
  "I take 2mg of Xanax 3x/day for anxiety.",
  "Today has been the first morning I have not needed to take my Xanax upon waking.  My stomach is starting to cramp ever so slightly, but nothing I would associate with the suboxone.",
  "A hit or two of some heady herb and things would be fine.",
  "T+1:30:  ",
  "I feel very nice, eyelids are feeling a little heavy, ready to begin my day, going to drive(do not feel too intoxicated to drive) and pick up some odds and ends, get a prescription filled and come home and relax.  Without consuming the Suboxone I would most likely be in bed trying to sleep the day away while consuming xanax to ease my withdrawal symptoms   Will follow up in a few hrs.",
  "T+3:00:",
  "Very relaxed no dramatic increase in effects. Very Calm, unusual considering I have been taking 8-15mg of Xanax (in 2-5mg doses 3xdaily) and have not taken any today. Still do not feel like I am 'high', rather very level. I am a little hungry but am going to wait another hr or 2 before eating anything. I am pleased with the effects thus far, as I am seeking to discontinue my opiate use and currently have no cravings. Although, I suspect consuming 8-16mg would provide a noticeable rush/high, which may be desirable/addictive. More in a few hours.",
  "T+5:00:",
  "At 5hrs after sublingual consumption of 4mg suboxone, I feel I have achieved the peak effects of the drug.  I did not get high, nor sick (a valid concern for anyone who consumes suboxone with opiates already in their system).  However, I did not feel the urge to seek or consume the opiates which have been a part of my daily life for years. ",
  "I am ashamed to live in a country that would rather prescribe me oxycontin over a substance that could help break me from the bonds of the addiction controlling my life. Breaking this cycle is far beyond any one pill or counseling session, however I feel that with counseling, exercise, and professional medically administrated dosages of this drug I could break free from the choke hold of opiate addiction and return to the person I once was."
 ],
 "erowid": {
  "id": "58761",
  "citation": " Mad Chemist. \"Help on the Way: experience with Buprenorphine (ID 58761)\". Erowid.org. Jun 16, 2007. erowid.org/exp/58761",
  "substance": "Buprenorphine",
  "views": "6618"
 }
}
