{
 "id": 9897,
 "title": "Just Like MDMA, Then...",
 "date": {
  "submission": "2007-01-14T08:00:00.000Z",
  "experience": "2007-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Double Trouble",
  "gender": "Male",
  "weight": 77
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "mg",
    "quantity": "250",
    "grams": 0.25
   },
   "administration": "oral",
   "substance": "Methylone",
   "form": "powder/crystals"
  },
  {
   "time": "3:45",
   "amount": {
    "unit": "mg",
    "quantity": "100",
    "grams": 0.1
   },
   "administration": "insufflated",
   "substance": "Methylone",
   "form": "powder/crystals"
  },
  {
   "time": "4:30",
   "amount": {
    "unit": "cup",
    "quantity": "1"
   },
   "administration": "oral",
   "substance": "Kratom",
   "form": "tea"
  },
  {
   "time": "4:30",
   "amount": {
    "unit": "mg",
    "quantity": "2.0",
    "grams": 0.002
   },
   "administration": "oral",
   "substance": "Clonazepam",
   "form": "pill/tablet"
  },
  {
   "time": "6:15",
   "amount": {
    "unit": "cup",
    "quantity": "1"
   },
   "administration": "oral",
   "substance": "Kratom",
   "form": "tea"
  },
  {
   "time": "7:15",
   "amount": {
    "unit": "tablet",
    "quantity": "1"
   },
   "administration": "oral",
   "substance": "Zolpidem",
   "form": "pill/tablet"
  }
 ],
 "report": [
  "Medications: 1mg Klonopin daily, 10mg Ambien most nights",
  "Supplements: 5-HTP, L-Tyrosine, and vitamins daily",
  "Drug experience: Alcohol, nicotine, weed, MDMA, Ketamine, 2C-E, DXM, opiates, LSA, kratom, mushrooms, amanita muscaria, salvia, amphetamines, Ritalin, benzos, and others I cant recall at the moment",
  "--",
  "Today: ~250mg Methylone orally (first attempt with this chemical), ate a light meal several hours ago, positive mind set, well rested, just got back from going for a run (which I like to do to clear my mind for psychedelics)",
  "--",
  "T0:00 (7:09pm) - I received 1g of Methylone from a reliable chemical distributor several days ago and have been anxiously holding off sampling it until tonight.  My best drug experiences in the past have been with MDMA and Ketamine and I am very curious about this particular chemical because of its comparison to a relaxed ecstasy.  I havent taken any Tryptamines or Phenethylamines in about half a year so obviously I shouldnt have any tolerance.  I have only taken MDMA 5-10 times before so it has certainly not lost its magic yet for me.  I am nonetheless interested in exploring some of the various RCs out there.",
  "Okay, enough background information!  I am temporarily without a scale so I divided the gram of Methylone into four approximately equal 250mg doses and ingested one of them.  Took a couple of Tums to ward away any potential nausea.  Already feeling good from my run, its time to take a shower while I wait for the effects to kick in",
  "T+0:57  Ive been experiencing come up effects for about the last 15 minutes or so.  The initial feeling is incredibly similar to (if not completely indistinguishable from) that of MDMA.  My heart rate has noticeably increased and my pupils are huge.  Im in an excellent head space, but there are no perceptional distortions to report besides a slight tingly feeling and a chill in the air.  No nausea to speak of.  Cold, clammy hands.  Damn Im feeling good. Definitely a ++ on Shulgins scale.",
  "T+1:25  I can now see how Methylone and MDMA differ.  As others have previously described, there is no push from Methylone.  The euphoria is still here, but I do not feel any sense of urgency or overstimulation.  It truly is a relaxed stimulation although those two words may seem contradictory.  My mind is feeling very empathetic and introspective.  There is no single thing in my surroundings that is immediately begging for my attention, I feel very much in control.  As for perceptual changes, colors seem especially vibrant and music is enhanced.  The only negative right now is that I am having difficulty staying at a comfortable temperature, as my extremities are quite cold even though I am bundled up in warm clothes and a blanket.  Overall, still ++ and I sense this might get more intense yet, I do not feel like I have peaked.",
  "T+3:20  Some of the euphoria is fading away now but I am still enjoying this very interesting and contemplative state.  Self-reflection, writing, and listening to music have allowed me to explore thoughts that are usually suppressed by my mind in every day life.  It is as if I have been granted the gift of looking at my life objectively, free from ordinary defense mechanisms, skepticism, and ego.  No new perceptual changes to note.  The peak of this experience never quite reached a full +++ and now things seem to be at a declining ++ state.  Although very enjoyable in its own rite, this dose of Methylone never quite reached the level of pure euphoria that I have had with MDMA in the past.",
  "T+3:43  My pupils are no longer dilated and although I can still undoubtedly feel something lingering it is much more of a + than a ++.  I estimate out about 100mg more Methylone, arrange it in a line, and send it up my nostrils.  The initial burn isnt horrible but the nasty chemical drip hangs around for awhile.  Im not ready for this to be over just yet though!  Im also brewing up a medium dose of Kratom tea for the comedown.",
  "T+4:52  The redose never really kicked in and my pupils are still small.  I just downed some nasty tasting Kratom tea and am hoping I brewed up the right amount this timemy last experience with (way too much) Kratom involved me nodding off to sleep and waking up puking my guts out about 5 hours later.  I also just took 2mg of Klonopin to help wind down the evening.  I still feel a bit stimulated from the Methylone and I wont be falling asleep anytime soon, but pretty much all of the euphoric effects of Methylone are gone.  No harsh comedown, however.",
  "T+6:04  Im still feeling a faint, trace amount of the Methylone but I think the redose was mostly just a waste.  The Kratom and Klonopin have me feeling nice and relaxed thoughI think Ill brew up another cup of Kratom tea.",
  "T+7:13  No more noticeable effects from the Methylone.  Feeling pretty exhausted physically and emotionally, but nice and relaxed at the same time.  Im gonna take an Ambien, watch a little TV, and call it a night.  Kratom has treated me surprisingly well this evening Im feeling a nice opiate-like comfort with only the slightest hint of nausea.  Not a bad first experience with Methylone either.  I am curious about how this chemical would combine with something that is a bit more visual in its effectsthat could be quite a nice synergy.",
  "T+8:08  Goodnight.",
  "Summary: The initial effects of Methylone certainly mimicked those of MDMA but I was a little disappointed that there wasnt a more profound peak.  Although it was certainly useful for introspection and quite euphoric at times, there werent any interesting perceptual distortions or overwhelming emotions that would categorize a +++ experience.  It is certainly something I will try again though, despite how expensive it is because of the relatively large dose it requires compared to other phens."
 ],
 "erowid": {
  "id": "58766",
  "citation": " Double Trouble. \"Just Like MDMA, Then...: experience with Methylone (ID 58766)\". Erowid.org. Jan 14, 2007. erowid.org/exp/58766",
  "substance": "Methylone",
  "views": "63877"
 }
}
