{
 "title": "Curiosity Leads to Interesting Experience",
 "author": "Quasita",
 "citation": " Quasita. \"Curiosity Leads to Interesting Experience: experience with Metaxalone (Skelaxin) (ID 98982)\". Erowid.org. Jul 10, 2013. erowid.org/exp/98982",
 "substance": "Metaxalone (Skelaxin)",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   "400 mg",
   "insufflated",
   "Pharms - Metaxalone",
   "(pill / tablet)",
   "",
   "400 mg",
   "oral",
   "Pharms - Metaxalone",
   "(pill / tablet)"
  ]
 ],
 "report": "<p>After some consideration of various sites and pieces of information, I decided to try out insulfating 800mg of Skelaxin as a possible means to a body high.  The idea had been previously raised by my boyfriend. </p><p>Having been a long time user of the medication for a skeletal spinal condition, I had not much explored the idea of recreational use.  I knew from prior discussions with friends that taking 1600mg with a 40oz of beer would make your legs turn to noodles, so the boyfriend and I had tried it with a variety of cocktails.  Personally, I find the medication to be a great additive to a smooth kush or even coupled with something like Xanax.  I know that it is not for everyone though, and I recommend taking it on its own before adding other things to it, to make sure that you do not get sick.</p><p>Anyway, this go around, I crushed up an 800mg pill.  It was easy enough to get it crushed to a fine powder, and since it generally tastes like a gritty chalk, I thought snorting it would go easily.  I made a couple lines and used a cut straw to draw it into my sinuses.  I noticed several things immediately:</p><p>1. It is so dry that it went straight through to my throat.</p><p>2. Upon contact with any mucus or membrane, it made a thick paste, that made snorting more difficult.</p><p>3. The taste was more bitter going through the nose than the mouth.</p><p>4. It had a sting to it.</p><p>These things being said, roughly 400mg went up the nose fairly easily.  I could not, however, bring myself to do another line.  It was just too rough of a snort.  I mixed the rest into some strawberry soda, which masked the flavor easily.</p><p>Even with the rough experience of insufflating, I would say that it was a worthwhile venture.  It definitely hit faster and more thoroughly than swallowing the pill whole.  Within an hour, I felt a general full body relaxation with a mind 'floating' sensation in the head.  The only downsides were that the paste was still present in my nose, the sting/burn of it was still present, and I found myself sweating profusely.  Since I didn't have anywhere to go, this wasn't a problem, but it definitely is not #1 for things I enjoy experiencing.</p><p>I guess overall I'd give the experience a 6/10.  If I have other means to alter my reality for a bit, I would do that, and possibly add a full pill to whatever it is if I want a boost to muscle relaxing.</p>",
 "year": "2012",
 "id": "98982",
 "gender": "Female",
 "age": "30",
 "timestamp": "2013-07-10T07:00:00.000Z",
 "views": "1836",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "400 mg",
   "administration": "insufflated",
   "substance": "Pharms - Metaxalone",
   "form": "(pill / tablet)"
  }
 ]
}
