{
 "id": 9899,
 "title": "Mushrooms - Au Naturale",
 "date": {
  "submission": "2007-10-23T07:00:00.000Z",
  "experience": "2007"
 },
 "author": {
  "name": "Soundgardener",
  "gender": "Male",
  "weight": 64
 },
 "dose": [
  {
   "time": "0",
   "amount": "3.5 g",
   "administration": "oral",
   "substance": "Mushrooms - P. cubensis",
   "form": "(dried)"
  },
  {
   "time": "0",
   "amount": "repeated",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  },
  {
   "time": "0",
   "amount": "10 mg",
   "administration": "oral",
   "substance": "Hydrocodone",
   "form": "(pill / tablet)"
  },
  {
   "time": "0",
   "amount": "10 mg",
   "administration": "oral",
   "substance": "Hydrocodone",
   "form": "(pill / tablet)"
  }
 ],
 "report": [
  "This is my account of my first experience of psychedelic mushrooms. I am 17, and previous to this I have had experience with cannabis, speed, LSD, MDMA, cocaine, and a myriad of painkillers.  I was in a bad car accident several months prior to this account, where I broke four vertabrae and a wrist, and I am still taking painkillers. This Being said, I had my first experience with LSD over a year ago, which was mind-blowing to say the least (+4 type of experience). Since then I had tripped four times, all of them were enjoyable. My only gripe with acid is how harsh it can be sometimes. It seems to leave me with a very unnatural mental and physical feeling. This is where the mushrooms come in.",
  "Mushrooms have been very scarce in my area, and when they are around, I'm either broke or they're extremely over-priced. It seemed like a somewhat spontaneous decision, but when I heard one of the regular dealers I buy from had mushrooms, I was in. For the days leading up to this experience, I was very sound of mind. Although I did not do any meditating, I was generally happy and definitely looking forward to trying mushrooms. When we bought the mushrooms, the guy said they were the best in Maryland, and others said they were the best they've ever had. At 1:00pm, My friend C gave me a ride over to his place where we figured we would be tripping with another friend K. K had done mushrooms several times and was another one of my best friends. She was going to take an eighth at first, but her mushrooms looked weak (she had bought them elsewhere), so she ended up getting another eighth from said dealer. I know that since she takes an SSRI, The effects would be somewhat diminished, but regardless taking a quarter ounce of mushrooms seems like a valiant feat to me.",
  "At approximately 2:00pm, We ingested the mushrooms. K prefers to eat them alone, but I feared for how bad they would taste, so I stuck them in a PB&J. The first bite wasn't bad at all, but the more I ate the worse it would taste. Looking back on it, I think I psyched myself out about it. It was grueling but I finished my sandwich. Before we ate them, we let C pinch a little bit from the all of the bags we had (I also picked up two more eighths for another friend). At about T+1:00, we headed over to our friend S's house. He had promised to roll us a joint the day before. Once we got there, I was definitely altered. I had an very pleasant body high, and my thinking was going into overdrive.",
  "After a couple of bowls I looked over at the white brick wall under S's deck where we were smoking. This is when I started to have visuals. The ridges on the bricks were moving as if it were water in a pond. Slowly I noticed subtle changes in color washing over the wall, K and I shared a laugh as our trip REALLY began. Even though I had little anxiety, what was left of it completely dissapated. It was almost the same euphoria that I get when taking a large amount of painkillers, but manifested visually also. About this time I took one of my vicodin 10's, hoping to make my body high even better, which it did. When we were done smoking I began to noticed the sheer amount of fractal patterns appearing in everything. After reflecting on acid trips before this experience, I started to theorize that the universe and reality as a whole is fractal in nature. I didn't exactly understand all of my hypothesis, fractal patterns took on more meaning since then, but I digress.",
  "Once we were inside, S's brother B, who has a lot of experience with mushrooms, put on some Ozric Tentacles to trip out to. Over the last couple of years I have been listening to increasingly larger amounts of this band. They have the ability to define psychedelia musically for me. I began listening in awe of this amazing band when I realized that every single sound they make, they make to complement psychedelia. I was experiencing a sort of synaesthesia. The sharp rhythmic parts of the music shaped my visuals into a grid-type design, while the lead instrument, which was switched between synth and guitar, seemed to be free of the this grid. This was the first time that I could really put in to words what music is like under the influence of psychedelic drugs. I peaked at this point at a +2.",
  "S's mom was about to come home and he was only allowed to have a certain amount of people over so C, K, B, and I all went back to C's house where we sat in his room and put on Dark Side of the Moon on vinyl. This is certainly one of my favorite records of all time. I remember C saying 'I love watching D (me) listen to Pink Floyd', because listening to Pink Floyd on psychedelics is THAT much of an experience to me. After the record was done, I noticed that my visuals were diminishing and that I was coming down. Coming down on mushrooms was a very gentle comedown, it was like being stoned but with more energy. We all sat around talking until my girlfriend A, texted me and came over. This was the first I would be around her while tripping. For some reason, I was always worried about being around her when I was on psychedelic drugs, I guess because she has a lot of control over how I feel since she is so important to me. As it turned out it was just like hanging out normally.",
  "A suggested that we play Apples to Apples, I don't know how popular this game is, but we play it all the time. It involves a card that has an adjective on it being put down, and each player has a hand full of cards with nouns on them, and everyone puts one in and whose ever turn it is, is the one who judges it, and the funniest match wins. For some reason I was dominating at this game. It was like the mushrooms gave me super-human abilities of relating things together. I barely even looked at the cards, it was very automatic to me, I still cannot explain why this happened. After getting bored of Apples to Apples I pulled out my stash of bud. B then fashioned a pipe out of a pear, and we began smoking. I was hoping that it would boost me up to another peak like the way smoking is with acid, but instead I just got a good 'ol weed high, which isn't bad at all either.",
  "Once we were all good and stoned again, there was speculation as to where there was food upstairs. C brought down a small pizza which was quickly demolished. This was another great thing about mushrooms, I could eat with no problem. Whenever I did acid, eating was always extremely hard and awkward. Then K's best friend L came over. She had recently tried mushrooms for the first time on new years, so she was happy to see that I finally had tried them. Then there was a collective decision to plunder the refrigerator upstairs. We all ate chips and salsa which were quite delicious.",
  "K, A, L, and I all went back to my house to watch the movie Waking Life. K and I were pretty much all the way down. I took another Vicodin 10 to help my back from such a long day. Watching a movie was a perfect ending to a great trip. This movie was especially good, many of the topics discussed in the movie I had pondered earlier while tripping. After almost everyone nearly falling asleep throughout the movie, K and L decided to leave to get some sleep. A and I watched TV and talked for about an hour until she had to go home. I quickly passed out for a good twelve hours then woke up the next day feeling great.",
  "Overall I had a great time doing mushrooms. I would recommend trying mushrooms before LSD, it seems like more of a common ground between the two substances. While on mushrooms I was able to think much more clearly than on acid, and seemed way more of a natural experience in general. I think everyone who is sound enough of mind, should try a psychedelic drug, it has changed my life for the better."
 ],
 "erowid": {
  "id": "58778",
  "citation": " Soundgardener. \"Mushrooms - Au Naturale: experience with Mushrooms - P. Cubensis, Hydrocodone & Cannabis (ID 58778)\". Erowid.org. Oct 23, 2007. erowid.org/exp/58778",
  "substance": "Mushrooms - P. Cubensis, Hydrocodone & Cannabis",
  "views": "3768"
 }
}
