{
 "title": "I Love Me Some Lemon Balm",
 "author": "CowsDoFly",
 "citation": " CowsDoFly. \"I Love Me Some Lemon Balm: experience with Lemon Balm (ID 99074)\". Erowid.org. Jan 30, 2013. erowid.org/exp/99074",
 "substance": "Lemon Balm",
 "bodyweight": "165 lb",
 "report": "<p>I recently discovered the psychoactive properties of Lemon Balm.  I first had my taste of this wonderful substance because my friend was looking for something that might help him smoke less Tobacco.</p><p>I and another friend of mine had enjoyed Lemon Balm as a tea, which is known to interact with GABA[1], Nicotinic[2], and Muscarinic[2] systems.  We found the effect pleasant and calming. </p><p>I decided to roll some into a 'cigarette.'  To help the roll I added a very small amount of tobacco: I estimate it was less than 200 mg.  Me and my friend shared this 'cigarette.'  Soon we both experienced very power tobacco like effects, vertigo and euphoria in particular.  These effects were much more powerful than 10x the amount of tobacco that was in the 'cigarette', we both had trouble walking in a straight line--I almost tripped, my friend fell over on the bus.  We started laughing uncontrollably.  My friend reported mild visual effect much like that of a migraine aura ('lights dancing around the edges of [his] eyes.')  I did not experience any visual effects. </p><p>These initial effects lasted about 20 minuets and were replaced by sedative and anxiolytic effects.  We were very disinhibited, and found ourselves saying and acting strange around our friends (who had not partaken).  Later we got very sleepy, on the level of 24 hour sleep deprivation.</p><p>A week later we tried again, with a much large amount of LB (Lemon Balm,) but without any tobacco.  We experienced none of the tobacco like effects, but immediately the sedating after effects experienced previously.  We had thought the tobacco played no role because of the tiny amount that was present. </p><p>I have now tried again with a similar amount of tobacco and a similar amount of LB.  The results proved to be repeatable.  I have also smoked LB alone many times, I enjoy it very much.  Me and my friends now enjoy the occasional bowl of Lemon Balm, one friend describes it as 'like marijuana, but without any of the impairment.' </p><p>I love me some Lemon Balm.</p><p>Here is an interesting and related article:</p><p>Kennedy, D. O. 'Attenuation of Laboratory-Induced Stress in Humans After Acute Administration of Melissa Officinalis (Lemon Balm).' Psychosomatic Medicine 66.4 (2004): 607-13. Psychosomatic Medicine. Web. 25 Jan. 2013. .</p><p>[1] Awad, R., Muhammad, A., Durst, T., Trudeau, V. L. and Arnason, J. T. (2009), Bioassay-guided fractionation of lemon balm (Melissa officinalis L.) using an in vitro measure of GABA transaminase activity. Phytother. Res., 23: 10751081. doi: 10.1002/ptr.2712</p><p>[2] Kennedy, D. O., G. Wake, S. Savelev, N T J. Tildesley, E. K. Perry, K. A. Wesnes, and A. B. Scholey. 'Modulation of Mood and Cognitive Performance Following Acute Administration of Single Doses of Melissa Officinalis (Lemon Balm) with Human CNS Nicotinic and Muscarinic Receptor-Binding Properties.' Neuropsychopharmacology 28.10 (2003): 1871-881. Nueropsychopharmacology. 28 July 2003. Web. 25 Jan. 2013. .</p>",
 "year": "2012",
 "id": "99074",
 "gender": "Female",
 "age": "18",
 "timestamp": "2013-01-30T08:00:00.000Z",
 "views": "6115",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "200 mg",
   "administration": "smoked",
   "substance": "Tobacco",
   "form": "(plant material)"
  },
  {
   "time": "",
   "amount": "1 g",
   "administration": "smoked",
   "substance": "Lemon Balm",
   "form": "(plant material)"
  }
 ]
}
