{
 "id": 9907,
 "title": "Hell Hath No Fury on the Heart Like ...",
 "date": {
  "submission": "2007-01-20T08:00:00.000Z",
  "experience": "2006-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Cibilian",
  "gender": "Male",
  "weight": 75
 },
 "dose": [
  {
   "time": "0",
   "amount": "5.0 mg",
   "administration": "smoked",
   "substance": "5-MeO-DMT",
   "form": "powder/crystals"
  }
 ],
 "report": [
  "Holy crap.",
  "Thump  thump thump thump  thump  thump thump  I wondered if I would come back alive",
  "It had been sitting in my fridge for quite a while. I had just finished writing up a recent pharmahuasca experience, and having been left in a rather psychedelic mood from the exercise, I decided to bust out the 5-MeO-DMT and give it a whirl.  It was my first time.",
  "The set and setting were suitable for the occasion.  I am a happy guy and I love our cozy, soulful apartment.  I decided to start with 5 mg, but as Im writing this one day later, Im wishing I started smaller.  With my trusty psychonaut girlfriend by my side, I smoked it with a small glass crack pipe, carefully heating the crystals until they began to vapourize.  It came on fast and furious, feeling very similar to DMT in the beginning but not as visual. The taste was similar and the vapour went down smooth, as if it werent there at all  and so it begins",
  "Very quickly I am overtaken by a chemical stranglehold  my instinctual breathing mechanism ceases working, and I find myself deliberately trying to keep breathing.  The room around me breaks up into subtle, pixilated digital patterns.  Things look edgy and dark, evil.  My heart begins to race, and it sounds nothing like a heartbeat  a thoroughly irregular thump  thump thump  thump thump thump thump  thump. The sound fills my ears.",
  "What is left of my focus is on two things, remembering to breathe, and deliberately doing so in long controlled breaths, and trying to meditate my heart rate down to a more manageable, regular beat.  Fear rises up in me like fire, but I understand intellectually that managing my fear is paramount  so I breathe, and breathe again.  I need to succumb, but my flight response is screaming.  I am being sucked down, but I dont want to go.",
  "I can think fairly clearly despite my toasted brain. I am fragmented into two parts,  My rational intellectual self and this scared rabbit slipping down the hole.  I have never had to rely as heavily on my awareness and meditative skills than at this moment.  My body feels like lead.  I close my eyes, and see geometric patterns swirl across my mental landscape for a moment, but as I do so I feel myself getting sucked down again, so I snap them back open. I have to keep my eyes open to stay connected. I have to stay connected because if I dont, Ill stop breathing.  I manage to squeak out  scared  to my beautiful girlfriend, who sits beside me repeatedly encouraging me to let go to the experience, and reminding me that whatever is happening to me, it will pass.  Im glad she is there, but she sounds too far away.",
  "As the peak begins to fade, perhaps after about 5 minutes, I feel tremendously relieved.  Im going to live.  I lay there, struggling to explain to my girlfriend what has happened, while the effects of the 5-MeO-DMT subside. One half hour later, I feel almost normal again. One hour later and I am getting ready to go out to a party.",
  "Would I do it again? Yes, but Id lower my dose.  I almost wish I could raise the dose to go deeper into the effects, but I was truly frightened for my heart. I have never heard or felt my heart beat like that before.  It was primarily this that resulted in the terror, but terror in itself is not such a bad thing. It can be very grounding somehow. When it goes away, a true sense of peace takes its place.  I am disappointed it wasnt a more successful journey. I was really looking forward to 5MeO-DMT, because I had a sense it would be an ally.  DMT and salvia have been good to me, and I thought it would too.  Maybe it will be in time, but for now, Ive got to regroup and think about this for a while. ",
  "Be very careful  as strangely interesting as it was, it wasnt fun. Not even a little bit."
 ],
 "erowid": {
  "id": "58802",
  "citation": " Cibilian. \"Hell Hath No Fury on the Heart Like ...: experience with 5-MeO-DMT (ID 58802)\". Erowid.org. Jan 20, 2007. erowid.org/exp/58802",
  "substance": "5-MeO-DMT",
  "views": "35939"
 }
}
