{
 "title": "Friday Night Phenethylamines",
 "author": "twilly",
 "citation": " twilly. \"Friday Night Phenethylamines: experience with 25I-NBOMe (ID 99081)\". Erowid.org. Feb 28, 2013. erowid.org/exp/99081",
 "substance": "25I-NBOMe",
 "bodyweight": "150 lb",
 "report": "<p>So me and some friends got the rare opportunity to trip on 25i-NBOMe, and I thought I would write about the experience here because the experience reports for this compound seem very limited. First off, a little about my experience with drugs: I am a very experienced and very knowledgeable substance user, who has done an extremely wide variety of different substances,  and consider myself a drug expert (I do a couple hours of drug research every day, it just keeps me entertained because I find drugs so interesting), it would be easier to name the ones I havent done than the ones I have.</p><p>It all started when my friend sent me a picture of a very colorful and detailed sheet of 25i, and said that they were 1mg tabs and that he was selling some. Having done little research on this particular compound, I did some research on it and decided that it was something that I was willing and very eager to experience. So I got some of my friends interested, sent them to do some research before deciding to take it, they read some experience reports but I do not believe they were prepared for what was to come.</p><p>So it was me and 5 of my friends, we got 8 tabs of 25I and decided that the plan would be to go to this party (they called it a party but there were only a few other people there besides us so it really wasnt) for the come up and then head back to my place for the remainder of the trip.</p><p>T+ 0:00- we each take one of these 1mg tabs of 25i, not really believing they were actually 1 mg (the person we got it from is known to exaggerate), which is listed as a strong dose (we now believe they really were 1mg). We dropped these under our tongues at about 5:00pm and embarked on the 30 minute walk to the party. The walk was fairly uneventful, the tabs made our mouths kind of numb and tasted strongly of bitter chemical, we knew we were in for a treat at this point just from the taste.</p><p>T+ 0:30- we arrive at the party to find that it is just the host and one other friend, but theyre chill so its no big deal. Effects are starting, everyone claims to feel something but nothing big yet. Over the course of the next half hour the effects grow rapidly. The come up consisted of warm and cold flushes throughout my body, color enhancement which seems to come in waves of growing intensity, nausea and general discomfort. We all agreed that the come up was best described as uncomfortable and disorienting.</p><p>T+ 1:00- unpleasant comeup sensations quickly subside, we all agree that we are now officially tripping. Everyone was fascinated by what they were seeing, the visuals were INTENSE. Not only was the world more colorful, but there was strobing and kaleidoscopic effects, where things would morph and there were fractal patterns everywhere, and we all knew we were not even fully peaked yet. My friend (well call him S) started to have a bad trip, he was very disoriented and had no idea what was going on, he kept asking whether he was supposed to feel like this or if he was dying. We believe this was due to being in an unfamiliar social setting at this party, none of us had ever been in that house before and the host and her friend were sober, so we were kinda just there tripping sack while the 2 sober people were just watching us laughing.</p><p>Although S was having a bad time, we decided to stay there a little longer since it was freezing cold (15 degrees Fahrenheit) and very windy. We try to divide the 2 remaining tabs in half so that the 4 people who wanted one could get a booster dose, but we failed on cutting one and managed to have a  tab and a  tab (the other one was divided almost perfectly), I was lucky enough to get the  tab piece. As soon as we take the booster doses, S demands we leave at once, and says he was scared and just wanted to be back at my place, so we embark on the 30 minute trek back to my house in the freezing cold and wind. The walk was awful and cold, but we were kinda kept preoccupied from the cold by taking in the scenery.</p><p>T+ 2:00- we arrive back to my place and lie S down immediately. He was more disoriented and scared than ever, and seemed to be caught in a loop where he kept forgetting he was on anything, and kept asking us what was going on. He later said he pretty much felt like we were all playing some sort of sick joke on him. His negative energy radiated from him to everyone else in what can only be described as a bad vibe so we put him in another room to try and sleep, then we got nervous that he would wander the house and run into my mother like a stereotypical kid whos having a bad trip and get us all caught (my mom has a VERY strict no drugs but weed rule, where if I get caught doing any drugs I cant bring my friends over again) so we brought him back to our room and tried to get him to relax and take in the relaxing pink floyd we were playing, it didnt work but we didnt mind, everyone but him was having the best time of our lives.</p><p>We had now peaked and were in fractal wonderland, the whole world was strobing and morphing and changing right before our eyes, and pink floyd proved to be the perfect music for such a time. In my mind, I was pretty clear headed and able to seemingly think straight, but only for a few seconds at a time then our minds would scatter and run amok. I could definitely see how someone could fool themselves into thinking theyre sober enough to do things like drive or take unnecessary risks while under the influence of this compound.</p><p>T+ 5:00- Ss bad trip ends in a flash, he goes from being completely disoriented and scared to suddenly just getting it and becoming a happy, sociable member of our group again. We were all still definitely tripping, but it seemed to have leveled off and we knew the intense part of the night was over. We kept gradually coming down over the course of the next 5 hours; the comedown was pleasant and comfortable, there were still visuals until about T+ 7:00, but they werent nearly as intense as before. It was a long smooth ride back to reality.</p><p>We all kinda wanted to go to sleep at this point, but werent tired at all, so we kept talking and joking about our night, recollecting pretty much every aspect of our trip and comparing/contrasting our experiences. At 3 in the morning (T+10:00) we decided that we were no longer tripping and that only threshold effects remained (plus we each had a long day ahead of us tomorrow) so we made a strong effort to go to sleep, after about an hour of trying, I was asleep. And upon waking up at about 9 the next moring, I was actually pretty refreshed and there was very little if any afterglow from the trip.</p><p>\tAll in all, 25i-NBOMe was the greatest drug experience of my life, and the most stereotypical psychedelic, pretty much mimicking the kind of unrealistic drug experience you would see on cartoons, even more so than real LSD. I believe that it is what the average person whos never done a drug thinks dropping acid would be like. The only bad part was the uncomfortable comeup, and that subsided within an hour and a half of taking the drug.</p><p>I can definitely see how the unprepared or drugs nave user could freak out on this stuff and have a bad trip like S did (he did not bother to do any research about this substance even though I sent him information and insisted he read up on it, and he has only experienced weed and ecstasy before this event). We all agreed that 25i definitely has a way of giving you what we called a clear-headed mind-fuck where you think your way more sober than you really are. 25i (at the doses we took) is definitely not for the inexperienced or irresponsible. Treat this substance with the respect it deserves, and it should treat you to one of the greatest drug experiences out there.</p>",
 "year": "2013",
 "id": "99081",
 "gender": "Male",
 "age": "19",
 "timestamp": "2013-02-28T08:00:00.000Z",
 "views": "1515",
 "dose": [
  {
   "time": "DOSE: T+ 0:00",
   "amount": "1 hit",
   "administration": "sublingual",
   "substance": "2C-I-NBOMe",
   "form": "(blotter / tab)"
  },
  {
   "time": " T+ 1:30",
   "amount": "3/4 hits",
   "administration": "sublingual",
   "substance": "2C-I-NBOMe",
   "form": "(blotter / tab)"
  }
 ]
}
