{
 "id": 991,
 "title": "It Sucks",
 "date": {
  "submission": "2005-02-01T08:00:00.000Z",
  "experience": "2002-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Andrew",
  "gender": "Male",
  "weight": 77
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "number": "2",
    "unit": "shots"
   },
   "administration": "oral",
   "substance": "GHB",
   "form": "liquid"
  }
 ],
 "report": [
  "I have had moderate experience with a variety of psychoactive substances including alcohol, bud, various painkillers, hydrocodone, acid, dxm, ectasy, muscle relaxers, and various other drugs.  This last weekend, i put in to buy some ectasy with my friends since we had been planning on it for a while before then.  One of my friends left to go get it and he came back about an hour later with about a 32 oz bottle of what he was calling liquid x. Everyone was skeptical about it at first, i don't think any of us had seen liquid x before ever, but we were eager to try it.  Myself only did 2 shots while the girls did about 3 a peice and my other friends did about 2 a peice.  Everyone thought they were starting to roll after about half an hour and we all sat down to watch the fast and the furious.  One girl started getting sick to her stomach, but we didn't think too much of it since i had heard of people getting sick before from rolling.",
  "Everything still seemed normal at this point and we all started moving around the house quite a bit.  We all went out to the garage and sparked up a bowl and were all in a pretty euphoric mood at this point.  I was lounging back in a big soft chair and i started feeling really dizzy and faint.  I also started hyperventilating and i felt really queasy. It seemed like everyone around the house was coming down or something at this point.  I was feeling sick and went to take a dump but ended up barfing in my friends bathtub.  The next thing i know, one of the girls was throwing up out in the garage and another one was passed out on the couch.  At this point everyone was getting pretty nervous and not wanting to have to be there when a squad would have to be called. The girl that threw up in the garage had gone unconcious and was hardly responding to physical contact.  The only way i was able to get her to respond was to irritate her significantly, like prying her eyes open for example.  I wasn't feeling good but at least i was conscious and i was able to help clean up some.",
  "After a while the girls came to and everyone was able to leave.  None of us thought we had really taken x at this point but we couldn't do much about it at the time, due to a drug bust in the neighborhood and everyone that was selling had their phones turned off. The next day, although i wasn't there i heard that a good friend of mine had gone ahead and taken it again, this time only doing 1 shot of it to see if it had any different effect.  He ended up passing out on the sidewalk with a girl that was trying to take care of him. Someone eventually called an ambulance and the police and he was taken to the hospital.  He turned out okay and he hasn't gotten into any trouble for it yet that i know of.",
  "Overall it was a miserable experience, except we thought we were really rolling for the first hour or so we were on it.  I would recommend never even trying this drug, it was much too dangerous of an experience to risk just to experiment with it."
 ],
 "erowid": {
  "id": "12873",
  "citation": " Andrew. \"It Sucks: experience with GHB (ID 12873)\". Erowid.org. Feb 1, 2005. erowid.org/exp/12873",
  "substance": "GHB",
  "views": "26042"
 }
}
