{
 "title": "Minor Effects -- Fraudulent Seeds??",
 "author": "Jason",
 "citation": " Jason. \"Minor Effects -- Fraudulent Seeds??: experience with H.B. Woodrose (ID 9910)\". Erowid.org. Aug 6, 2004. erowid.org/exp/9910",
 "substance": "H.B. Woodrose",
 "bodyweight": "150 lb",
 "header": [
  "DOSE:",
  " ",
  "oral",
  "H.B. Woodrose"
 ],
 "report": "<p>Several dosages were tried over several days.  Each trial used the below preparation process.</p><p>Preparation:</p><p>1.  Seeds arrive 'Pre-Cleaned and Fuzz Free'</p><p>2.  Inspect seeds, looking for any remnant fine white fuzz that may have been missed.  Most seeds have very small amounts which are scraped off with a small sharp knife.</p><p>(It is my guess that the fuzz has something toxic in it and this is why some/most people experience sickness to some degree. With this process no sickness was experienced, however, read on as I now question if these seeds are really Hawaiian Baby Woodrose)</p><p>3.  Wash and rinse with filtered water (no soap, just scrubbing)</p><p>4.  Dry seeds with a towel.</p><p>5.  Crush with mortar and pedestal to make a fine powder. </p><p>(I hoped that by increasing the surface area absorption would be quicker and easier.  If chewed well and if absorption can occur in the mouth, then this would allow more consistent results as the state of the stomach (empty/full/etc) would be a smaller part of the equation.)</p><p>6.  Put small amounts in mouth and chew very well before swallowing until total dosage ingested.  Then start timer with which to correlate results.  This step was altered in some trials as noted below.</p><p>NOTE:  Validity of the seeds is in question! </p><p>Each trial was done on different days</p><p>Trial 1:</p><p>3 seeds to start, 2 more later</p><p>1 hour (after ingestion process ended): slight decrease in mental tracking of concurrent events, however with focus on one event, everything seems normal.  Very mundane effect and it may be missed if not specifically looking for something to happen.  This may even be a placebo effect. </p><p>1.5 hours: Ingest 2 more seeds (same preparation technique)</p><p>1.75 hours: some strange chest tightness, not pleasant, but not scary.</p><p>7 hours: No more effects.  Bedtime.  No strange dreams, no crazy hallucinations, no expected deeper than normal sleep.</p><p>Trial 2:</p><p>8 seeds (which is the highest recommended dosage, according to many sources)</p><p>5 minutes after a slow (10 minute) ingestion process (maybe in trial 1 the seeds got to the stomach too quick and mixed with food??): some minor body sensations which once observed would disappear.  These are very hard to describe - body just feels different and the effect is very minor.</p><p>7 hours: No more effects since those first few.</p><p>Trial 3:</p><p>5 seeds with a different ingestion technique.</p><p>On the possibility that the LSA needs to be in the stomach to be absorbed (and possibly is slow to arrive there or just lines throat when the seed powder is chewed), the seed powder is mixed with water then drank.</p><p>4 hours:  Relatively no effects were felt, just some of what was seen in trial 2, but to a smaller degree.  Somewhat increased desire to dance since body felt slightly odd.</p><p>Trial 4:</p><p>12 seeds using the original ingestion technique</p><p>Effectively no effects.  Those effects felt were as minor as in trial 3.</p><p>Trial 5:</p><p>Chewed 5 seeds instead of crushing with mortar and pedestal, just to see if this would change things; it did not.</p><p>Three other people (1 male, 2 female) tried 3 seeds each without noticing any effects.</p><p>Conclusion:</p><p>Effects over several trials of various dosages and trials by other people were not remotely as expected, taste was not 'terrible' as expected. Though pictures of known HB Woodrose seeds match these samples, it seems these samples were not the seeds that were ordered.  **What might the effects be of these unknown seeds?!**</p>",
 "year": "2001",
 "id": "9910",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2004-08-06T07:00:00.000Z",
 "views": "9699",
 "dose": {}
}
