{
 "title": "Sensational",
 "author": "Experienc3",
 "citation": " Experienc3. \"Sensational: experience with 25I-NBOMe (ID 99126)\". Erowid.org. Mar 22, 2013. erowid.org/exp/99126",
 "substance": "25I-NBOMe",
 "bodyweight": "140 lb",
 "report": "<p>Sensational</p><p>This was not the first time I had experienced the effects of 2C-I-NBOME, and certainly won't be the last.</p><p>It was the day before I had turned 18 and my friend had offered me some $. I said 'hellyea!' about an hour or so later my 'dude' said he had gotten his hands on some more 2CI-NBOMe. I had my friend who had given me the money, lets call him R, drove me over to get the 2 hits. They were continaed in capusles and really didn't look like much with the tiny amount of powder the capsule contained. I headed over to my other dudes, C, and offered him to try it for the first time. After smoking a couple bowls of some perp I had the night before we began to get lost in our conversation. I had reminded him about the NBOMe, and he told me to try first.</p><p>Around - [5:30]</p><p>+[0.0] I shook the capsule to make sure it was mixed and emptied it onto a book in C's room. I inhaled the substance and we covered up the evidence.</p><p>He wanted to wait until I had began to trip and see if I was freaking out. I kept telling him I had done this before, and it was fine. We went out on his deck(his yard is about an acre and the scenery is just amazing) and we smoked another bowl of cannabis to pass the time. Realize, his parents weren't home and wouldn't be home until the next day so we had the entire house to ourselves and didn't have to worry about getting busted.</p><p>+[00.15] I had started to feel strange. My mind felt as if it didn't know what to do and walking had began to feel more of a hassle. It felt similar to a past experience with 2CE where I constantly felt like I had to move positions to feel comftorable.</p><p>+[00.30] Visuals were starting to appear now. The walls were breathing, colors were more vivid, and euphoria was slightly starting to come in.</p><p>C has a VOTE FOR JUDGE MARY JANE, TRAPP sign on his wall. Like a legit sign that would usually be in the ground on someone's lawn haha. As soon as we entered his room I mentioned to him that the words were coming off the poster and that colors were starting to form on the wall as well. He launched up and was like 'Dude, mothafucka why didn't you say that sooner!' He snorted half of the other capsule and I inhaled half of what was left.</p><p>+[00.45] My mind had been blown, I wasn't even peaking yet and the visuals were outstanding, everything was moving. Colors were appearing where they shouldn't have been and my friend's face was beginning to expand if I stared at it long enough.</p><p>+[01.00] C's hit had begin to kick in as well as he couldn't stop talking. I like to refer to it as ACID talk where someone just keeps rambling on about a bunch of 'bigger then life' and 'I feel like something that has a purpose' kind of talk. I didn't mind it as much as the euphoria had increased to such an intensity that I couldn't get off C's bed. Everything felt so good and my body felt like it was floating.(This is the most intense euphoria I have felt through all my experiences) Everything that was said sounded amazing, and the visuals had increased as well. The walls were melting around me and C had began to play a song on his phone. The colors that reflected off the ceiling in his dark room were moving to the music. I felt that this possibly couldnt be real, but loved it. It was sensational and made my psychedelic experience one of a kind.</p><p>+[2.00] C's dosage had fully kicked in by this time and my feeling completely changed. I felt a rush of energy and got up from his couch. We decided to smoke a bowl of cannabis and everything became relaxed at this point. The lights from his deck had all began to have a glow and the newly set snow glistened in such a way that I never thought a night had been this beautiful.</p><p>+[3.00] R decided to come over as well and I felt one with myself. I thought that nothing could make me unhappy at this point and I had been right. We decided to go up to the local convienent store to get candy and when we arrived I thought everything was gonna be awkward. But no, I felt amazing walking through the aisles in the store and could care less if someone had been looking. Everything looked great, the products were all breathing, and I stopped to look at everything in my uplifted state of mind.</p><p>+[4.00] Visuals had calmed down a bit, but the euphoria remained. I was talking to this girl and everything she said made my body feel so much better, it was if with every word she had been massaging my body. I had taken Molly before, but this feeling was not one of being sexually close but more of a spiritaully close feeling with everyone.</p><p>+[6.00] I had come down from visuals and euphoria was going away.</p><p>++[] I couldn't sleep for 3 hours after the effects had worn off anf this is the only part I disliked about LSD as well. The next day I did not feel tired or exhausted. Overall no hangover. Great experience, one of a kind.</p>",
 "year": "2012",
 "id": "99126",
 "gender": "Male",
 "age": "17",
 "timestamp": "2013-03-22T07:00:00.000Z",
 "views": "1586",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "750 ug",
   "administration": "insufflated",
   "substance": "2C-I-NBOMe",
   "form": "(capsule)"
  }
 ]
}
