{
 "id": 9915,
 "title": "Euphoria Turns to Itchy Discomfort",
 "date": {
  "submission": "2007-06-25T07:00:00.000Z",
  "experience": "2007"
 },
 "author": {
  "name": "Hd280",
  "gender": "Male",
  "weight": 60
 },
 "dose": [
  {
   "time": "0",
   "amount": "100 mg",
   "administration": "oral",
   "substance": "Pharms - Tramadol",
   "form": "(pill / tablet)"
  },
  {
   "time": "0:30",
   "amount": "0.5 tablets",
   "administration": "oral",
   "substance": "Pharms - Oxycodone",
   "form": "(pill / tablet)"
  },
  {
   "time": "0:30",
   "amount": "0.5 tablets",
   "administration": "oral",
   "substance": "Acetaminophen",
   "form": "(pill / tablet)"
  },
  {
   "time": "1:00",
   "amount": "1 tablet",
   "administration": "oral",
   "substance": "Pharms - Oxycodone",
   "form": "(pill / tablet)"
  },
  {
   "time": "1:00",
   "amount": "1 tablet",
   "administration": "oral",
   "substance": "Acetaminophen",
   "form": "(pill / tablet)"
  }
 ],
 "report": [
  "Well, I raided a bunch of tramadol and endocet from a friend's parents cabinet. In any case, I was bored earlier the other day so I decided to try and get a little f'ed up, just a little afternoon fun.",
  "Anyway, I took two 50mg Tramadol, then waited about 30 minutes.",
  "I started to feel 'softer' and then started to feel a little Jelly-like, a little euphoric and then a little tired. I decided I needed to feel some more so I took half of one of the Endocets I have.",
  "Waited 30 minutes or so. Started to feel more painkillery, but still not that much. So I took another Endocet.",
  "Hour later. It hits me, a lot, I'm wavy but pretty clear. I feel great all over and feel the strong sense of swimming through the world that I get from a huge PK dose. Then I'm around and fine for a while, hangin out watching High Fidelity and feeling pretty crazy all over. Then, comes the feeling that I don't really understand... my entire body feels like it's itchy, from head to toe, and I can't stop scratching myself. This goes on for about 4 hours of me just about crying from how itchy I feel, I take some shots and get too fucked up to know what's going on and just pass out.",
  "But let me tell you.. I'm not going to f around with painkillers anymore, because that itchy feeling is just too much."
 ],
 "erowid": {
  "id": "58838",
  "citation": " Hd280. \"Euphoria Turns to Itchy Discomfort: experience with Tramadol (Ultram) & Oxycodone (Endocet) (ID 58838)\". Erowid.org. Jun 25, 2007. erowid.org/exp/58838",
  "substance": "Tramadol (Ultram) & Oxycodone (Endocet)",
  "views": "10863"
 }
}
