{
 "title": "An Awesome Experience",
 "author": "Swim",
 "citation": " Swim. \"An Awesome Experience: experience with 6-APB (ID 99157)\". Erowid.org. Mar 2, 2013. erowid.org/exp/99157",
 "substance": "6-APB",
 "bodyweight": "180 lb",
 "header": [
  "DOSE:",
  "1 tablet",
  "oral",
  "6-APB"
 ],
 "report": "<p>For a while I've been excited about this substance and its reviews so I decided to order some and give it a try. Received four tablets in just a few days after ordering and decided to try it out solo since I wasn't exactly sure how it would affect me. Ingested one tablet with roughly 90 mg's and went about my business around my home. Have to say this was one of my most beloved drug experiences ever.</p><p>Time of ingestion: 7 pm</p><p>T+ 30 min: began feeling a slight tingle through my body as well as a slight warming sensation. Came on very gently and gradually.</p><p>T+ 50 min: I am definitely noticing a stronger feeling of well being and overall comfort and interest in everything around me. A lot of motivation which I like as opposed to some other substances that seem to leave me content with just sitting and being high.</p><p>T+ 1hr 20 min: WOW!! Definite MDMA feeling of well being and enlightenment. Everything around me seems good and interesting. No visual impairment although pupils are very dilated. Really enjoying the come up.</p><p>T+ 2hr: full effects of the drug have kicked in and the feeling is amazing. Felt so warm and comfortable and just wanted to converse with others. I would definitely use this in a party setting or just in public as my self conciseness is in check and my emotions are of a strong caring nature. However, others would know I was on something. Not so much my actions as my physical appearance with pupils being very large. Loving it.</p><p>T+ 2hr 3min to 5hrs: for a few hours I just feel great like I'm in a warm blanket and everything is right with world. Began to comedown after about 5 hours and is very gentle. No urge to re dose as the taper is very slow and gradual.</p><p>All in all an awesome feeling/experience one I will never forget. Sleep seemed difficult even after 10 hrs or so but easy after that. I am looking forward to doing it again sometime soon. This time however, with a few of my friends. Awesome experience, just awesome!!</p>",
 "year": "2012",
 "id": "99157",
 "gender": "Not Specified",
 "age": "28",
 "timestamp": "2013-03-02T08:00:00.000Z",
 "views": "2930",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "1 tablet",
   "administration": "oral",
   "substance": "6-APB"
  }
 }
}
