{
 "id": 9920,
 "title": "Grand Mal Seizure... Not Fun",
 "date": {
  "submission": "2007-01-17T08:00:00.000Z",
  "experience": "2007"
 },
 "author": {
  "name": "tooth",
  "gender": "Male",
  "weight": "155 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "500 mg",
   "administration": "oral",
   "substance": "Pharms - Bupropion",
   "form": "(pill / tablet)"
  }
 ],
 "report": [
  "This incident took place last Thursday night. It was one of those events that removes the divide between your secretive hidden life from the life you portray to others. Like two worlds colliding in an instant, and after its over you better hope you have a good character to fall back on after you lose your blanket of lies. Anyways, this was one of those. Its sucks ass by the way.",
  "I have recently obtained a prescription for Wellbutrin SR 100 mg tabs for a major depressive disorder that ive struggled with for who cares how long. I discontinued Prozac for no good reason, it worked fine but I heard Bupropion could give you a buzz being a dopamine and norephinephrine (is that right?) re-uptake inhibitor. These are pleasure neurotransmitters! Yay.",
  "I take Adderall XR in addition for ADD, but mainly cause it can fuck you up. But thats a different story.",
  "\tThis is what happened. On Thursday morning we had a snow day. When I have nothing to do I get into trouble, its just how I am. I spent the morning at my neighbors snorting Cocaine and feeling cool.",
  "That night I was in my room and had no high whatsoever, and so reality had sunk in and due to my major lack of coping skills, I had to get high again Any kind of high. All I had was Wellbutrin, I popped 5 or 6 100 mg tabs and waited for about half an hour, felt nothing.  I went to eat dinner with my mom and soon enough I started to feel pretty good, I told my mom I feel pretty damn good, and then everything goes black.",
  "\tI awake roughly 10 minutes later in the kitchen sitting in a chair. Someone has their hand in my shirt and I assume its a weird dream. It becomes apparent there are two EMTs crouched next to me putting electro things on my chest and about 7 firefighters surrounding them. I dont know what to think, I was very, very frightened and very, very disoriented. I remember yelling whats going on?! incoherently and my mom telling me I had a seizure and explaining to the paramedics what had happened. It was very bizarre, and strangely horrifying. It was the lapse in time that I found particularly disturbing.",
  "\tI was escorted to the ambulance and was hysterical at the idea of being taken away. The ambulance seems to scare me more than being put in a police car, but yeah I was freakin out. I was hooked up to the monitor and all that and away we went!! En route to Legacy Emmanuel hospital. My heart rate was rough 180 bpm, pretty damn high. The paramedic put an IV in, which hurt like a bitch. I was asked all sorts of questions about my meds, I explained that I abused all of em yada yada. It was no fun. At the hospital I was wheeled in on the bed, and felt like a lazy bum and insisted on walking but they werent having it.",
  "\tI got my own room and spent some very strange silent moments with my mom and little brother, finally calm enough to ask what the hell just happened. I explained my long hidden Adderall addiction to some relief, my mom being cool about it. They took some blood, gave me a CAT scan and some funny looks, but no lollipop, which really pissed me off.",
  "\tThe blood showed traces of cocaine. Busted. Now all my meds are regulated and my relationships with my parents is very strained but getting better.",
  "\tI was unconscious during the seizure, but being told what it was like was heartbreaking  coming from my little brother. He wrote me a long letter begging me to get off drugs because he loves me and it just tore my fuckin heart out. Its been a miserable week.",
  "\tBupropion should not be fucked with. Of course neither should any pharmaceuticals. Grand mal seizures are very, very scary. It is now a haunting experience, and a valuable lesson. Peace."
 ],
 "erowid": {
  "id": "58847",
  "citation": " tooth. \"Grand Mal Seizure... Not Fun: experience with Bupropion (ID 58847)\". Erowid.org. Jan 17, 2007. erowid.org/exp/58847",
  "substance": "Bupropion",
  "views": "24392"
 }
}
