{
 "id": 9921,
 "title": "More than Just Dreaming",
 "date": {
  "submission": "2007-03-12T07:00:00.000Z",
  "experience": "2007-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Mic",
  "gender": "Male",
  "weight": 69
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "g",
    "grams": "1.5",
    "quantity": "1.5"
   },
   "administration": "oral",
   "substance": "Calea zacatechichi",
   "form": "extract-10x"
  }
 ],
 "report": [
  "This is my second experience with Calea Z. My first one was very fulfilling indeed as I experienced some 5 vivid dreams which I could easily recall which is rare with common dreams.",
  "On my last experience I had used 1g of the 10x extract coz I did not have the guts to bear a foul tasting tea brewed from the fresh herb.",
  "This time I wanted a more intense experience so I decided to use 1.5g of the extract and wait for the result. I mixed the extract with 1/4 cup of hot water and simmered it lightly and drank it down as fast as I could. This was a very bitter liquid. I then lit some incense and switched of the light, to encourage me to get into the mood of imagery and made my bed neat and ready. I then listened to some slow R'n'B music to chill out and encourage the effects of the herb 40 minutes had now passed and I now started to feel strange effects take hold. As I was listening to music I noticed strange visual changes. The room seemed to be going dark than lighter periodically.",
  "At first I did not pay much attention to it but than the lit stick of incense caught my attention. It appeared to be going out but then I noticed that it seemed to radiate this weird darkness which spread the longer I concentrated on it. This effect was quite intense at one point and objects also seemed to be in a slight motion especially if they were dark in colour. The funny thing was that the room instantly returned to normal if I shifted my view. I needed to go toilet and so I did, My brother was up late on his PC and I noticed that the blue light coming from the screen lit up his room with this mellow blue colour.",
  "I returned to my bedroom hoping to see more cool visuals, but this time the black fading was less intense then it had been. I decided to turn over for a nights sleep and closed my eyes. I did not see any hypnagogic imagery but I did feel in a deep tranquil state were I felt very comfy. I also noticed that I could no longer feel pressure on my extremities laying in bed. It was as if my fingers and toes had merged with the mattress like they were united together.",
  "To me these effects feel like the first hour into the mushroom trip when all these weird perceptual changes in vision, touch and hearing are creeping up on you. My senses were also more intense than usual.",
  "I remember 3 very vivid dreams the following morning. The thing I love about Calea is that it induces such linear lucid dreams that are so vivid. Each dream feels so real as the colour is as perfect as in the waking state + the mental clarity also."
 ],
 "erowid": {
  "id": "58852",
  "citation": " Mic. \"More than Just Dreaming: experience with Calea zacatechichi (10x extract) (ID 58852)\". Erowid.org. Mar 12, 2007. erowid.org/exp/58852",
  "substance": "Calea zacatechichi (10x extract)",
  "views": "10225"
 }
}
