{
 "title": "Unexpected Trip",
 "author": "Andy-bad",
 "citation": " Andy-bad. \"Unexpected Trip: experience with Cannabis (ID 9923)\". Erowid.org. Jul 11, 2005. erowid.org/exp/9923",
 "substance": "Cannabis",
 "bodyweight": "190 lb",
 "report": "<p>I'm often alone among my peers in that I experience much more intense effects from smoking marijuana than they do.  I often trip from smoking pot, and recently I experienced a very intense trip which was not all pleasurable. </p><p>I went to a friend's house, and smoked maybe six large hits from a blunt.  I began getting extremely high, and stopped smoking after that.  I started feeling very anxious, my heart was pounding and I could feel my muscles spasming irregularly, although not violently.  I went home and tried to relax, but I found it impossible. </p><p>I began to see straight up hallucinations, like a multicolored wave in from of my eyes just morphing and shifting, then neon psychedelic ribbons and spirals.  I felt like I'd eaten a ten-strip of acid.  I'm not sure what happened next but I seemed to be going deeper and deeper into this altered state, and I had trouble fighting it.  Even when I put on some music I found it a little frightening, as well as when I tried to placate myself with a movie; it was as if I didn't understand what these things were anymore.  I kept getting horrible shivers as well, that wracked my entire body, as if I were cold.  I ended up just going to sleep after some struggle, and felt fine in the morning.</p><p>I think some people are hyper-sensitive to weed and maybe should just smoke enough to get a mild buzz, unless they are intending to trip.  I know I'm going to limit my smoking from here on out, and when I feel like tripping, I'll smoke like my friends do, which is without restraint.</p>",
 "year": "2001",
 "id": "9923",
 "gender": "Male",
 "timestamp": "2005-07-11T07:00:00.000Z",
 "views": "3463",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "6 hits",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  }
 }
}
