{
 "title": "An MDMAish, Lovely Time",
 "author": "phy",
 "citation": " phy. \"An MDMAish, Lovely Time: experience with Ethylphenidate (ID 99243)\". Erowid.org. Mar 21, 2013. erowid.org/exp/99243",
 "substance": "Ethylphenidate",
 "bodyweight": "160 lb",
 "report": "<p>We were going to a small-scale freeparty. I took the ethylphenidate dissolved in mineral water and put in a nasal spray bottle. This is a pretty good way of doing it. It's really easy to control doses (you just remember that you have 5mg in one spray, or whatever).</p><p>I also took a bunch of supplements and vitamins throughout the night  chelated magnesium to prevent tooth-grinding, acetyl-l-cartinine and alpha lipoic acid and vitamins with electrolytes to prevent oxidative stress.</p><p>12:30am  initial 20mg of ethyl</p><p>1am  extra 10mg</p><p>2:30am  extra 10mg</p><p>We get to the party and I pretty much immediately drink about half a bottle of wine. I can hardly feel the effects of it and make a mental note to watch how much I am drinking. I actually don't have any more alcohol for the rest of the night. I think the wine does mix in nicely though, giving a little bit of pleasant disorientation. Next time I would try it out with much less alcohol and see how it is.</p><p>I'm having a good time. There is no increase in music appreciation, like with MDMA, but I have enough energy to dance and the music is good anyway. It feels like a natural sort of energy, the energy you have midday rather than twitchy stimulant energy. Very slight bruxism but only slight. Talking to people is easy and fun, although I'm not sure how much of that is just from the wine. Slight increase in heartrate but nothing offputting. Pupils completely blown.</p><p>I sort of regret my last dose because I end up not really going to sleep later on because the stimulant is still hitting me.</p><p>I'm starting to feel slightly bored with dancing... it is fun, but there is nothing in the ethyl that is particularly binding me to it, so I get out a joint and share it with three other people. This adds a really lovely dimension to it and at this point I decide that this is a great combination and I will definitely do it again.</p><p>If I smoke cannabis on its own it tends to just make me throw up and pass out, so I think I only like it combined with stimulants. I don't get any nausea this time which is nice, I still have dancing energy and now the music sounds really, really good and dancing feels really good. It's nearly 4am and I realise that half the people have left which makes me sort of sad because I know there is only an extra hour left now and I still feel like I could carry on for at least a few more hours.</p><p>The combination feels sort of like an MDMA high but there are some differences. Music doesn't feel as good as on MDMA  MDMA makes it feel like the music has gone inside me, this combo just makes me feel like the music has bound to me. There also isn't such a strong compulsive need to dance  dancing feels really good, but I feel like I still have control. In some ways I prefer this to MDMA, although maybe that is just wishful thinking.</p><p>I start getting these feelings like I want to write long letters to lots of people that I know. It's an empathogenic thing but dissimilar to MDMA. With MDMA I just feel wordless, homogenous love for people but don't really have much to say to them; now I feel like I want to write to them and go into detail and really discuss things. I actually feel sort of surprised when this feeling fades in the next hour because it felt so real.</p><p>Getting towards 5am and I feel like maybe this is a slight comedown coming on. The music still feels great but the party has shrunk dramatically and half my friends have left. I am starting to feel the opposite of the feeling of wanting to write letters.</p><p>I feel sort of very alone, sort of in a sad way but also in the way that I am alone with myself and that makes it OK. The party ends and I go for a walk by myself through the surrounding fields. It is very quiet and dark. I stand looking down at the city, saying nothing, just with myself for about half an hour. I feel sort of sad and sort of psychologically tender but also like I am touching some feelings inside that I don't usually touch. I sort of wish I was on MDMA so I could touch these feelings without them hurting, because they kind of hurt. This feeling reminds me of anxious depression. It is interesting, but overall unpleasant.</p><p>Eventually I go home. I try to find someone to talk to online but nobody is there at 6am. I take some melotonin and some 5-htp  although the ethyl shouldn't be serotonergic, I still feel sad enough to want it. Even with the melotonin I find it very hard to go to sleep and lie awake for about an hour, but I don't feel bored so it is OK. Maybe I get to sleep around 7:30, 4 hours after the last dose of ethyl.</p><p>I got maybe two hours of sleep but feeling pretty good. I was expecting to feel a lot worse the next day but actually I am totally fine apart from being sleep-deprieved. The sad feelings have gone.  I will definitely do this combo again- closeish to MDMA but more subtle and natural and I would also feel comfortable to doing this more often (I try to limit MDMA to once every two or three months).</p><p>So yeah I would do it again  but I do think that all the antioxidants probably helped me avoid much of a comedown. I also don't think I need more than 50mg in a night if my aim is to just stay energised and chatty. Also I wouldn't take my last dose within five hours of when I plan to go to sleep, although I guess maybe smoking a LOT of weed might knock me out.</p>",
 "year": "2012",
 "id": "99243",
 "gender": "Female",
 "age": "22",
 "timestamp": "2013-03-21T07:00:00.000Z",
 "views": "3155",
 "dose": {
  "0": {
   "time": "DOSE: T+ 0:00",
   "amount": "20 mg",
   "administration": "insufflated",
   "substance": "Ethylphenidate",
   "form": "(liquid)"
  },
  "1": {
   "time": " T+ 0:30",
   "amount": "10 mg",
   "administration": "insufflated",
   "substance": "Ethylphenidate",
   "form": "(liquid)"
  },
  "2": {
   "time": " T+ 2:00",
   "amount": "10 mg",
   "administration": "insufflated",
   "substance": "Ethylphenidate",
   "form": "(liquid)"
  }
 }
}
