{
 "id": 9931,
 "title": "Tearing Assunder the Veil Of Reality",
 "date": {
  "submission": "2000-09-14T07:00:00.000Z",
  "experience": "2000-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Bryan Christian",
  "gender": "Male",
  "weight": 113
 },
 "dose": [
  {
   "time": "0",
   "amount": "7 hits",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  }
 ],
 "report": [
  "This is about the first time I was REALLY stoned. The first few times I smoked, I didn't feel much but maybe a little giddy. Since this experience, I have gotten stoned many times, but never quite like this.",
  "I was at a friend's house, and we were just talking and having a good time. I suggested we get some weed, so I sprung for a dimebag. The room was lit only with a blacklight and the glow of the TV. I smoked a lot, I would guess about seven hits. I got up off the couch and I felt like I was swimming. I could barely walk. After that, things get hazy, but I left the apartment and went down to mine.",
  "I laid down on my bed and put on my headphones and 'Tomorrow Never Knows' by the Beatles. I was instantly tranported into another world. It vaguely felt like India, but like a desert with strange people with weird clothes walking around in the sand. I closed my eyes and let the music talk to me. I could see the face of John Lennon, and he seemed to be telling me what to do. I heard (or felt) a voice say, 'Music is the language of the universe'. I was thrown into deep, reflecting thought. The line of the song, 'Listen to the color of your dreams' had a similer effect.",
  "The song was sort of fast, so everything in my 'mind-movie' was, like, sped up. Things moved very fast. I  got the feeling that I had entered a new world. I could 'see' the music, and be inside the mind of the artists. I felt like I was taking a leap of faith off a cliff, yet overwhelming peace. Overall, it was a 'it's OK' feeling, like no matter what happens, It's gonna turn out fine.",
  "It felt as if a veil was lifted off my mind, and I could see the universe as a whole, and see beauty in everything. I knew that the universe is one, bound together by music and love. I knew that I would always see the world from a slightly different perspective, perhaps a higher one. Since then I have seen order in chaos, and chaos in order. As a musician, I have changed dramatically. Overall, I feel a hightened awareness, and a greater connection with the universe, the earth, and mankind."
 ],
 "erowid": {
  "id": "589",
  "citation": " Bryan Christian. \"Tearing Assunder the Veil Of Reality: experience with Cannabis (ID 589)\". Erowid.org. Sep 14, 2000. erowid.org/exp/589",
  "substance": "Cannabis",
  "views": "6123"
 }
}
