{
 "id": 9939,
 "title": "Worst Substance I've Ever Ingested Willingly",
 "date": {
  "submission": "2007-06-16T07:00:00.000Z",
  "experience": "2006-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "El Bizzo",
  "gender": "Male",
  "weight": 68
 },
 "dose": [
  {
   "time": "0",
   "administration": "sublingual",
   "substance": "Naloxone",
   "form": "pill / tablet"
  },
  {
   "time": "0",
   "administration": "sublingual",
   "substance": "Pharms - Buprenorphine",
   "form": "pill / tablet"
  }
 ],
 "report": [
  "I'm one of those people who likes to try different drugs - always on the lookout for something new. Since I started experimenting two years ago, I've had experiences with Pot, LSA, Ecstasy, Nitrous, Mushrooms, and Cocaine. The worst side effects I've had from any drug up until now are a bad mushroom trip, panic attacks when using pot & alcohol at the same time, and the mildly unpleasant muscle aches & nausea caused by LSA. The after effects of Buprenorphine are by far the worst thing I have ever experienced from a chemical I willingly ingested. Here's what happened -",
  "I had been passively searching for some blow for about three weeks, with no success. My normal supplier of the more common drugs owed me a favor, and he knew I was trying to get some blow - although he didn't have any, he asked me if I was still interested in trying an opiate (we had talked and agreed in the past that both of us wanted to try opium someday). He didn't have any opium, but he said that he'd gotten a hold of some Bupes, and explained that they had opiate-like effects. I told him I might be interested, but wanted to read up on it first.",
  "I read a few pages online, and decided I might as well try some. I drove down to his house that afternoon and we chatted for a while, and he showed me the stuff - orange hex-shaped tabs with N8 stamped on one side, and a sword on the other. He broke one in half and gave it to me in a plastic bag, mentioning that they tasted like oranges. I left his place shortly after that, and on the way home I decided that I would wait until later that night to try it - I was expecting it to make me tired, and thought it would probably be better to do it close to bedtime.",
  "11:00 PM  I cut the half-tablet into thirds, one of them looked slightly larger than the other two, so I decided to take that one, if I liked it, Id take the other two at once sometime in the future. I stick the piece I had decided to take under my tongue and hold it there until the taste of oranges fades from my mouth. It tastes just like orange cool-aid.",
  "T+0:10 -I feel different, a little more relaxed and maybe a little high. I decide to turn off the lights and watch a dvd.",
  "T+0:30 -Normally I would have fallen asleep by now, Im in a very relaxed state and I feel almost drunk. I dont recall feeling any sort of euphoria, or any feeling of wow this stuff makes me happy, as I normally do with most drugs. I remain laying in bed, essentially in a trance, watching the dvd for a while.",
  "T+2:00 I sit up in bed and realize that Im very dizzy. I take a few sips from a bottle of water, and turn over and try to sleep. I toss and turn for a while, and I may have dozed off.",
  "T+3:00 Its now 2 oclock in the morning and I realize Ive got to piss. I stagger down the stairs and somehow manage to make it to the bathroom without falling. Its hard to pee when Im on this stuff, but I finally got enough out to be comfortable, and climbed back up to bed. I woke up a few times that night.",
  "T+7:49 I wake up and feel pretty cold, so I throw another comforter on the bed. Im still extremely dizzy, and am pretty annoyed because Im supposed to be at work at 9AM.",
  "T+8:45 My alarm clock goes off, I turn it off and sit and debate for a minute or two on whether to get up and take a chance (as Im still very dizzy) or go back to sleep for an hour and just show up late for work. I set the alarm for 8:45 and try to sleep again, but I gave up and walked downstairs into the living room. My head is pounding and Im still pretty dizzy, it feels very hot in the living room. After looking at the thermostat, I realize its its a comfortable 72 degrees in the living room, and that it feels hot because I was actually freezing cold  Its winter and my bedroom gets mighty cold when I sleep with my door closed  which I had done that night, and Im sure the sedative effects of the drug were probably lowering my body temp as well.",
  "I put on a sweatshirt and lay on the couch for a while. I feel nauseous enough to grab a bucket out of the closet and set it on the floor next to me. I called work and reported that I had the flu and I might be out the next day as well.",
  "I lay on the couch until about five oclock, and puked six or seven times that day. I couldnt even hold water down until about 4pm. The next day I still felt like I was medicated, but the nausea was all gone and I was able to go to work. I didnt feel completely back to normal until the day after that. I gave the rest of the pill back to my guy and told him I never wanted to see the stuff again.",
  "All in all, Id say Buprenorphine is absolutely fucking worthless. I certainly wont be doing it ever again."
 ],
 "erowid": {
  "id": "58915",
  "citation": " El Bizzo. \"Worst Substance I've Ever Ingested Willingly: experience with Buprenorphine (ID 58915)\". Erowid.org. Jun 16, 2007. erowid.org/exp/58915",
  "substance": "Buprenorphine",
  "views": "32054"
 }
}
