{
 "id": 994,
 "title": "So High for So Long",
 "date": {
  "submission": "2007-04-16T07:00:00.000Z",
  "experience": "2002-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Amelia",
  "gender": "Female",
  "weight": 48
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "number": "1",
    "unit": "tablet"
   },
   "administration": "oral",
   "substance": "Ephedrine"
  },
  {
   "time": "0",
   "amount": "repeated",
   "administration": "smoked",
   "substance": "Cannabis"
  }
 ],
 "report": [
  "A few of my friends and I were in the car on the way to smoke a few bowls at another friend's house. We stopped at a gas station to get drinks, and k decided to buy some yellow jackets. I'd had bad experiences with yellow jackets in the past, but I decided to pop one anyway, just to see how the ephedra extract would react with the weed. By the time we lit up our first bowl, about 25 minutes after dosing, I was already starting to feel the effects of the yellow jacket. My scalp was tingling a little, and I was beginning to get really fidgety.",
  "After the four of us had finished off two or three bowls, I was feeling fantastic. I was very high, and it felt wonderful to move around. This was one of the longest highs that I have ever experienced. I didn't slip into the relaxed, silently contemplative part of the high for hours; I laughed with my friends, and we went outside to play football, pausing our game occassionally to smoke a bowl. ",
  "Eventually, we went back inside and k and I played gran tourismo 3, a racing game.  This was one of the strangest, most exhilirating and terrifying experiences I've ever had. When I was playing the game, I felt my peripheral vision diminish, I felt the force of the car behind me, I really felt like I was behind the wheel of the vehicle. I reached the point where it was no longer fun, but it was as if something was making me play. I couldn't bring myself to turn away from it, even though the game was beginning to make my head spin. All I could do was laugh like a madwoman, and grip the controller until my fingers ached. I could feel myself clenching my teeth, and I was beginning to shiver, even though the room was not cold by any means. I had to beg k to get up and turn off the game, because I really felt that it was going to make me vomit and/or go completely insane.",
  "After the video game nightmare, we were all sitting around, pretty wired and still very high, and I began to feel like I was rolling, although the sensation wasn't very intense. That was probably the high point of the experience.",
  "It was all downhill from there.  About 7 or 8 hours (no lie!) into the experience, I reached a point where I no longer wanted to be stoned, and this coincided with the yellow jacket crash. My heart had been pumping extraordinarily fast/hard the whole night, and I was beginning to experience chest pain. I was also shaking uncontrollably; I'd sit down with my feet on the ground, and put a little weight on the ball of my foot, and my whole leg would start quivering, as if it couldn't sustain its own weight. Every time I stood up, I'd have these terrible head-rushes, along with some diziness.  I didn't want to talk to anyone; I just wanted to lay down. It took me at least 3 hours to fall asleep that night, and I woke up the next morning feeling awful. My body was exhausted and my head felt like it weighed a ton.",
  "All in all, it was not a bad experience, and I'll probably do it again. The benefit of an extremely prolonged high is worth the unpleasant come-down. Next time, however, I'll make sure I can stay in bed the following day."
 ],
 "erowid": {
  "id": "12879",
  "citation": " Amelia. \"So High for So Long: experience with Ephedrine & Cannabis (ID 12879)\". Erowid.org. Apr 16, 2007. erowid.org/exp/12879",
  "substance": "Ephedrine & Cannabis",
  "views": "12437"
 }
}
