{
 "title": "Exceeded Expectations",
 "author": "Maxwell",
 "citation": " Maxwell. \"Exceeded Expectations: experience with 6-APB (ID 99434)\". Erowid.org. Apr 4, 2013. erowid.org/exp/99434",
 "substance": "6-APB",
 "bodyweight": "140 lb",
 "report": "<p>I had greatly been anticipating this night for two weeks when my package finally came on a Thursday afternoon. I had scoured the internet for days learning as much as I could from other people's experiences, trying to surmise from the ones I deemed most credible what the qualities and effects of this chemical would be.</p><p>I must say I felt a certain degree of trepidation approaching this experience due to the numerous reports of people being sold cathinones and other stimulants, marketed as 6-apb or under the misleading pseudonym, Benzo Fury.  My fears where somewhat allayed when I opened the small vacuum sealed bag and peered in at a small mound of light-tan, clumpy powder, an appearance consistent with the most credible experience reports I had read. I proceeded to weigh out two capsules, each 118mg +/ 2mg, one for me and one for my friend hereafter referred to as J.</p><p>I had, previous to this night, experienced mdma, lsd, psilocybin, 251-nBome, 4-aco-dmt, dpt, amt, methedrone, mephedrone, allylescaline, cocaine/crack, cannabis, kratom, ephedra, salvia, amphetamine, and methylphenidate. Needless to say I have had many experiences with both amphetamines and substituted phenethylamines both common and relatively obscure. I consider myself a very cautious drug user especially when it comes to research chemicals; I research thoroughly the effects and dosages of every drug I take making sure to dose appropriately and precisely, I always take new drugs in the safety and comfort of my own home with sober roommates around, and in the case of mdma like stimulants, I load up on 500mg magnesium an hour prior to initial ingestion shortly after a medium sized meal and leave myself at least two free days afterwards to recover fully before returning to my weekday responsibilities. Ideally I would like to load up on 5-htp before and after but I have not yet found anywhere that sells it.</p><p>T+0: 6:30 rolls around Thursday night and J and I are both ready to try this new drug as we are both fond of euphoric stimulants of this class. We take our capsules with a glass of water and a protein bar and proceed to drive the ten minutes that it takes to get back to his place.</p><p>T+0:30: Back at Js I start to notice a mild amount of stimulation, very faint but I know now that I have definitely left baseline. We get out the guitars and jam out for about 30 minutes, my mood increases steadily as does the stimulation.</p><p>T+1:00: We stop playing music and go outside to smoke a cigarette. Waves of pleasure and euphoria roll over me, each one getting more intense then the last. Still markedly lucid and relaxed though definitely felling the stimulant edge, enjoying the cigarette I am smoking immensely. We decide a walk is in order to get gum and water from the nearby corner store so we depart from Js house.</p><p>T+1:30: Feeling the full affects of the drug after walking for half an hour. WOW! Feels like some of the really clean molly that I have had. I feel unbelievably clear headed as waves of the most incredible euphoria wash over me. I am immersed in incredible happiness, the kind of profound, crystalline, soul deep happiness that I feel when I take mdma. Its a feeling of acceptance of things as they are and people for who they are. I felt a complete sense of wellbeing and was overjoyed to be walking outside in that cool Portland night.</p><p>T+2:00: At this point in our adventure we arrive at a bookstore because J had to void his bowels. I didnt think it possible but in the past half an hour I climb even higher than before.  I reach what is to be the peak of the experience at approximately 8:45, two hours and fifteen minutes after ingestion. This peak lasts for the next four and a half hours.</p><p>T+3:30: J and I arrive back at his place after our very pleasurable walk. He excuses himself to go talk to his girlfriend and I sit down in his living room to play guitar. This superb chemical made playing the guitar exceptionally engaging and I felt my creativity was greatly enhanced. It was a huge emotional release for me and I have rarely been able to play like I did that hour with such focus and dexterity.</p><p>T+4:30: My friend is done talking to his girlfriend and I rejoin him in his room to smoke some weed. The cannabis potentiates the psychedelic effects of the drug considerably because after several bong rips I began to get visuals; a unique breed of warping shapes and distortions mostly noted in the peripherals of my vision. Still getting intense waves of euphoria throughout my body. I am in a great headspace.  For the next hour we take turns sharing music with each other and talking about our past. Conversation flowed very naturally and a great degree of satisfaction was derived from simply communicating with another human being. Music appreciation was GREATLY enhanced.</p><p>T+5:30: It is now midnight and the waves are beginning to diminish in intensity but even so I am still VERY euphoric and talkative. Continue to smoke more marijuana, greatly enjoying just relaxing with some blankets, a cat to pet, and a good friend to talk to.</p><p>T+6:30: Still getting waves of euphoria but high tide has definitely past and each wave gets a little less pronounced. We put on a movie and kick back, waiting to burn off the excess stimulation until sleep can be achieved.</p><p>T+7:00: Feel what seems to be the last wave and know that the main body of the experience is at an end. Cannot believe how fast the last 7 hours went by, but time didnt have much meaning during the experience. I often on phenethylamines feel that time pasts simultaneously slow and fast. I dont feel particularly apathetic or sad just physically tired and stimulated at the same time. Sleep comes at 3am with a couple of bowls of good grass and a warm blanket. Slept well for a good nine hours.</p><p>After-notes: The comedown was very mellow and easy, not abrupt like mdma tends to be for me. I noted a slight headache after awaking in the morning but this went away after a cup of coffee, a big bowl of oatmeal, and 3.5g of Bali Kratom. Was tired physically for a few hours (possibly correlated more with the kratom I took then the night shenanigans of the night before.) but this fatigue disappeared by noon-time and I felt back to normal again, enough so to help my friends move all their boxes and furniture into a new house.</p><p>I am writing this report on Saturday, two days after my trip and I feel my usual self. No depression or apathy noted whatsoever. I had a very good time with this drug and will continue to use it in the future (no more than once a month of course.) I actually preferred this to all of my mdma experiences. The dose I took was a good medium sized dose for me but I think I could comfortably take another 50mg. I think 6-apb is equally suited to staying inside with friends and simply enjoying the company of others as it is to going out to a club or bar and socializing in public. I have some 5-apb that was included with my order and a report on that is forthcoming.</p><p>My overall assessment is that 6-apb is a great legal alternative to mdma, especially given the quality of most street rolls and molly available here in the US. The length of the trip was a definite bonus as was the mellow comedown.  I hope eventually studies are done that fully assess the toxicity and pharmacological properties of this chemical. The more you know the better. Cheers.</p>",
 "year": "2013",
 "id": "99434",
 "gender": "Male",
 "age": "18",
 "timestamp": "2013-04-04T07:00:00.000Z",
 "views": "6379",
 "dose": [
  {
   "time": "DOSE: T+ 0:00",
   "amount": "120 mg",
   "administration": "oral",
   "substance": "6-APB",
   "form": "(capsule)"
  },
  {
   "time": " T+ 4:30",
   "amount": " repeated",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": ""
  }
 ]
}
