{
 "title": "All I Can Say is WOW!",
 "author": "Biz",
 "citation": " Biz. \"All I Can Say is WOW!: experience with DXM (ID 9943)\". Erowid.org. Jul 11, 2005. erowid.org/exp/9943",
 "substance": "DXM",
 "bodyweight": "200 lb",
 "header": [
  [
   "DOSE:",
   "700 mg",
   "oral",
   "DXM",
   "(liquid)"
  ]
 ],
 "report": "<p>All I can say is WOW!!! I can't believe how wasted I was off of store bought cough syrup. After a week of research about DXM I finally decide to give it a go. I went and purchased an 8oz bottle of Robitussin Maximum Strength Cough at the supermarket. When I got home I chugged the whole thing in one shot and chased it with a glass of lemonade to kill that god-awful taste. That didn't work so I brushed my teeth. That didn't work completely so I chewed a piece of gum and finally managed to kill that taste. I though slamming the bottle down quick would be hard but it went down surprisingly smooth. Its the after-taste and smell that I could deal with.</p><p>Well about an hour later I felt something coming on. I went down to my basement which is hooked up with a nice stereo, a bar, colored lights, and candles and such. I put on a disc full of MP3's with like 70 songs on it so I wouldn't have to get up. Lit some candles and got my dog to come hang with me.</p><p>The music was sounding really great. Cranking it up loud made it sound even better. The bass was reverberating through my body and it felt really nice. That part of the buzz was the most enjoyable.</p><p>Next phase felt like anesthesia. Kind of like my distant memories of PCP. A numbing sensation in the face. Not unpleasant, just there. Walking became rather clumsy at this point as I noticed while going outside to smoke a cigarette. I was totally uncoordinated and bouncing off the walls. Definitely could not drive, no way! My vision was also screwed up at this point. I was seeing double, which wasn't so bad except that I could find my lighter where I left it and watching TV was a chore. Closing one eye helped put things back in focus but I couldn't keep that up for long. Mostly just kept my eyes shut. The closed eye visuals were spectacular. Bright vivid colors of kaleidoscopic melting and oozing. Starbursts and hyperspace type hallucinations. Anything I thought of, I could visualize at will. There wasn't much of a mental thing going on which was nice. I was in control of my mind. When I do shrooms I sometime have panic episodes, but the DXM wasn't like that at all. There were no thoughts of impending doom, just a mellow, laid-out kind of medicated feeling.</p><p>After about a few hours of the peak I mellowed some but was feeling the physical effects until I went to sleep 13 hours later.</p><p>Overall I liked the DXM buzz. I will definitely do it again with a slightly increased dosage. If I can I will try to find it in pill form because that shit is fuckin' nasty. Also, just a side note, I tried to have sex with my wife the next morning but failed to reach orgasm. Erection was not a problem, but my Johnson seemed to be numb and therefore I didn't feel a thing. This was never a problem before so I believe it was due the Robitussin. She didn't mind when I slammed her for 15 minutes, but it was frustrating for me. Another note, the DXM buzz is very hard to play off in front of people you don't want to know what you are doing. I didn't want my wife to know I was wasted on cough syrup so I told her I was drunk. That explained the clumsiness and speech problems.</p><p>Peace, BIZ</p>",
 "year": "2001",
 "id": "9943",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2005-07-11T07:00:00.000Z",
 "views": "28702",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "700 mg",
   "administration": "oral",
   "substance": "DXM",
   "form": "(liquid)"
  }
 ]
}
