{
 "title": "Not My Cup of Tea",
 "author": "Venus In Furs",
 "citation": " Venus In Furs. \"Not My Cup of Tea: experience with Gabapentin, Methadone & Alprazolam (ID 99472)\". Erowid.org. Apr 22, 2013. erowid.org/exp/99472",
 "substance": "Gabapentin, Methadone & Alprazolam",
 "bodyweight": "180 lb",
 "header": [
  [
   "DOSE:",
   "5 mg",
   "oral",
   "Methadone",
   "(daily)",
   "",
   "1800 mg",
   "oral",
   "Pharms - Gabapentin",
   "(capsule)",
   "",
   "2 mg",
   "oral",
   "Pharms - Alprazolam",
   "(pill / tablet)"
  ]
 ],
 "report": "<p>I decided to contribute my experience with Gabapentin because  I found that there isn't a lot of information on its recreational use. Or, if there is, it's rather contradictory or vague. I don't know if my experience will be any more helpful but here goes!</p><p>First, I'll preface with the obligatory history. I am a former Heroin and Methamphetamine addict. I am currently on Methadone and tapering off at 5mg. I also take a couple sleeping pills, an antidepressant and an anti anxiety pill. I am pretty well versed in most drug-related fields and I always do my research before trying something new.</p><p>I've been tapering off Methadone for over a year now and while the withdrawals are much more tolerable than Heroin, I've gotten really worn down with the constant symptoms and am starting to get desperate for any type of high or relief. I raided my family members medicine cabinets (something I'm not proud of) and came across Gabapentin. After doing some research, it sounded like it was worth a try so I took 6 300mg capsules to try the next day (today).</p><p>10:00 AM- Wake up, take 5mg Methadone. Eat cereal.</p><p>11:00 AM- Swallow the six 300mg capsules of Gabapentin. I read that it takes an hour or two to kick in so I lay down and play games on my phone, watch TV, etc.</p><p>1:00 PM- I start to notice my vision is getting blurry and my stomach is growling so I get up to get something to eat and that's when it hits me. My balance is completely off, I can barely walk a straight line. I feel light, like I'm floating and have no control over my body. I'm in a haze. This is definitely more of a 'trip' than a 'high'. My sense of touch is enhanced: petting my dog feels great. I also notice my eyes are glassy and my pupils are pin sized. I start to feel paranoid that someone can tell I'm fucked up and I don't know how to conceal it. It's beyond my control. So I wait until the coast is clear and make myself a grilled cheese. Eating is difficult. I'm quite dizzy and on the verge of nauseous.</p><p>2:00 PM- I don't like these feelings. It almost feels like the DXM trips I used to do as a kid, where I'm in an alternate universe and almost outside of my own body. This is not what I expected at all. I decide to just lay down and try to sleep this part of the trip off. I have pretty nice closed eye visuals as I drift off.</p><p>4:00 PM- I wake up from my nap and am still feeling wobbly and disoriented, but not quite as intense as before. I go about my daily chores with as much composure as I can muster. I wonder if maybe the dose I took was too much. Dinner comes and goes.</p><p>8:00 PM- I take my daily dose of 2mg Xanax and finally start to feel normal again. I am thankful it's over!</p><p>What I was lead to believe about this drug was that it was similar to GHB or MDMA. I read that people felt a combination of speedy and sedated (the main thing that intrigued me, given my past vices). I'm aware that everyone reacts to substances differently but I experienced NONE of these things. I didn't have high hopes for it anyway but it was nothing like what I expected. It wasn't a train wreck or a bad trip, just not my cup of tea. I do not think I'll be trying this drug again.</p>",
 "year": "2013",
 "id": "99472",
 "gender": "Female",
 "age": "24",
 "timestamp": "2013-04-22T07:00:00.000Z",
 "views": "9865",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "5 mg",
   "administration": "oral",
   "substance": "Methadone",
   "form": "(daily)"
  }
 ]
}
