{
 "id": 9952,
 "title": "A 'Television' In My Mind",
 "date": {
  "submission": "2002-02-05T08:00:00.000Z",
  "experience": "2001"
 },
 "author": {
  "name": "Virgin Psychonaut",
  "gender": "Male",
  "weight": "135 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "2 seeds",
   "administration": "oral",
   "substance": "H.B. Woodrose"
  },
  {
   "time": "0",
   "amount": "T+ 0:40",
   "administration": "1 seed",
   "substance": "oral"
  },
  {
   "time": "H.B. Woodrose",
   "amount": "",
   "administration": "T+ 1:20",
   "substance": "1 seed"
  },
  {
   "time": "oral",
   "amount": "H.B. Woodrose",
   "administration": "(ground / crushed)",
   "substance": "T+ 2:20"
  },
  {
   "time": "2 seeds",
   "amount": "oral",
   "administration": "H.B. Woodrose",
   "substance": "(ground / crushed)"
  }
 ],
 "report": [
  "First off let me say this was my first experience with any form of psychedelic. I had no clue what to expect, other than what I had heard from a friend of mine.",
  "Preparation:",
  "I took a nail file and shaved off the outer coating of the seeds until it was light brown and somewhat shiny. For the last 3 seeds I decided to pulverize them hoping they'd take effect sooner.",
  "At 6:20 P.M. I took my first two seeds. It was hard to chew them with braces. They're rock hard.",
  "At 7:00 I took another seed. I was only planning to do three seeds for my first time.",
  "Fifteen minutes later I began to feel a little floaty, but it went away. I was bored as hell and was getting somewhat impatient. I killed about a half-hour playing Quake on my computer. I was approaching the hour and a half mark and felt nothing. Frustrated, I prepared another seed, pulverizing it this time, and ate it.",
  "Waited a little. Still nothing. I prepared two more seeds, but didn't eat them yet. I found a good movie on TV. At 9:20 I still felt nothing. I thought I had a weak batch. My friend was feeling stuff with one seed. I'd had four. So I took the last two.",
  "Slowly the effects came on. Extremely subtle. I just laid down and stared at the TV for an hour. I think I blinked once or twice that whole time.",
  "Nature called. By this time everyone in my house was asleep. Total silence. This was about when I first witnessed visual distortions of any kind. The bathroom is an extremely small, and monotonously lit. On the wall that I was facing there is a small painting of a plant of some kind. I stood there and stared at it for a while, then I noticed that parts of the frame was starting to disappear into the surrounding whiteness.",
  "I spent the next two hours in my room listening to electronic music and creating strange patterns out of little spheres which appeared just above the carpet. This kept me busy for a few hours. At around 2:00a.m. I decided I should get some sleep. I had read that most people found it easy to fall asleep on LSA. However I was still peaking.",
  "I think the first mistake I made was to turn the music off.",
  "The mental effects of LSA were like turning on a television in my mind, constantly feeding me with totally random thoughts and images. With music playing I didnt pay much attention to the television. When my environment was totally silent I wasforced to watch this television. I couldnt turn it off, and trying only made it worse. Especially while peaking. For the next two hours I was convinced that I was going insane.",
  "After an hour I could tell that the effects were diminishing, but my mind was still racing with random thoughts. Ever 30 minutes or so I got out of bed and walked around the house in an attempt to re-orient myself. I still felt I was completely alone. I had no concept of the outside world.",
  "At around 4:00a.m. I managed to fall asleep. I woke up at 7:30a.m. and it felt like last night was all a dream and that everything was going to be okay. I decided to go watch some more TV.",
  "A half hour later I began to feel like I was still trapped in a dream. I had no recollection of the other day before the trip, and I had trouble convincing myself that I was back to reality. Everything seemed different. It wasnt until about 11:30 in the morning that I suddenly felt normal again. The intense fear I felt the other night seemed almost enjoyable.",
  "That afternoon I began to feel slightly nauseous but I never vomited.",
  "I am debating whether or not to take the seeds again. If I do I will most definitely not take them at night or alone. I will also have some soothing music ready if I do start feeling anxiety. I found that classical music works best. The trip was not as visual as I had expected, though that wasnt necessarily a bad thing. I had to concentrate to make things happen, and it took practice but I got better at it."
 ],
 "erowid": {
  "id": "5897",
  "citation": " Virgin Psychonaut. \"A 'Television' In My Mind: experience with H.B. Woodrose Seeds (ID 5897)\". Erowid.org. Feb 5, 2002. erowid.org/exp/5897",
  "substance": "H.B. Woodrose Seeds",
  "views": "14017"
 }
}
