{
 "title": "Good Vibes on the D",
 "author": "Watsonator",
 "citation": " Watsonator. \"Good Vibes on the D: experience with 4-HO-DET (ID 99551)\". Erowid.org. Apr 19, 2013. erowid.org/exp/99551",
 "substance": "4-HO-DET",
 "bodyweight": "189 lb",
 "header": [
  [
   "DOSE:",
   "25 mg",
   "oral",
   "4-HO-DET",
   "(powder / crystals)"
  ]
 ],
 "report": "<p>Alright, first off Ill give you a little background information. Im 20 years old at the time of my first 4-HO-DET experience and I have a decent amount of experience with psychoactives and hallucinogens. Ive had many prior experiences on 2C-I, Ecstasy, 2C-E, 2C-B, Marijuana, Spice, DXM, Nutmeg, Salvia, DPH, LSA, Wild Dagga, Dramamine, Percocet, Suboxen, Klonopin, Amanitas, Nitrous, Alcohol, Kava Kava, Syrian Rue, Damiana, Caffeine, Adderall, Nicotine, and Ritalin.</p><p>I went online to a reliable source to check out some research chemicals and came across 4-HO-DET. After doing some research, (not much information available on this drug), I decided it was something I was interested in experimenting with. I ordered 250mg for a little over $30 and within a week it was in my mailbox. I read online that the normal dose was between 10-25mg, so I weighed out a couple 25mg doses on my scale and filled 2 size 1 gel caps with the off-white/tannish powder. I was very excited because later that same day my girlfriend and I were going to Metal Feast with a bunch of friends to see some local bands play and for the all-you-can-eat Chinese food. We decided it would be the perfect setting to experience our newly found hallucinogen. The experience is as followed:</p><p>6:00PM  Me and my girlfriend arrive at Metal Feast and we both take our 25mg dose in the car before going in. I down my capsule with a bottle of Mountain Dew.</p><p>6:25PM  We find a table and grab ourselves a plate of Chinese food. My girl is starting to feel the first effects which she described as wavy. At this point my buddy C comes up to me and asks me what we took. As I told him he got very interested and asked if he could have some as well. We went out to my car quickly and I weighed out another 25mg dose for him as well. (Luckily I brought everything with me).</p><p>6:45PM  I start to feel the first effects. Eating feels amazing. At this point my girl is smiling a lot and playing with a trippy visualization app on her phone. Shes very focused and giddy. We both experience a sense of well being and warmth. No noticeable visuals yet though for me, though there is some slight stomach discomfort, but not very noticeable. She however has calming visuals and the room starts morphing in her vision. She describes the visuals as somewhat blinding.</p><p>7:00PM  C starts to feel the effects of his dose. He also notices a feeling of warmth and comfort as well.</p><p>7:15PM  All 3 of us have hit the peak. Definite +3!!  One of the bands is playing and the visuals are intense and are intertwined with the music. I can feel the beat of the drums and guitar pulse throughout my body. I notice the floor swirling beneath my feet and it feels like Im standing on water. The walls look as though theyre melting as well. Still have a very relaxing warm feeling throughout my whole body.</p><p>8:00PM  Visuals are still intense and I feel a large sense of creativity. Thoughts rush through my head like water in a river. I could probably write a book based on the thoughts and visuals that were going on in my head. C disappears at this point and we dont reunite with him until later on in the night. My girl and I stick together however, since we both promised to use the buddy system while we were tripping. We stepped outside for a cigarette. The neon sign on the front of the venue shined bright and had a glowing aura emanating from it. Everything seemed right with the world. People would come, strike up conversations with us, then leave, then more people would come and talk with us, then leave, and so on. It felt just like you see in the movies!! Its hard to explain the exact feeling.</p><p>8:30PM  One of our friends, M comes up to us and tells us that C is sitting at a table, head in his hands having philosophical thoughts. Me and my girl decide to go find him, however for some reason we cannot. We start going on a search for C.</p><p>8:45PM  We finally find C, who is tripping out and loving it! He describes the feeling as a combination of mushrooms and LSD, yet somewhat milder. We sit, talk, and listen to music for a while. I find it very easy to think of topics to talk about, whereas with marijuana Im so inside of my own head that I normally cant think of anything to say.</p><p>9:30PM  My favorite band takes the stage and I decide its time to start a mosh pit. So everyone sets up the Wall of Death, where one half of the moshers go to one side of the room and the other half go to the other side and then when the breakdown starts, both side go ham and clash in a giant pit of madness. I found this very enjoyable and moshing allowed a lot of the energy that was building in my body to be released. I felt like I was in the middle of an intense riot. I also noticed that I didnt feel any pain from getting knocked around in the pit, which was also a plus.</p><p>9:45PM  Both me and my girl both feel the effects starting to fade. The comedown is smooth and mellow however. It feels relaxing and unlike other drugs, isnt a complete trainwreck. The music still feels incredible and the energy from the mosh pit is exhilarating.</p><p>10:00PM  Were both almost at baseline again. I still feel warm on the inside but most visuals have faded. My girl says that she no longer feels any effects.</p><p>10:30PM  All effects have faded in both of us. We are now sober and back to reality. C however is still tripping and feeling the full effects. He is having many philosophical thoughts and Im enjoying the crazy conversation Im having with him.</p><p>11:00PM  Me and my girl decide to head home. Driving wasnt a problem since I was completely sober by that point. I also didnt notice any insomnia when I got in bed either, which I normally experience with other hallucinogens like those of the 2C family.</p><p>All in all, I loved this tryptamine. It gives amazing vibes and clear, interesting thoughts. Do your research beforehand though and make sure youre ready for the trip youre about to experience. Dont go in blindly. I can say though that I will definitely be trying this again!! The trip lasted about 4 1/2 hours total, however C didnt comedown until around 1AM, about 6 1/2 hours after he took his dose. Hope this experience report helps. Happy tripping and keep it safe and fun!!</p>",
 "year": "2013",
 "id": "99551",
 "gender": "Male",
 "age": "20",
 "timestamp": "2013-04-19T07:00:00.000Z",
 "views": "1398"
}
