{
 "title": "Did I Really Just Do That?",
 "author": "Infectious",
 "citation": " Infectious. \"Did I Really Just Do That?: experience with Methylone & 3-MeO-PCP (ID 99589)\". Erowid.org. Mar 21, 2013. erowid.org/exp/99589",
 "substance": "Methylone & 3-MeO-PCP",
 "bodyweight": "125 lb",
 "header": [
  [
   "DOSE:",
   " repeated",
   "IV",
   "Methylone",
   "(powder / crystals)",
   "",
   " ",
   "insufflated",
   "Methylone",
   "(powder / crystals)",
   "",
   " ",
   "insufflated",
   "3-MeO-PCP",
   "(powder / crystals)",
   "",
   " ",
   "rectal",
   "Methylone",
   "(powder / crystals)",
   "",
   " ",
   "rectal",
   "3-MeO-PCP",
   "(powder / crystals)"
  ]
 ],
 "report": "<p>Well, I have been a drug geek for the past decade.  Until recently, I never contributed any of my personal experiences.  I decided to change that.  For info on my background, check out my first trip report, entitled 'An Overview of Intravenous Cathinone Usage', which can be found at Erowid.org/exp/98990.</p><p>OK, so I got my order in at roughly 4:00pm whatever day it was...2g of Methylone, and 100mg of 3-MeO-PCP.  The M1 I had done before, but the 3-MeO was new to me.  I had originally decided to just do some of the M1 that day, saving some for later, and trying the 3-MeO by itself at yet another time.  The best laid plans...</p><p>Immediately when I got back from the mail box, I fixed me up a shot of Methylone.  It was eyed, no time for a scale due to my anticipation.  Not a big one just to be safe, maybe around 50mg or so.  [Erowid Note: Two samples of powder (even of the same chemical) with equivalent volumes won't necessarily weigh the same. For this reason, eyeballing is an inaccurate and potentially dangerous method of measuring, particularly for substances that are active in very small amounts. See related article]</p><p>I felt aight, definitely high but I had waited too long to be content with that, so I done another shot of about equal size both of these IV'd.  It hit, there we go, I feel amazing now.  I continued this for roughly 3hrs, hitting every 15-30mins, until a lil past 7pm.  I had gone through several hundred milligrams by that time, maybe up to 1/2g.  But fuck, my needle broke, and I'm too high to get more, plus the pharmacies are all closed anyway.</p><p>My curiousity got the best of me.  I cut about 100mg of Methylone and maybe 20mg of 3-MeO-PCP into 2 lines, and insuffulated both.  I feel great, the 3MeO added a lil trippiness and dissociation to the M1.  I listen to some music for about half an hour, then it dawned on me...Rectal doses.</p><p>I removed the broken needle from my rig, cooked up another tenth of M1 and 20mg 3-MeO, drew it up like normal, and injected the fluid into my anus.  About 10-15 minutes later, it took hold, and I was fucked up hardcore.  For the next 2hrs, I didn't dose more, just chilled listening to music, then watching Through the Wormhole.  It felt very similar to other stimulant/empathogen and dissociatives combos I've had in the past, nothing really differentiating, but it was spectactular nonetheless.</p><p>It was maybe around 10pm at this time.  The peak of the 3MeO was fading, yet aftereffects were still clearly present, and the M1 was largely over.  I decided to chill on the 3 for now and focus on just the M1.  Until somewhere around 2am, I done multiple, ever-increasing butt shots of M1, until I had ran out of my entire 2g batch in only 10hrs.  The realization that I had done so much in such lil time scared me a bit, not sure if it was 'safe', an it definitely was not what I intended, but this is why I use; For the unknown, and sometimes even uncontrolled.  I was still breathing, felt relatively fine, and had a blast.  I don't reccommend this style of use for others, but I am an intensity junkie.  I get off on pushing my own boundaries, sometimes masochisticly using substances or doses that I know will be dysphoric or unpleasurable, simply for the experience.  I am a psychonaut, and I feel this strengthens my mental state.  Plus, I like to get high ;P</p><p>So now it is early morning, the 3-MeO-PCP trip has ended by now, and my M1 is gone.  A sane person would have made the rational decision to call it quits and get some much needed rest.  However, the freak in me was still curious about the 3-MeO...It indeed got me high, but high also were my expectations, and it never really shoot me into the Void deep within on those doses.  So, I cooked maybe 40-50mg (nearly all of it) with a lil less than 1cc of water, and dosed it rectally.  It still took about 10-15 minutes to kick in, but when it did, I was blown away.  The lights were out, and I did have some OEVs, but they weren't that impressive.  Then I closed my eyes. </p><p>I came to understand what 'Mind Movies' meant.  I experienced them before on dissociatives, but they weren't this real.  It was like I was watching TV, perhaps more vivid even.  Each seen lasted just 15 seconds max, then changed completely, but there seemed to be some underlying storyline which I have yet to fully decipher.  This was by far the best part of the session.  Some scenes were somewhat dark, twisted.  I'm not sure if this was the drug, or myself.  I seen some demons, some violence, cannibalism in one instance, but my mind was completely lucid.  I could rationalize it all, so none of this was unsettling in the least, though it was highly intriguing.  Most of it was neutral, and there were some incredibly positive scenes, and a few that were highly spiritual in nature.  At some point, I realized I could completely control them, it was like looking up videos on the internet.  I thought up what I wanted to see, my mind performed a web search, and I picked the most relevant results, then edited he videos as I watched, making me the Director.  The Revelations this caused were not completely new; I am a seasoned psychonaut, but it was interesting all the same. </p><p>I prolly came down around 6am, but after effects proceeded until around noon that day.  Later the following night, I rectal administered whatever 3-MeO-PCP I had left, but got barely a threshold effect.  Eh, tolerance is a bitch.  Really, I remember very lil of the experience to be honest, prolly due to the 2g of M1, way overdone that.  All in all, I will prolly do both drugs again, maybe even in combo, but really I am in no hurry to repeat that night.  Not that it was negative, I thoroughly enjoyed what I remember of it, but it was highly unsafe, and extremely exhausting psychologically.  I am very proud to have this experience under my belt.  Namaste.</p>",
 "year": "2012",
 "id": "99589",
 "gender": "Male",
 "age": "25",
 "timestamp": "2013-03-21T07:00:00.000Z",
 "views": "2313"
}
