{
 "id": 9961,
 "title": "Walking Takes Forever",
 "date": {
  "submission": "2001-05-02T07:00:00.000Z",
  "experience": "2001-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Uv1",
  "gender": "Male",
  "weight": 73
 },
 "dose": [
  {
   "time": "0",
   "amount": "300 mg",
   "administration": "oral",
   "substance": "Coffee",
   "form": "liquid"
  }
 ],
 "report": [
  "I have never been a coffee drinker. Tea is not my cup of tea either. So I have no addiction or tolerance to caffeine whatsoever.",
  "This time, when I took this coffee it was simply to research if caffeine was of any use. I brewed three cups, drank them with one gulp each, with some milk to cool them down, on a relatively empty stomach. I leave outside for a walk, as it is a beautiful March afternoon, and in any case, I was in for a little hike.",
  "While walking, a stream of thought flows rapidly in my head. I wished I'd brought a pen and some paper with me just so I could take notes, when suddenly I find a sharp pencil on the ground. I pick it up and search through my pockets for some paper. I continue walking, while writing down thoughts that passed my mind. '--walking takes forever and I am not even going anywhere.. I go on.'",
  "I got somewhat distracted when I hit a crossroad, for I hadn't planned my route beforehand. I was beginning to feel disoriented, as if my physical body had been assinged to do some duty by someone else and my mind would obediently follow. Someone had made a decision for me now to climb uphill, so there I continued my walk. I had noted at this time, about 10 minutes into it, that writing felt very distant to me. On the top of the hill I am feeling slightly stoned and very disoriented. A map of the area was found there, and I blankly stare at it, figuring what to do. I take five minutes to decide going back the same way as I had came.",
  "Back inside at t+30 and I am very stoned. I had the idea to check my blood pressure and spent 10 minutes searching through almost every available cabinet and drawer, trying to find the apparatus with which I could do the measuring. Even then it was clear to me that I was acting very compulsive and was being somewhat superstitious with finding it and where I should and shouldn't look. I never found it, and later heard that it wasn't there at the moment.",
  "Almost an hour after ingestion I began to come down. I could imagine I felt like how a neurotic person would feel, very uneasy, very tense. Being still was rewarding by itself. World seemed plain static, only serving as a backdrop without any deeper connections. Shortly after I was not alone anymore and began to act slightly aggressive, which is untypical of me, but I believe this was not as much due to the caffeine but my blood sugar levels were very low, as I had not eaten much the whole day. I got irritated easily and this did not chang even after I had dinner at t+75. I still feel it after nearly two hours. I felt no physical side effects, except for mild jittering."
 ],
 "erowid": {
  "id": "5922",
  "citation": " Uv1. \"Walking Takes Forever: experience with Coffee (ID 5922)\". Erowid.org. May 2, 2001. erowid.org/exp/5922",
  "substance": "Coffee",
  "views": "33797"
 }
}
