{
 "id": 9964,
 "title": "Whoahoa, Watch Out",
 "date": {
  "submission": "2007-01-23T08:00:00.000Z",
  "experience": "2007"
 },
 "author": {
  "name": "Noody",
  "gender": "Female",
  "weight": "150 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "400 mg",
   "administration": "oral",
   "substance": "Pharms - Bupropion",
   "form": "(daily)"
  },
  {
   "time": "0",
   "amount": "5 glasses",
   "administration": "oral",
   "substance": "Alcohol",
   "form": "(liquid)"
  }
 ],
 "report": [
  "I had just recently had my medication upped from 300mg to 400mg a day and really hadn't noticed much of a difference. Since I had no problems previously going out and partying while on Wellbutrin, it didn't even cross my mind to be concerned. I only found out after the fact that Wellbutrin can reduce your alcohol tolerance.",
  "I'll preface this by saying that I am by no means a stranger to alcohol. I'm a college student and have been drinking since I've been 15 or 16. Never had any problems really, made an effort to keep myself from doing anything really stupid or drinking way too much. Even so, I tend to drink around 7 or 8 drinks on average when I go out and I'm able to maintain myself pretty well. I've never had a full out blackout like I had this night.",
  "At the second party we were at that night, I'm guessing I was on my 4th or 5th drink. The last thing I remember is talking to some familiar faces and working my way through the party (I was aware of my drink, I know it wasn't drugged. That's not how these people roll anyway.). Almost complete blackness after that except for brief moments of consciousness where I remember puking and having my friends help my back home with only one shoe and a disconcerting amount of blood on my white coat. (I think it was from my toe? Not sure.) I had no idea what was going on, where I was, I didn't understand anything. However, it was pretty hard to think at all so oh well.",
  "Once we got back to my dorm I remember my friends telling me that if I didn't stop puking they'd have to call an ambulance. I laid on my side thought that I was probably going to die, go to sleep and simply not wake up. Apparently I kept telling them I was fine and they should go home, but they stayed around and tried to figure out if I would keep breathing. In all honesty, if it was someone else I probably would've wanted them to get medical attention, but I'm very glad that I was just left to be and didn't incur a bunch of hospital bills.",
  "It does say on the bottles not to drink alcohol while on the medication, but I really hadn't noticed any side effects while drinking on doses up to 300mg. That extra 100mg makes a startingly huge difference I suppose (combined with the fact it completely shreds your appetite). I don't think you have to completely abstain while on bupropion (although shrinks would prefer us major depressives to quit in general),  but be conscious that it can bite you in the ass very quickly. It seems that just one extra drink can just push you off the edge. Be careful if you must."
 ],
 "erowid": {
  "id": "59292",
  "citation": " Noody. \"Whoahoa, Watch Out: experience with Bupropion & Alcohol (ID 59292)\". Erowid.org. Jan 23, 2007. erowid.org/exp/59292",
  "substance": "Bupropion & Alcohol",
  "views": "26043"
 }
}
