{
 "title": "No Surprises",
 "author": "BBQMeister",
 "citation": " BBQMeister. \"No Surprises: experience with 4-AcO-DMT (ID 99662)\". Erowid.org. Apr 3, 2013. erowid.org/exp/99662",
 "substance": "4-AcO-DMT",
 "bodyweight": "200 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "11 mg",
   "oral",
   "4-AcO-DMT",
   "(capsule)",
   " T+ 1:00",
   "5 mg",
   "oral",
   "4-AcO-DMT",
   "(capsule)"
  ]
 ],
 "report": "<p>Preface:</p><p>I am a young man with a fair amount of psychedelic experience.</p><p>4-AcO-DMT was made by Albert Hofmann (quite rationally imo; chemically 4-AcO-DMT::Psilocin as Heroin::Morphine as ASA (Aspirin)::Salicyclic Acid etc...) after the discovery of psylocybin/psilocin. Numerous prior experiences with cubes had made me interested in this acetylated version of the substance. This is my first experience with the material.</p><p>The Experience:</p><p>1 gel-tab containing 10-12mg 4-AcO-DMT was ingested. About ten minutes later mild colors began appearing and a sense of aural calmness. ten minutes later I notice time has began to slow (about 30-50% perhaps) and I feel a sense of body load building. I am listening to music comfortably enjoying the experience floating nicely to a mental ++/body +++.</p><p>About 45 minutes after dosing I looked around and suddenly realized my mind was very lucid considering the body load I was experiencing. After the realization the body load eased down to ++ and I remained in a powerfully relaxed state. An hour after the inital dose I feel that I would be able to handle more. Knowing the fairly steep dosage-response curve, I ingest another half gel-tab (~5-6mg).</p><p>Fifteen or twenty minutes after the supplement dose I feel the effects coming on and float up to a overall +++ for a brief time. Effects continue for 3-4 more hours tapering slowly taking very similar form to my experiences with mushrooms. I sleep and wake up the next morning earlier than usual (good thing) feeling invigorated and ready for the day.</p><p>Sum Up:</p><p>The dosage I took would be approximately comparable to 1.5-2g of shrooms. Maybe it's BS But it was like I could feel the material being metabolized (deacetylated); and once it had the effects were indistinguishable from psilocybin mushrooms. On a note about the difference between 4-AcO-DMT and psilocybin, before they are metabolized (on the come up) I find psilocybin to have a cartoony/ancient feeling, where as the 4-AcO-DMT had more of a sparkly/modern feeling.</p>",
 "year": "2013",
 "id": "99662",
 "gender": "Male",
 "age": "23",
 "timestamp": "2013-04-03T07:00:00.000Z",
 "views": "1040"
}
