{
 "title": "A Completely Misunderstood Compound",
 "author": "Doses",
 "citation": " Doses. \"A Completely Misunderstood Compound: experience with alpha-PVP (ID 99718)\". Erowid.org. Apr 1, 2013. erowid.org/exp/99718",
 "substance": "alpha-PVP",
 "bodyweight": "156 lb",
 "header": [
  "DOSE:",
  " ",
  "",
  "alpha-PVP",
  "(powder / crystals)"
 ],
 "report": "<p>I'm currently writing this report WHILST on the substance. This is not the first time I have dosed on it, and won't be the last.</p><p>Let me start off with this there is only one or two reports online that advocates this compound, reason being that most users of this compound are irresponsible drug users and shouldn't be using drugs in the first place, as proven by their terrible experience with the substance which will almost always include stimulant psychosis and a binge. Even sublingually with 25mg of some pure-ass-shit (aka, pure white rocks of alpha-pvp), my heart rate barely reaches 100 bpm once I've peaked, which is modestly low compared to other stimulants.</p><p>Here is a collection of my experiments, with no tolerance, spaced one month each apart:</p><p>-Oral: N/A; still have not tried.</p><p>-Sublingually administered (35mg): I was walking around a flea market, when I remembered I still had a fat sack of alpha-pvp sitting in my backpack. Simply put, I detached myself from my family and went into a portapotty, weighing out a nice 35mg rock of alpha-pvp using my milligram scale with extraordinary accuracy. I figured since the tachycardia accompanied with insufflation may be uncomfortable while walking around in the heat, I might as well try a new ROA that a friend of mine had mentioned before, and with that thought I threw the rock under my tongue.</p><p>[T: 0:00] It dissolved rather quickly, numbing my tongue in a fashion similar to cocaine but with diminished potency. My tongue felt mildly numb afterwards. From here I continued to walk around the flea market, attempting to keep my spit in my mouth while unfortunately swallowing most due to my entire mouth eventually getting numb.</p><p>[T: 0:30-0:40] We left the flea market and walked to the car. As soon as I put my seat belt on, I could feel the euphoria beginning to build ever so slowly. I began to listen to my Amsterdam Trap Music. I begin to drink a bottle of water and can feel my tongue again after a few sips.</p><p>[T: 0:45] The nature of the compound is clear and I am beginning to near a peak of some sort. Drinking water has become... Not necessarily difficult, but rather undesirable. My resting heart rate has lifted to a nice 108 (my fast paced music more than likely contributing) but I have nothing to measure my blood pressure with at the time. I'm mildly stimulated, but experiencing more euphoria than the insufflation route. Interestingly enough, I find it easy to fall asleep, although this may be due to my stimulant past in which I eventually learned to sleep on Adderall.</p><p>[T: 1:30] We stop at McDonalds, I smoke a Marlboro NXT. The readrush combo is incredible, and I'm forced to sit down. Euphoria begins to slightly fade.</p><p>[T: 2:00] Heart rate begins to lower, I'm at ~96 bpm. Euphoria has about halfway diminished. I'm still very focused.</p><p>[T: 3:00+] Soft come down, no desire to redose using this ROA.</p><p>-Insufflated (10mg): I find this route to be the longest lasting, but the least rewarding and most dangerous. It's hard to determine how high you are about to get because unlike vaporization, when redosing, you start at the bottom and climb up to a peak rather than starting near the peak and making a short jog to the top. This is why other users report 'severe tachycardia,' and why this ROA seems to be the most dangerous.</p><p>[T: 0:00] I'm sitting in my friends car, this is the first time I've used alpha-pvp. He weighs out a dose equivalent to 10mg, then cuts it up into ten equally sized bumps. He splits one bump in half and tells me to put half of it up my nose and the other half in my mouth--allergy test. I do it and have no reaction whatsoever ten minutes later. I rail the other 9 bumps after we determined that I would not have any adverse reaction to the chemical.</p><p>[T: 0:00-0:10] Oooooh boy. The moment it goes into my nose, I feel it working its magic. Not as enjoyable as another RC I've tried called pentedrone, but this definitely has some euphoria.</p><p>[T: 1:00] I drive home, still feeling good. [Erowid Note: Driving while intoxicated or tripping is dangerous and irresponsible because it endangers other people. Don't do it!] When I get there, I immediately go into my room and drop the bag of alpha-pvp into a drawer, then fall asleep while watching TV. Decent experience; no heart rate recorded as it wasn't too high to begin with. Palms did become sweaty at a point.</p><p>-Vaporization (400mg over the course of a night): My first time vaporizing was after a bad shroom trip, three days after. A friend of mine dropped off a four point (400mg) sack of alpha-pvp so that I had something to do, because during my shroom trip I had broken all my pipes and glassware. I used a square of foil and a bic pen for vaporizing alpha-pvp.</p><p>[T: 0:00] I weigh out and load approximately 7.5mg into the foil, dull side up, after I had cleaned it off first. I took a fat rip, completely clearing off the alpha-pvp rock from the foil, but missing a bunch of vapor since it was my first time vaporizing off of a piece of foil.</p><p>[T: 0:00-14:00] I repeat this process every 20-30 or so minutes, increasing my dosage (and time span between doses) by about 5mg each redose, eventually working my way up to 30mg hits, making sure my heart rate does not exceed 120 BPM. This night was my only 'binge' and I did not experience psychosis. I finished the bag by morning, and realized that had I made some sort of dome using a water bottle, about 80% of the alpha-pvp that was wasted could have gone to use. The high that accompanies vaporization is quick, lasting only about an hour, if that; however, it's instant and the most euphoric.</p><p>Since then, I have used vaporization as my only and preferred method as it is much easier to control my high, although the 'urge' to redose is much, much stronger, or so others say. I've never had a problem setting this drug down or rejecting a dose. I currently vaporize daily as a replacement for adderall to help my ADHD, and as a replacement for coffee in the morning (caffeine causes extreme migraines for me). I sleep every night and make sure to keep consistent dosing. I have never experienced 'PVParanoia' or 'PVPsychosis,' as I've dubbed it.</p>",
 "year": "2012",
 "id": "99718",
 "gender": "Male",
 "age": "18",
 "timestamp": "2013-04-01T07:00:00.000Z",
 "views": "10993",
 "dose": {}
}
