{
 "title": "Tolerance Studies",
 "author": "tippa",
 "citation": " tippa. \"Tolerance Studies: experience with 2C-B, 2C-D, 2C-E, 2C-P, 2C-T-7 & 25C-NBOMe (ID 99736)\". Erowid.org. May 6, 2013. erowid.org/exp/99736",
 "substance": "2C-B, 2C-D, 2C-E, 2C-P, 2C-T-7 & 25C-NBOMe",
 "bodyweight": "190 lb",
 "report": "<p>For some reason, there isn't much out there about phenethylamine tolerance (though, admittedly I havent looked too hard) so I hope to provide some insight, especially  since I've wasted many a hard to come by dose by being impatient and stupid. First off, if you have the self control, it is wise to wait a week between doses, that fact is well documented. But if, like me, you lack patience and discipline, here is what my expensive trials have taught me.</p><p>2C-C-NBOMe: The nbome series (at least 25c) seems to have the worst tolerance curve for me. I received 10 tabs laid with 850ug each, the first night, 1 tab gave me a nice colorful ++, intellectual, plenty of visual fireworks, etc. Went to a concert and thoroughly enjoyed the whole thing. The second night 1 tab did NOTHING. A second tab half an hour later took me just to where I was the night before, and another half tab was a waste. The night after that (stupid) three tabs did diddly squat. It is also important to note that 2.5mg bucally with no tolerance can produce hospital worthy results (unfortunately, I am currently too lazy to produce citations, but look around Bluelight, it's there.) I am currently awaiting more supply to conduct further tests, namely 1.6mg bucally with a week off.</p><p>The normal phens also seem to have a steep tolerance curve, but not quite as steep as the nbomes. Here are some examples:</p><p>2C-D: First night (no recent phenethylamines -- at least 3 weeks) 40mg my mind was unbelievably sharp - almost speedy, my thoughts were ruthlessly objective, visuals were great, strong ++ (or maybe +++, the very nature of 2C-D, it turns out, leaves me unable to completely tell whether I was in control the whole time or if I was along for the ride.) I was very pleasantly surprised by this because everything I had read led me to believe I would be let down, but I love a good head trip. Second night 40mg visuals weaker, didn't have the same awesome mental acuity and wittiness as the night before, wasn't completely worthless but markedly weaker. Third night 20mg PLUS 850ug 25c-nbome. I was testing out the 'tofu' theory set forth in PiHKAL and surprisingly, despite tolerance and the fact that it was my 3rd night in a row, it had a great effect supplementing my 25c and I had a much better than expected evening.</p><p>2C-B: First night (3 day layoff, 35mg 2C-C 3 days prior) 22mg on an empty stomach, then a genius idea to add 20mg 2C-C about an hour in. Hit VERY hard, especially visuals, shot right up to a +++, ate some bacon and eggs, drank a redbull and them BAM! Gone! Just like that. Not a trace of anything. Never experienced anything like it before. The only possible thing I can find to account for this is tolerance. I made a note of the redbull in there but I drink waaaay too much caffeine as it is so these things rarely have a dramatic effect on me, and I have not heard anything to indicate that eating could kill an experience (Many people report not being able to eat during phenethylamine experiences at all. I on the other hand have yet to encounter anything, ever, at all that can kill my appetite.)</p><p>2 Days later, 16mg right after dinner. Thought I was in for a letdown, based on all the tolerance 'research' I've been doing. 1 hour, nothing. 2 hours, barely +1. 3 hours in (I must admit, that puts us right here, right now as I type this.) Finally starting to develop. Added in some melatonin in the form of a favorite orange colored beverage, which seems to enhance the body load that I love from 2cb. Music enhancement, conversation is easy, visuals subtle but present. Definitely ++, but nothing more comes of it. I learned 2 things from this experience. One, the tolerance 'guidelines' hold true for 2c-b also. Two, the amount of food in my stomach without a doubt dictated how long the experience took to develop, though not the intensity.</p><p>2C-E: First night, 10mg, didn't want an intense experience, but forgot that I had some 25c a few nights before. Nothing happened at all. It should be noted that my friend that I also gave 10mg to reported having quite a nice evening. Second night, 15mg, same result. Nothing of note happened, in fact I actually fell asleep, which is generally quite impossible for me with 2C-anything, and on most sober nights as well. Third trial, three nights later with 32mg (going for broke.) I suppose this wasn't scientifically sound data gathering, because I don't have a clue what benefit was from the 3 days off and what part was the huge dose, but this was the single best trip of my life. Solid +++, most intense visuals ever, deeply personal introspection when I wanted, pure unadulterated fun when I wanted. But even in all of this, I see a tolerance issue. I once had an almost identical experience with 2C-E at 15mg! 2C-E is my absolute favorite of the phens, and it saddens me to realize that I got one good experience where I could have had three if I had only the patience to wait a full week!</p><p>2C-T-7: I also have some evidence of tolerance with 2C-T-7, a thoroughly rich, spectacular visual experience the first night followed by a lackluster second night, though nothing worth a whole paragraph. I find 2C-T-7 to be too 'easy,' that is, all flash and no enlightened headspace. I have been told otherwise but I have yet to look further into it.</p><p>2C-P: Something else I need to look further into is why 2C-P doesn't seem to follow this trend. For a solid week, I took an unmeasured (small though, best guess 2-4mg) every day. It was a manageable dose for daily life, and I liked the way it made me think. I was more clever than usual, reminiscent of 2C-D though not as strong, and it yielded mild visuals throughout the day. Quite an interesting existence, to be sure! Each day the same dose, each day the same effect. No noticeable tolerance here whatsoever.</p><p>One last insight I would like to offer: alcohol is bad. At least for the purposes of phenethylamines. I went through a period where I could not get a decent effect from anything, and it took me forever to realize that my nightly drinking was totally ruining things for me. I have abstained from alcohol during most of the above trials that took place over the last few months (though not voluntarily, that's another story for another time,) and it has really paid off. I have actually found phenethylamines to be extremely helpful in dealing with my (formerly) excessive drinking, both by aiding in self analysis and by not wanting to ruin my experiences.</p><p>In conclusion, I think it's safe to say that a one week buffer between experiences is ideal for best results, and unless I somehow come across unlimited resources, I will be sticking to this. I am blessed to even have these substances be a part of my life, and I look forward to not wasting them anymore. I hope this can serve as a basic guide for anyone looking to maximize their phenethylamine experience.</p>",
 "year": "2012",
 "id": "99736",
 "gender": "Male",
 "age": "25",
 "timestamp": "2013-05-06T07:00:00.000Z",
 "views": "2178",
 "dose": [
  {
   "time": "DOSE:",
   "amount": " ",
   "administration": "",
   "substance": "2C-B"
  },
  {
   "time": "",
   "amount": " ",
   "administration": "",
   "substance": "2C-D"
  },
  {
   "time": "",
   "amount": " ",
   "administration": "",
   "substance": "2C-E"
  },
  {
   "time": "",
   "amount": " ",
   "administration": "",
   "substance": "2C-P"
  },
  {
   "time": "",
   "amount": " ",
   "administration": "",
   "substance": "2C-T-7"
  },
  {
   "time": "",
   "amount": " ",
   "administration": "",
   "substance": "2C-C-NBOMe"
  }
 ]
}
