{
 "id": 9974,
 "title": "Where Did I Go and How Did I Get There?",
 "date": {
  "submission": "2000-09-25T07:00:00.000Z",
  "experience": "2000-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "M. Nemovanta",
  "gender": "Male",
  "weight": 84
 },
 "dose": [
  {
   "time": "0",
   "amount": "5.5 g",
   "administration": "oral",
   "substance": "Mushrooms",
   "form": "dried"
  }
 ],
 "report": [
  "I have experienced mushroom trips a few times before this experience so i felt bolder and more prepared to eat a larger quantity. My friend and I picked out a tranquil sunday and set off to his house in the country (i always feel more comfortable during any trips being outside-no walls).We ate our doses and decided to run to the store while letting them settle into our systems.",
  "20 minutes and a joint later after a bit of meandering we packed a little bag and headed out to the stretched out cotton fields behind my friend's house. This is when the mushrooms really started to kick in. The mushrooms were beginning to take some effect during our walk past the horse stables toward the fields. The next thing i know it was raining! Out of the middle of sunshine it just exploded leaving us nothing to do but run for cover. We made to an isle of trees that seperated the fields and nestled into a comfortable dry spot. Then just as soon as it started, the rain stopped and the the sun bursted out into our faces like a door opening in the sky. This is when we really fell out of reality.",
  "I remarked to my friend that something was behind that area of the blazen sky(or within it?) and it was so tremendous and powerful. Then i got the impression from whatever it was that i was a primitive ape. Some kind of strange evolutionary thought was being processed via the mushroom. He also 'felt' this command to feel primitive. We remarked to one another how this essence had made us feel so small compared to what was out in the sky. Then he began to get up and stumble away back towards his house and i sat there like some kind of flesh shell. then i mustered up some control and began to wander after my friend.",
  "Next thing i know i am at his back door and he's flipping out. I entered the house and walked over to the bathroom. I looked over at my friend and saw someone else. Not him. I felt normal conciousness(along with memories) were 'transported' somewhere else beyond reach at this time. I moved over to the mirror and began to look at my blue tinged reflection not knowing who in the hell i am or this guy is in the other room talking about demons and lying in a fetal position on the bed. This went on with other unexplainable mental situations for sometime. I began to walk in circles around his house while i could hear the wood floors stretching and moving just as if it had been some type living organic material. I began to get sick and started throwing up in the toilet and out the back door (which ever was closer at the time) and outside looked like a stage set for some television show from another dimension. The sky had become dark by this time and the stars sent messages thru 'sequenced movements'.",
  "I finally started grasping a fraction of what normal reality was and started talking myself down. My friend wasn't having this luck so i helped talk him down too. I told him to vomit because he was talking about going to the fucking hospital and those damn demons, aliens or whatever. Then it struck me i was tripping! Thru all of the previous drama we had both forgot we were tripping! We went so far out that we forgot how to come back. I started laughing and running around his house declaring 'WE ARE ONLY TRIPPING!' I repeated this like a mantra to help lift our spirits into a positive space. It worked my friend got up and we both agreed that we went out of our heads. Coming down was slow but more relaxed. We both learned something about life and reality that day even though some of it was very confusing and still complex to this day."
 ],
 "erowid": {
  "id": "595",
  "citation": " M. Nemovanta. \"Where Did I Go and How Did I Get There?: experience with Mushrooms (ID 595)\". Erowid.org. Sep 25, 2000. erowid.org/exp/595",
  "substance": "Mushrooms",
  "views": "6052"
 }
}
