{
 "id": 9979,
 "title": "My Experience of the After Effects of Ecstacy",
 "date": {
  "submission": "2001-03-31T08:00:00.000Z",
  "experience": "2001"
 },
 "author": {
  "name": "X",
  "gender": "Male",
  "weight": "100 kg"
 },
 "dose": [
  {
   "time": "0",
   "amount": "9 tablets",
   "administration": "oral",
   "substance": "MDMA",
   "form": "(pill / tablet)"
  }
 ],
 "report": [
  "18/m/Ireland.",
  "I've been pilling regularly for about a year now and I've never had much trouble with it until recently. I was always able to handle the comedown directly after and the following week in school was always completely tolerable.",
  "About 2 months ago I attended a once-off dance event in Dublin and it was quite mental. I brought far too many pills in with me, and we all know that if they're there, they'll be taken. 9 speckled mitsubishis later, my legs had suddenly disappeared, I was talking complete bollocks and hallucinating wierdly. As a result I had a fairly poor night, a horrific comedown and for the first time sufferad major after effects the following week, being constantly on the verge of crying. I had never taken anything like that amount before and after this experience I came the conclusion that you're better off taking pills in smaller amounts. Too many cause you to become like a zombie, smacked beyond belief and thats no fun. ",
  "In the weeks following the concert I fell into my usual routine of taking no more than 5 pills in a weekend, but ever since the concert Sundays, Mondays and Tuesdays have become absolutely unbearable. I wake on Sunday afternoon feeling strangly fine but as night draws closer a horrible feeling of impending doom comes over me and come bedtime I am utterly distrought and end up crying myself to sleep. Monday I sit in school, far away from my friends, unable to hold up any conversation, paranoid, scared and very very alone. Terrible thoughts flash through my brain. I am left with the feeling that the world is generally a nasty place, unable to see any hope whatsoever. This feeling remains on Tuesday but gradually lifts through Wednesday until I'm reasonably back on form come thursday. I find the whole experience scary and I am in disbelief as to how a person can sink to such emotional lows. This past week has been particularly serious and I am currently contemplating giving the pills a rest for a while at least.",
  "I am of the firm belief that ecstacy is indeed a wonderful and fun drug and I am aware that you generally always pay for taking it afterwards, both mentally and physically. But the way I feel at the moment is that I seem to be paying too high a price for services rendered and quite frankly, its driving me mental. I dont want to loose that sweet n'creamy headclean that comes courtesy of MDMA. I'm always like a little child on Christmas Eve when I'm waiting to come up. But, like Mr.Claus' gifts, I wish the present that Mr. Bishi gives me was for keeps. ",
  "Maybe people can identify with my experience and if so I hope they know they're not alone. Great site by the way. Highly infomative and safety is clearly a big issue which is always a good thing. Keep up the good work. It is appreciated. One lowly Irishman signing off."
 ],
 "erowid": {
  "id": "5966",
  "citation": " X. \"My Experience of the After Effects of Ecstacy: experience with MDMA (ID 5966)\". Erowid.org. Mar 31, 2001. erowid.org/exp/5966",
  "substance": "MDMA",
  "views": "11928"
 }
}
