{
 "id": 9980,
 "title": "Did I 'Re-dose' or Just Dream It?",
 "date": {
  "submission": "2007-01-29T08:00:00.000Z",
  "experience": "2007-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Root Vandal",
  "gender": "Male",
  "weight": 64
 },
 "dose": [
  {
   "time": "0",
   "amount": "600 mg",
   "administration": "oral",
   "substance": "Valerian",
   "form": "(capsule)"
  },
  {
   "time": "0",
   "administration": "oral",
   "substance": "Amphetamines",
   "form": "(daily)"
  }
 ],
 "report": [
  "I was introduced to Valerian through my mother, who swore by it to ease cramps. She said it might help me get to sleep at school since I was having  on and off bouts of insomnia the previous semester. I tried it out one night, and was blown away by the lucidity, clarity, and sometimes sheer intensity of the dreams this plant helps induce. She warned me not to use it too often, as Valerian certainly has 'addictive' qualities. (Meaning that yes, excessive use of Valerian can cause mild psychological dependency and subsequent depression/withdrawal phases, which may be worse for some and not an issue for others.) I continued to experiment with Valerian here and there while I was home during winter break, and experienced dreams that ran the gamut from delightful phantasmagoria, a bit to 'real' pornographic scenes with girls who I see more as friends (then again, maybe my dreams are telling me otherwise), to heartpounding nightmares involving shadowy figures learing over my bed (for anyone who has used datura and related delieriants, you should know about the 'shadow people' I'm refering to.)",
  "Anyway, I stopped using Valerian for the remainder of my vacation. Once school started again I was moved into a single dorm. One night I was having trouble getting to sleep, so I took 3 valerian capsules. I lay in bed, waiting for them to kick in...",
  "I woke up the next morning feeling well rested and refreshed, despite the fact that I tossed and turned all night and didn't get more than two hours of sleep. 'Great, now I feel relaxed, but in a few more hours I'm going to crash in the middle of class' I thought. I just couldn't understand why Valerian didn't work its magic this time. I hit the showers, a bit pissed off, and hoped that my daily dose of adderall would help keep me on my feet.",
  "Then reality hit me like a sack of bricks and it all started to sink in. I had been asleep the entire night, and dreamed up the entire insomnia episode! I had convinced myself that I barely slept at all, when in fact I did. My mind had recreated my dorm room down to the T, forming a doppleganger reality, complete with me being unable to sleep. Still in disbelief, it dawned on me that the only way to be sure was to count how many capsules I had out of the 69 remaining. I counted exactly 69 caps, and was a bit amused that Valerian had pulled a fast one on me. But right before I put the Valerian away, I saw that a bottle of B-12 vitamins had been opened. I was saving these vitamins for the next day, and didn't open the bottle last night... or did I? I cannot remember whether I took these vitamins before I went to bed, or if I had been sleep walking and, thinking that the B-12 was Valerian, redosed, either dreaming that I had never went to bed and thus never took any Valerian that night, or that it didn't work at all so I took more. I will never be sure what happend that night. From now on I will lock up my stash of vitamins and sleep aids when I take the occasional Vandalroot 'trip'!"
 ],
 "erowid": {
  "id": "59683",
  "citation": " Root Vandal. \"Did I 'Re-dose' or Just Dream It?: experience with Valerian (ID 59683)\". Erowid.org. Jan 29, 2007. erowid.org/exp/59683",
  "substance": "Valerian",
  "views": "18384"
 }
}
