{
 "title": "An Unexpected Twist",
 "author": "Strazi",
 "citation": " Strazi. \"An Unexpected Twist: experience with LSD (ID 9980)\". Erowid.org. Oct 5, 2003. erowid.org/exp/9980",
 "substance": "LSD",
 "bodyweight": "180 lb",
 "header": [
  "DOSE:",
  "3 hits",
  "oral",
  "LSD",
  "(blotter / tab)",
  "",
  " ",
  "smoked",
  "Tobacco - Cigarettes",
  ""
 ],
 "report": "<p>Yesterday I decided to take 3 hits of acid with a wonderful girl that I had met at college. She is of a 'free spirited' nature and is very much into sex and drugs and is very open about it, which I admire. This is the type of person I have always wanted to be, but I always end up being uptight about a lot of things.</p><p>I decided that taking acid with her would change me for the better: I took it with this girl I had been hooking up with....and we were admiring the colors rising up from the ground, and the day seemed so warm, and we lost track of time and sat in the middle of the campus and played in the dirt and talked about crazy philosophies and decided that nature was more beautiful than anything else and we were there for like 4 hours getting as dirty as we could. We had a stick in our hands that we were using to represent so many things, we felt the stick's colors and life and discussed why a stick had to be known as a stick and not just what it is, a ________. Why did there have to be a word for it?</p><p>Time became an enemy to us and we found that when we walked to the gas station to get cigarettes, we found no problem in stopping in the middle of our walk, sitting down on the sidewalk and discussing life. Why did we always feel like we had to be somewhere when we didn't. We decided this was something we needed to permanantly change about ourselves. We got back to the campus and lyed in the grass again and it started to get dark and cold, but that was OK.</p><p>Then this hippie dude came up to us and he seemed so warm and hairy, we felt connected to his colorful shirt. That, and his hair and his warm smile made us feel so good, and we dubbed him our mascot.....the purple man. So we went back to his dorm and me and Megan felt so connected because we had stared into each other's eyes and watched all the colors pour out of them and we knew what each other were thinking without saying it because we would say YEA at the same time to confirm the conversation we were having with our eyes.</p><p>But then we both started to feel very sensual, being in a warmer environment with a bed and warm colors, but she was so drawn to this dude's hair and sense of warmth he was portraying. She started rubbing his hair, which I thought was beautiful and felt no jealousy, and I did the same, with absolutely no anxiety of being gay or any other stupid shit. The dude didn't talk much and would simply give a hearty chuckle and assure us that we were good people. I loved this dude, and I loved Megan even more. The feeling of sensuality we were having.....but then she started to only want to have anything to do with this hippie because he had such warm colors and hair, and I was dressed sort of like a greaser at the time and she thought my short spikey hair, black pants and white T-shirt was abrasive and giving off a cold image.</p><p>All the sensuality we had created was being released on this dude and she started licking his face, rubbing his legs, and doing some of the most sensual things I had ever seen anyone do. But there was nothing I could do but watch. I could only hope she would eventually come back to me, but this went on for an hour and at the end of the hour my strong sensuality and emotions for her were so strong, I couldn't stand that I couldn't have her at that time, so I left....which she took as being 'cold.'</p><p>I got back to my dorm at 4:30a.m. and had so many horrible emotions now flowing through me, but everyone was asleep and there was nobody to talk to. The acid made it impossible to sleep, and no matter what I did, the emotions only got stronger. I tried not to think about it, but that only made it worse, so did cigarettes. I felt trapped. I couldn't sleep, there was nobody around, who knew how many wonderful sensual things Megan was now experiencing without me. There was nothing I could do. I stayed up until 11:00a.m when I had class, because I was unable to sleep. Those 6 and a half hours were the worst of my entire life.</p><p>",
 "year": "2001",
 "id": "9980",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2003-10-05T07:00:00.000Z",
 "views": "18515",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "3 hits",
   "administration": "oral",
   "substance": "LSD",
   "form": "(blotter / tab)"
  },
  "1": {
   "time": "",
   "amount": " ",
   "administration": "smoked",
   "substance": "Tobacco - Cigarettes",
   "form": ""
  }
 }
}
