{
 "id": 9981,
 "title": "Leg Pain",
 "date": {
  "submission": "2002-02-06T08:00:00.000Z",
  "experience": "2001"
 },
 "author": {
  "name": "Morinf3n",
  "gender": "Male",
  "weight": 68
 },
 "dose": [
  {
   "time": "0",
   "administration": "oral",
   "substance": "Morning Glory",
   "form": "(seeds)"
  }
 ],
 "report": [
  "I would like to report my experiences of morning glory seeds. The first time i ever did morning glory was at my grandparents house, i went out and bought 2 packs of heavenly blue morning glory seeds and then i crushed them up with a hammer and ate them. I didnt feel any effect till about 1 1/2 to 2 hours later, and the effects were pretty pleasant.",
  "The only thing that i didnt find pleasant about my experience was this peculiar pain in the back of my legs. The pain didnt go away through the whole experience and it only hurt when i walked. It was pretty irritating.",
  "The other time i did morning glory i took 3 packs of the seeds at my house at about 10:00 or so. The experience was MUCH stronger, almost double that of my previous experience. This time i also had pain in the back of my legs though, and like the experience, the pain was twice as strong. It was to the point where i didnt even get up to walk cause i couldnt bear the pain. I thought the experience would wear off before i had to go to school the next morning but when i awoke i found that i still had the pain in my legs and ..well..i was fucked because i had to walk out to my bus stop while tripping.  I tripped..probally till...10:00 that morning. It was very noticeable while i was trippin, you cant hide it like pot cause your pupils get fuckin huge, they're like quarters inside your eyes...freaky shit.",
  "But i just wanted to add this experience cause i didn't see any other experiences listed on Erowid mentioning the side effects of pain in your legs after doing it. On the other hand...i would recommend this drug cause it is hella fun and compared to other shit seems a lot safer."
 ],
 "erowid": {
  "id": "5969",
  "citation": " Morinf3n. \"Leg Pain: experience with Morning Glory Seeds (ID 5969)\". Erowid.org. Feb 6, 2002. erowid.org/exp/5969",
  "substance": "Morning Glory Seeds",
  "views": "18085"
 }
}
