{
 "title": "Social Enhancer",
 "author": "Zer0",
 "citation": " Zer0. \"Social Enhancer: experience with 4-Fluoroamphetamine (ID 99827)\". Erowid.org. Dec 11, 2013. erowid.org/exp/99827",
 "substance": "4-Fluoroamphetamine",
 "bodyweight": "155 lb",
 "report": "<p>0:00 Very small amount of cannabis</p><p>1:00 2.5 shots of Rum and some more cannabis</p><p>2:00 Just under two capsules insufflated 4-Fluoroamphetamine</p><p>I have extensive experience with LSD, Psilocybin and, more recently, 25I-NBOMe (my favorite). MDMA has never had a satisfying effect on me, but I think that's mostly because I haven't spent enough money or I didn't get a good deal.</p><p>I was at my friend's birthday party and was in an energized, very social mindset, having gotten a good amount of exercise that day as well as being in good company. I had smoked some weed and drank a small amount but really felt more giddy than inebriated. I bought two capsules, each probably just under half full of 4FA, a fluffy white powder. I was told it would burn like hell so I chopped it up as well as I could with a card and took the first of two lines I made.</p><p>The pain was like corrosive fire eating away at my nasal passages and beneath my eyes, but a few drops of water quickly brought it down and the pain subsided within a couple of minutes, a single tear ran down my left cheek. I finished the second line, then walked out of the bathroom. Already a sense of exhilaration began to take hold. I resumed social activities, freely speaking to whomever I made contact with.</p><p>About 7 minutes later, I was in the middle of a conversation when I felt a very distinctive rush. It like an orgasmic puffer-fish swam up my spine and inflated in my head. I kept talking, but I had to slow down and breathe as the sensation filled me up, close to overwhelming, but not quite. I smiled and looked around, the party had gotten very crowded. I felt warmth and light envelop me, though I didn't get any real visuals, the room took on a welcoming light. I felt the urge to touch people in greeting more readily than before. My mouth was also running a mile a minute -- I appreciated the ease of conversation, my ideas continued to flow creatively, and I never failed to articulate anything. I felt nothing but joy when meeting new people, and I swung right into impassioned, stimulating conversation with old friends with ease. We made each other laugh with ease.</p><p>Physically, my heart rate was slightly faster and my pupils were dilated only slightly. It did have a strong anorexic effect, and I had no problem not eating dinner that night. I had significant time dilation, knowing I had to call my mom in an hour and attempt to change plans for transportation back home. I checked my phone after I felt a significant chunk of time had gone by. Only ten minutes had passed. When it came time to speak to my mother, I felt slight anxiety, because it was likely she wouldn't want to hear that I would either be coming home really late or going to my Dad's house instead. While on the phone with her, I felt diplomatic and coherent, but the facts of the situation outweighed all of that and she became upset with me anyway. She came told me she was coming to pick me up. I felt some anxiety for the next hour as I vividly imagined the conversations we would have in the car, but I was able to continue having fun. I said my goodbyes and walked to the car. I had no problem talking to my parents confidently, and I am sure they had no idea I was high. This was probably about 2.5 hours after the onset (it took about 5 minutes to peak) of the 4FA and I was still feeling a strong body high. This was improved when I relaxed my tense muscles. When I got home, I was still quite active. I did some reading for my classes, and then read another book for pleasure. I was able to fall asleep at about 2:45, about 4.5 hours after insufflation of the 4FA.</p><p>The next morning, I had some residual feelings of stimulation lasting until about 11 AM, as well as minor appetite suppression that ended after breakfast. All in all, an extremely worthwhile experience.</p>",
 "year": "2013",
 "id": "99827",
 "gender": "Male",
 "age": "17",
 "timestamp": "2013-12-11T08:00:00.000Z",
 "views": "500",
 "dose": {
  "0": {
   "time": "DOSE: T+ 0:00",
   "amount": " ",
   "administration": "smoked",
   "substance": "Cannabis"
  },
  "1": {
   "time": "",
   "amount": " T+ 1:00",
   "administration": " ",
   "substance": "smoked"
  },
  "2": {
   "time": "Cannabis",
   "amount": "",
   "administration": " T+ 1:00",
   "substance": "2.5 shots"
  },
  "3": {
   "time": "oral",
   "amount": "Alcohol - Hard",
   "administration": "",
   "substance": " T+ 2:00"
  },
  "4": {
   "time": "2 capsls",
   "amount": "insufflated",
   "administration": "4-Fluoroamphetamine",
   "substance": "(powder / crystals)"
  }
 }
}
