{
 "id": 9983,
 "title": "Fun Fun Fun",
 "date": {
  "submission": "2002-01-18T08:00:00.000Z",
  "experience": "2001-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Jason",
  "gender": "Male",
  "weight": 54
 },
 "dose": [
  {
   "time": "0",
   "amount": "3.0 ml",
   "administration": "oral",
   "substance": "1,4-Butanediol",
   "form": "(liquid)"
  },
  {
   "time": "0:30",
   "amount": "1.0 ml",
   "administration": "oral",
   "substance": "1,4-Butanediol",
   "form": "(liquid)"
  },
  {
   "time": "1:00",
   "amount": "1.0 ml",
   "administration": "oral",
   "substance": "1,4-Butanediol",
   "form": "(liquid)"
  },
  {
   "time": "1:45",
   "amount": "3 hits",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  }
 ],
 "report": [
  "Since there are only a few experience reports for 1,4-Butanediol, I figured I would write mine.",
  "I'm a 120 lb weakling who fasted from about ~1:55 PM.",
  "6:15 - I pulled out my little mason jar and a teaspoon and took somewhere between 1/2 to 2/3 a teaspoon. I was going for 3/5ths a teaspoon which should equate to about 3 ml, but I was trying to be careful and not take too much right away so I think I took less than that. The stuff has that bitter GHB-like taste, but for some reason I don't find it as bothersome as GHB.",
  "6:45 - This shit isn't kicking in. I dip the spoon into the jar and pull it out taking maybe ~1 ml more.  Remember, you can always take more drugs, but once you take too much, you're fucked.",
  "7:15 - Ok. I'm relaxed, but I feel like I want more. So I do the dip the spoon ~1 ml method again and relax. I feel like going for a walk, but I don't because I would have to explain to people that I'm going for a walk for no reason at 7:15. I'm not really the type of person that goes on walks. Also I feel a bit hotter than I should.",
  "8:00 - This shit has kicked in a while back. Haha. I'm extremely relaxed and feeling good now yeah. So good in fact that I'm ripping Who lyrics for this report. I'm having a hard time keeping attention to the TV, but music is great. Even bad music isn't as bad. But since it's 8:00, there's gonna be some good TV on soon. With that in mind, I pack a decent sized bud into my pipe and smoke that. Now I didn't intend on smoking a decent size nug, but I don't know. I just did. Now I already was having a slightly",
  "harder time keeping my balance walking around, but that's alright as I don't really have to go anywhere.",
  "8:05 - Haha. The weed kicked in. Now for some reason I don't feel really high from the pot, but more like the GHB-effect from the 1,4-Butanediol is in full effect.",
  "For the next two to three hours, I'm in bliss, and carry on like an idiot rolling around on my waterbed watching TV, etc. It's hard to explain, and I'd look like an idiot trying to, but I'm really pretty smashed, but in a real good way.",
  "~11:00 - I go on IRC and act like an idiot, making less sense than usual.",
  "~12:00 - My stomach is upset. I find this kind of weird because it is happening so late in my little binge. You'd think I would've had this happen much earlier. I'm thinking this is partially due to me not eating properly.",
  "~12:30 - I crash. I fall asleep rather easily, but I wake up rather early (~8:30 AM) and can't get back to sleep. I'm not hung over or anything. In fact, I feel pretty good.",
  "Now I know everybody thinks this drug sucks, and it probably does in comparison to some other drugs, but I enjoyed it. And as long as you don't mix it with alchohol and don't dose too often, this is a really enjoyable drug."
 ],
 "erowid": {
  "id": "5974",
  "citation": " Jason. \"Fun Fun Fun: experience with 1,4-Butanediol & Cannabis (ID 5974)\". Erowid.org. Jan 18, 2002. erowid.org/exp/5974",
  "substance": "1,4-Butanediol & Cannabis",
  "views": "18017"
 }
}
