{
 "title": "Beautiful Until I Had A Seizure",
 "author": "Nick",
 "citation": " Nick. \"Beautiful Until I Had A Seizure: experience with Citalopram, Alcohol, MDMA, LSD & 25I-NBOMe (ID 99903)\". Erowid.org. Jul 29, 2013. erowid.org/exp/99903",
 "substance": "Citalopram, Alcohol, MDMA, LSD & 25I-NBOMe",
 "bodyweight": "175 lb",
 "report": "<p>I started the night off at my girlfriends house where I drank one can of Thatchers Gold. I already had 1.5 tabs of acid and 0.5g of MDMA, ready to take when we were heading out. Before we left I took 0.125g of MDMA orally.</p><p>We arrived at the venue at around 11:00pm, and I took the tab and a half of acid whilst we were in the queue. Once we got inside I bought a bottle of water.</p><p>After half an hour or so, the MDMA and the LSD began to hit me at roughly the same time. I felt wonderful (as one could imagine) and was enjoying dancing and my trip was getting greater and greater. About half an hour later I bumped into my friend and he had this nasal spray in a bottle. My girlfriend didn't do it, but I sprayed once into my nose. I didn't know it was 25I-NBMOe, this was the first time I had done a drug without researching it extensively.</p><p>The effects from it were almost instant and for the first half an hour the euphoria was incredible. The visuals were beautiful and dancing felt effortless. The lasers looked amazing and things seemed to be teleporting and twitching around. It was like looking through a kaleidoscope. There were trails from everything, like everyone was moving around so fast that I could see them behind them. I began to feel wobbly and was stumbling around slightly. It felt like the best experience ever and I told my girlfriend that she should try it.</p><p>My girlfriend suggested that we go outside so I followed her outside, tripping and stumbling and bumping into door frames, which seemed funny at the time.</p><p>1:00 AM: We found a different, female friend who had also taken the same thing and she was also equally messed up from it. It was then that I quite literally couldn't see anything but blurry faces nearby due to the colours and patterns in my vision.  </p><p>1:15 AM: I felt my hand start twitching, then my arms, then my head, and I managed to say to my girlfriend 'I'm twitching, I'm twi...' I was panicking, then time seemed to freeze for me. I felt stuck in this position but everything around me had also stopped. Literally like time had frozen but I was still conscious. I thought I was dead.</p><p>This is what my girlfriend said happened to me: my twitches got violent and aggressive, I fell on the floor flat on my back, then I started having a seizure where my body was having full convulsions and my head was shaking really violently. I somehow got my head under a bench, but two men grabbed hold of my head to keep my head safe. I started choking. She was on Acid so she could see blood coming from my eyes. It lasted at least 5 minutes and then my body relaxed and I was led like a dead body on the floor. I was trying to get up, but couldn't. I was dripping with sweat and my face was bright purple.</p><p>The next thing I remember was being ushered out the front door by a security guard and I sat down on a ledge out the front of the venue. I didn't want to be there and wanted to run away. I had overwhelming paranoia. I couldn't speak, every time I tried to run away I just stumbled and had to sit down again. We had a friend come pick us up and take me back to my girlfriend's house. In the car I thought there was like 15 people was confused as to how I was going to fit, but there was only 2. I then got in the car, but needed to get out. I tried to escape the car, desperately trying to climb out the door.</p><p>2:00 AM: Once we got home, my temperature was all over the place, shivering to sweating, to taking all my clothes off and sitting on the front door step.</p><p>We sat there for a while and I tried to be sick out the front door but I stood up and walked into the kitchen where I was sick all over her kitchen floor. I then went upstairs, got in bed and took two Valium. Didn't fall asleep. Took two more, didn't fall asleep. I only fell asleep after 10 Valium then woke up two hours later. Once I woke up I did a line of ketamine which seemed to straighten me out and relax me a bit.</p><p>It was easily the worst drug experience I have ever had. I am never doing 25I-NBOMe again. I have done LSD and MDMA together numerous times and never had a problem.</p><p>I later spoke to the man that gave me the spray and he said that it doesn't mix well with anti depressants (the citalopram) so maybe that was part of the cause of it.</p><p>Thanks for reading and stay away from 25I-NBOMe. Not only was it the scariest experience of my life but it was for my girlfriend as well. Apparently seizures from this drug can cause death, so if you do try it, be extremely careful with dosage.</p>",
 "year": "2013",
 "id": "99903",
 "gender": "Male",
 "age": "19",
 "timestamp": "2013-07-29T07:00:00.000Z",
 "views": "2286",
 "dose": [
  {
   "time": "DOSE: T+ 0:00",
   "amount": " repeated",
   "administration": "oral",
   "substance": "Pharms - Citalopram",
   "form": "(daily)"
  },
  {
   "time": " T+ 0:00",
   "amount": "1 glass",
   "administration": "oral",
   "substance": "Alcohol - Beer/Wine",
   "form": ""
  },
  {
   "time": " T+ 0:00",
   "amount": "125 mg",
   "administration": "oral",
   "substance": "MDMA",
   "form": ""
  },
  {
   "time": " T+ 0:00",
   "amount": "1.5 hits",
   "administration": "",
   "substance": "LSD",
   "form": "(blotter / tab)"
  },
  {
   "time": " T+ 1:00",
   "amount": "1 hit",
   "administration": "insufflated",
   "substance": "25I-NBOMe",
   "form": "(liquid)"
  },
  {
   "time": " T+ 3:00",
   "amount": "2 tablets",
   "administration": "oral",
   "substance": "Pharms - Diazepam",
   "form": "(pill / tablet)"
  },
  {
   "time": " T+ 3:15",
   "amount": "8 tablets",
   "administration": "oral",
   "substance": "Pharms - Diazepam",
   "form": "(pill / tablet)"
  },
  {
   "time": " T+ 5:15",
   "amount": "1 line",
   "administration": "insufflated",
   "substance": "Ketamine",
   "form": ""
  }
 ]
}
