{
 "title": "Becoming the Wooden Eagle",
 "author": "Chilly-B",
 "citation": " Chilly-B. \"Becoming the Wooden Eagle: experience with Salvia divinorum (ID 9991)\". Erowid.org. Jul 12, 2005. erowid.org/exp/9991",
 "substance": "Salvia divinorum",
 "bodyweight": "155 lb",
 "report": "<p>Salvia is quite an interesting substance that appears to affect each person to different degrees. The experience had with a given quantity is based on individual susceptibility. The best advice I can give to anyone wanting to try this drug is this: start with a small dose, a sitter, and some background distractions (music, TV, something that will remind you that there is a reality besides that of the salvia).</p><p>I had just driven 7 hours to visit a friend in Pennsylvania for a four day drug fest. I opted to start with some salvia. I had one bowl full through a water bong and did not hold it in for longer than 15 seconds. My mood was good, I was with my best friend who I had not seen in some time, but I was a bit apprehensive about this drug. I was instructed by him on how to enjoy the experience but I had not read any personal experience reports. I am surprised to see so many similarities of experience reported by different users.</p><p>About 30 seconds after exhaling I felt the pins and needles. It felt more like small wooden picks being stuck into my extremities. It was not unpleasant and I began to laugh so hard that I cried. I was trying to explain the experience to my friend, I was coherent, distracted because he was talking on the phone, and I felt as if I could shake the feeling off if I wanted to. I was still in some control and I recommend a similar set of circumstances to all first time users. My friend then told me to shut up, close my eyes and go with it.</p><p>It's at this point that I felt that I was flying. In fact, I was an eagle, an eagle made out of wood. I actually felt that I was made out of wood and at that point in my life I knew exactly how a piece of wood feels emotionally. I next became aware of 'the people'. They were not necessarily individual persons; they were more of a collective consciousness. They were very inviting and seemed to be of a Native American association. As the wooden eagle I could fly above them and enjoy their song or I could fly down close to them and commune with their presence. Higher in the air I seemed to be in communication with the village chief, but flying low and into the village, I was better able to relate to 'the people' as a whole. This whole experience took place in my mind's eye and seemed very dream-like. I feel that a higher dose of the Salvia would have forced me to get closer to 'the people' and I would have been in their village. I was between two worlds but still had some control. More Salvia = Less Control.</p><p>The drug wore off after about 20 minutes and I was left feeling euphoric for the rest of the evening. I do not feel that I have suffered any long-term consequences from my experience, however thinking about those alien Native American folk and my experiences as a piece of wood tend to bug me out at times. This drug is real and is not to be taken lightly. A friend of mine on the same dose reported no effect while another entered a state of true delirium and reported to have a very disturbing experience.</p>",
 "year": "2001",
 "id": "9991",
 "gender": "Male",
 "timestamp": "2005-07-12T07:00:00.000Z",
 "views": "3287",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "1 bowl",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "(extract - 5x)"
  }
 }
}
