{
 "title": "This Is More Than a Drug",
 "author": "pete",
 "citation": " pete. \"This Is More Than a Drug: experience with Salvia divinorum (ID 9992)\". Erowid.org. Jul 12, 2005. erowid.org/exp/9992",
 "substance": "Salvia divinorum",
 "bodyweight": "145 lb",
 "header": [
  [
   "DOSE:",
   "2 leaves",
   "smoked",
   "Salvia divinorum",
   "(leaves)"
  ]
 ],
 "report": "<p>I have been awaiting to get Salvia divinorum for 6 months, and yesterday my friends and I had finally gotten it. I had done much research on this plant/drug. But I know, like all substances that the only way to understand the drug, is to do the drug. So I was not knowing what was going to happen. My friend had made a crappy water pipe, but one that would work well enough. I loaded the bowl with one average size leaf (about 1 inch long and half inch wide). You are supposed to keep a flame over it all the time to keep it hot. I emptied my lungs, lit the Salvia and inhaled. I took about 3/4 of the bowl, inhaled some oxygen, and sat back and closed my eyes. You are supposed to hold it in for at least 20 seconds. You hold it in till you can't hold it in anymore, then it hits you. A huge head rush, and all of a sudden you don't know what is going on.</p><p>My first reaction was just to start cracking up. I couldn't breathe, I was drooling, I was laughing my ass off! After a long 5 minutes of laughing, I finally calmed down. Then I loaded the bowl with 2 leaves, and prepared to rise to a higher level. I took a gigantic hit, and held it in and laid back. If you have ever passed yourself out (holding your neck, or having someone cut off the circulation) It is exactly like that. You are awake one minute, then in an instant you dreaming. And the dream seems much more real, and you are having the time of your life. When you wake up, you have no clue what is going on, I thought I was in Africa, and my friends said that I had been out for 5 minutes. I had drool all over me, and I was still out of it.</p><p>Slowly the effects wear off and it is like being really stoned. in about 30 minutes, everything is normal, except you are more chilled out, and mellow. This is a note to everyone who is interested in trying salviabe careful. This is not a party drug, but more of a way to get into your subconscious mind. Also do not have a bunch of people there, especially if they have never tried salvia, and think that you are just out to get fucked up. This makes the experience hardyou can't concentrate well enough, and everyone is staring and you and making you feel really uncomfortable. Use great caution, use a sitter. Just be safe. Have fun.</p>",
 "year": "2001",
 "id": "9992",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2005-07-12T07:00:00.000Z",
 "views": "3521",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "2 leaves",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "(leaves)"
  }
 ]
}
