{
 "title": "New Favorite Psychedelic",
 "author": "Horizbiz",
 "citation": " Horizbiz. \"New Favorite Psychedelic: experience with 4-AcO-DMT (ID 99961)\". Erowid.org. Apr 30, 2013. erowid.org/exp/99961",
 "substance": "4-AcO-DMT",
 "bodyweight": "235 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "16 mg",
   "oral",
   "4-AcO-DMT",
   "(powder / crystals)",
   " T+ 1:30",
   "6 mg",
   "oral",
   "4-AcO-DMT",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "2013",
   "99961",
   "Male",
   "",
   "49",
   "Apr 30, 2013",
   "2414",
   " "
  ]
 ],
 "report": "<p>4-ACO-DMT fumerate</p><p>16 mg T:0:00</p><p>6 mg T+1:30</p><p>I recently tripped in the morning with my wife. I took 16 orally mg to start and she took 12mg. Other trip reports indicate a weight dependency so I proportioned it to our respective weights of 230 and 160 lbs.</p><p>It was a fairly gentile come up compared to shrooms probably lasting about an hour and a half until the peak. At about T40 there was some nausea lasting about 30 min but completely manageable.</p><p>We had on some music which my wife spent dancing to during this period. At t+1:30 I felt like I had under dosed and did another 6mg. My wife suffers from migraines, and at the beginning of this trip had one that was kicking in and almost didn't trip. Very nicely the 4-ACO terminated the migraine at t:+0:40 as she was coming up. It makes sense since she usually uses a tryptamine based drug to treat them.</p><p>At the peak there was noticeable color saturation and CEVs were very DMT like with mandalas formed of dark rib and vertebrae structures moving through my field of vision. These sometimes created cathedral like structures and at other times morphed into DMT like runes. What is interesting is that we both saw almost exactly the same things. These visuals were much more defined than the visuals I see on shrooms and would have been scarier on shrooms but we both really enjoyed watching them morph to the music.</p><p>Music sounded great with a tremendous fullness, 3d quality and the feeling that the performer was right in front of me. We spent about 2 hours just listening to music.</p><p>We were both remarkably clear headed during the entire trip and could have easily functioned in public. Things were ridiculously funny but laughing was controllable. The 4aco doesn't have the emotional depth of the shroom trip, which is a nice option to have. My wife was back to baseline at t:+6:30 and I was back by t+8:00. That extra 6 mg definitely extended the trip and I think it lasted about an hour longer than a comparable shroom trip.</p><p>My wife also experienced several euphoric phases that she termed as brain orgasms. This is the first time she experienced them and really enjoyed them. Her migraine did not return afterwards. Usually she requires multiple doses of her regular meds to get rid of them so there might be something in this for people with migraines.</p><p>I would definitely like to do straight Psilocin to see if it is the same trip. Compared to shrooms this is definitely a unique drug and is now my wifes favorite.</p>"
}
