{
 "id": 9998,
 "title": "Unpleasant Constrictions",
 "date": {
  "submission": "2007-03-04T08:00:00.000Z",
  "experience": "2007-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Fragrant Lisp",
  "gender": "Male",
  "weight": 75
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "number": "7.0",
    "unit": "mg"
   },
   "administration": "oral",
   "substance": "5-MeO-MIPT",
   "form": "powder/crystals"
  }
 ],
 "report": [
  "After reading so many positive things about this substance, its benign nature, warm body glow etc. I was eager as hell to give it a go.  Set and setting were ideal. I'm a happy little clam in my little clamshell home, which has been crafted specifically to provide a pleasant tripping environment. I was on no other meds.",
  "As it turns out, the material yielded little in the way of positive results  I was only glad it was over quickly. ",
  "As it happens:",
  "00:20 - First alerts, developing quickly into hot flushes and a heavy feeling in my stomach. Im feeling slightly jittery and I may have arrhythmia. Im also feeling a bit sleepy.",
  "00:45 - Feeling pretty crappy, jittery, achy, gassy, etc. Minor visuals not unlike 2c-e in nature are developing, but far more subtle, ahhh wait a minute ... Im starting to feel good ... oh, no Im mistaken, Im not feeling good at all.",
  "00:50 - Im mentally lucid, but have a small amount of anxiety. The effects are getting more intense and I am having difficulty breathing at times. I am experiencing body tremors, and feeling cold, then hot. CEVs are present in brief moments, although gone entirely at others. My throat muscles feel constricted, like jaw clenching, only its throat clenching. This material is feeling a bit unfriendly, as if it wants to strangle me  it reminds me of smoked 5MeO-DMT, and it comes on in waves.  I ask my sitter to sit beside me and assist with calming my growing unrest.  Im feeling pretty glad at this point that I didnt take a higher dose.",
  "01:15  In an attempt to settle my stomach and calm the tremors, Im eating an apple with cheddar cheese, and the taste is incredible  this is a definite food enhancer, despite the unsettled stomach.  I am now consistently cold and have a huge and unpleasant body load, which I would love to remedy with some yoga, but Im too damn cold to get up from under my blanket on the couch. At times I feel totally disembodied and certainly fatigued.  I am hypersensitive to drafts, and can feel the air moving about me. ",
  "01:30  Wow, it seems the peak is over already, and I am disappointed, because I was waiting in vain for something interesting to happen.  Im going to the kitchen to make some grub.",
  "02:00 - Just finished cooking a wonderful Tom Kah soup. While I was cooking, I went from sober to tripping and back so many times, the whole ordeal was very confusing. Music sounds very good though and has definitely provided a sense of comfort throughout the experience.  If nothing else, the substance has provided some minor visuals and a greater appreciation of music.",
  "02:15 - Im feeling unsettled, not knowing what to do with myself. I dont know if I feel good or bad, but Im pretty sure its bad. The food tasted pretty good however, and took away some of my jitters.",
  "03:00 - Just about baseline, but still jittery and somewhat cracked out.",
  "03:50 - Ahhh  showered and beginning to feel somewhat human again.",
  "By bedtime, I was feeling fine and slept soundly through the night. Next day as well, I felt fine.  All in all, this was not particularly enjoyable and Id say it was bordering on being difficult.  I will have to talk myself into doing it again, but I know I will, in time. ",
  "As a further note, my girlfriend tried this one at 11 mg.  She had fairly strong visuals throughout the evening.  She reported a pleasant body buzz and was beginning to think she may have stumbled upon a nice recreational substance, up until about the 2 hour mark. From there she slid into a long drawn out comedown that kept her up all night with a stomach ache and a severely cracked out feeling, even puking at the 3.5 hour mark!",
  "What a disappointment!  Im always a little sad when a new substance fails to offer up anything significantly beneficial. Ahhh well, such is the life of a research scientist, there are good ones and not-so-good ones to contend with."
 ],
 "erowid": {
  "id": "60110",
  "citation": " Fragrant Lisp. \"Unpleasant Constrictions: experience with 5-MeO-MIPT (ID 60110)\". Erowid.org. Mar 4, 2007. erowid.org/exp/60110",
  "substance": "5-MeO-MIPT",
  "views": "10760"
 }
}
